{"url": "http://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "text": "Martin Scorsese on The Irishman: 'Please, please don’t look at it on a phone' Five days after director’s mob epic hits Netflix, Scorsese urges viewers to see it on as big a screen as possibleMartin Scorsese has implored audiences not to watch his films – or those by other directors – on their smartphones.Scorsese was speaking to the Rolling Stone critic Peter Travers in the wake of the Netflix streaming release of his latest film, The Irishman.#NowWatching The Irishman the way Scorsese intended pic.twitter.com/rOa1rP5LYjI created a viewing guide for ever Read more\n\nShelley Morrison, Will and Grace actor, dies aged 83 Tributes paid to the actor who played Rosario Salazar in the US sitcom between 1999 and 2006Shelley Morrison, best known for her role as maid Rosario Salazar in the US comedy Will and Grace, has died at the age of 83 from heart failure following a short illness.Born to Sephardic Jewish parents who emigrated to the US from Spain, Morrison appeared in 68 episodes of the pioneering LGBT comedy between 1999 and 2006. While Morrison was reportedly only meant to be in the programme for a single episod Read more\n\nTV tonight: Prince Andrew's accuser speaks out Virginia Giuffre gives her first interview on British TV. Plus: the horrific effects of austerity on British children. Here’s what to watch this eveningPrince Andrew accuser Virginia Guiffre gives her first British television interview about her meetings with the prince in this hour-long special. She claims she was trafficked by Jeffrey Epstein and forced to have sex with the prince, and the royal family will no doubt be bracing themselves for more revelations about Prince Andrew’s r Read more\n\nHollywood blockbuster boom fuels record UK cinema advertising The Avengers, Frozen 2, Star Wars and Toy Story 4 prompt all-time high in advertising at the moviesA Hollywood blockbuster bonanza including the final instalments of the Avengers and Star Wars sagas, and Frozen 2 are fuelling an all-time record year for UK cinema advertising.Seven films have taken more than $1bn at the global box office so far this year – Avengers: Endgame, The Lion King, Spider-Man: Far from Home, Captain Marvel, Toy Story 4, Aladdin and Joker – resulting in an adve Read more\n\nStrictly Come Dancing 2019: quarter final results – as it happened In musicals week the couples tackled everything from Oliver! to Hairspray – but who’s going into the semi finals?8.01pm GMT Well on that bombshell, it’s all over for another week – get ready for a MASSIVE SEMI next week, when our four remaining couples will be dancing TWO DANCES; kick-off is at 7pm, so please join me then. Thank you all for joining in; you are the chorus line every liveblogger needs, and let’s face it you’ve been making me look good for years. Read more\n\nStrictly Come Dancing 2019: the quarter final – results night It’s musicals week, and the five remaining couples tackled everything from Oliver! to Hairspray. But who will be in the semi-finals?7.40pm GMT Loving Idina’s red pantsuit, it’s fabulous. The song is quite mathematical, however, I’m not feeling the festive cheer. Dance-wise, Idina is accompanied by Giovanni and Karen contempo-wafting, but only Karen is barefoot. Brr. 7.37pm GMT Time for a musical interlude, courtesy of Idina Menzel. For those of you who have been on a diff Read more\n\nEmilia Clarke: ‘I didn’t want people to think of me as sick' As she stars in this year’s Christmas feelgood movie, Emilia Clarke talks about the intense scrutiny of Game of Thrones, how she coped with the brain haemorrhage that almost killed her – and why we all need to escape reality sometimesEmilia Clarke had a headache. It was 2011, just before Valentine’s Day and just after she’d wrapped on the first series of Game of Thrones, playing Daenerys Targaryen, Breaker of Chains, Mother of Dragons. She didn’t yet know, as she cr Read more\n\nThe week in radio and podcasts: Undiscussable review – compelling, essential listening Raw tales from the frontline of domestic abuse are presented with empathy and honesty by Charlie WebsterUndiscussable (podcasts.apple.com)\n\nCharlie Webster is a television presenter, mostly for Sky Sports, who works hard and does so much charity work you could declare her on a tax return and claim back your whole salary. She’s run loads of marathons – more than 10, a sort of madness – for various charities, including the Bobby Moore Fund for Cancer Research UK and Women’s Read more\n\nSeamus Heaney and the Music of What Happens review – this stirring tribute is poetry in motion With insight from those closest to him, this moving film celebrates the great poet’s life and extraordinary works\n\nI thought about Seamus Heaney and the Music of What Happens (BBC Two) long after the credits had passed, and not just because it is a gorgeous, almost luxurious documentary about one of the all-time greats. While it stands as an excellent tribute to the man and his work, it acts, too, as a history of the second half of the 20th century, laying out the Troubles through anecdote Read more\n\nStrictly Come Dancing 2019: the quarter final – as it happened It’s musicals week, and the five remaining couples tackled everything from Oliver! to Hairspray. Jazz hands at the ready!8.08pm GMT Thanks so much for joining in tonight and being hilarious down below as always – I’m off to eat pizza whilst reading your comments. We’re back here tomorrow night from 7.20pm for the Results Show, so please join me back here then! Hx *CURTAIN FALLS, HOUSE LIGHTS GO UP* 8.07pm GMT Goodness, the dancing’s over! That was quick. The lines a Read more\n\nStrictly Come Dancing 2019: the quarter final – live It’s musicals week, and the five remaining couples will be tackling everything from Oliver! to Hairspray. Jazz hands at the ready!6.59pm GMT You’d think it would be quite tough to make a prime time pop music quiz on BBC truly terrible, but this one really nails it.6.51pm GMT This week’s Strictly Come Bingo – have a swig of warm interval wine (please place your order at the bar now) for any occurrence of the following: Continue reading... Read more\n\nEveryone fantasises about their Desert Island Discs. These are mine The eternal question is whether to choose the songs that reflect the big moments in your life, or the songs you’d actually listen to for everShow me a child of the 80s who never fantasised about being interviewed by Wogan or Oprah, and I’ll show you a person without ambition. For some of us, that fantasy outlasts childhood. I still spend about, ooh, 65% of my free time imagining I’m being interviewed on the TV or radio, carefully practising my “Oh Graham Norton, you are g Read more\n\n'It's accurate': Peckham cinemagoers applaud Blue Story Attendees of south London screening say Vue ban after Birmingham brawl was ‘ridiculous’“Sadiq Khan and Boris Johnson need to go watch this,” says Tyron Harriett, a youth worker from south London, of Blue Story, the film which sparked controversy this week after Vue and Showcase Cinemas pulled it following a mass brawl in Birmingham.The move led to accusations of “institutional racism”, “negative bias” and “a systematic and targeted attack&rdq Read more", "images": ["http://www.newslocker.com/images/share-facebook.png", "http://www.newslocker.com/images/flags/gb.png", "https://img.newslocker.com/2019/12/02/196239357_725.jpg", "http://www.newslocker.com/images/flags/es.png", "https://img.newslocker.com/2019/11/29/196175026_350.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/flags/pt.png", "http://www.newslocker.com/images/rss.png", "https://img.newslocker.com/2019/12/02/196248160_725.jpg", "https://img.newslocker.com/2019/11/29/196175027_350.jpg", "http://www.newslocker.com/images/flags/fr.png", "http://www.newslocker.com/images/flags/be.png", "https://img.newslocker.com/2019/11/29/196177365_350.jpg", "https://img.newslocker.com/2019/12/02/196245587_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "http://www.newslocker.com/images/share-linkedin.png", "http://www.newslocker.com/images/flags/mx.png", "https://img.newslocker.com/2019/11/30/196210072_725.jpg", "https://img.newslocker.com/2019/11/29/196177366_350.jpg", "https://img.newslocker.com/2019/12/02/196238092_725.jpg", "http://www.newslocker.com/images/flags/ng.png", "http://www.newslocker.com/images/flags/cl.png", "https://img.newslocker.com/2019/12/01/196215391_725.jpg", "http://www.newslocker.com/images/flags/cr.png", "https://img.newslocker.com/2019/12/01/196216889_725.jpg", "http://www.newslocker.com/images/flags/ec.png", "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/flags/in.png", "https://img.newslocker.com/2019/11/30/196198057_725.jpg", "https://img.newslocker.com/2019/12/01/196230562_725.jpg", "https://img.newslocker.com/2019/12/01/196230563_350.jpg", "https://img.newslocker.com/2019/11/29/196172251_350.jpg", "http://www.newslocker.com/images/logo.jpg", "http://www.newslocker.com/images/flags/br.png", "http://www.newslocker.com/images/newslocker-cube.png", "http://www.newslocker.com/images/flags/do.png", "http://www.newslocker.com/images/flags/co.png", "http://www.newslocker.com/images/flags/ve.png", "https://img.newslocker.com/2019/12/01/196212299_725.jpg", "http://www.newslocker.com/images/flags/au.png", "https://img.newslocker.com/2019/11/30/196208393_725.jpg", "http://www.newslocker.com/images/flags/de.png", "https://img.newslocker.com/2019/11/29/196175509_725.jpg", "https://img.newslocker.com/2019/12/01/196215392_725.jpg", "https://img.newslocker.com/2019/12/01/196229434_725.jpg", "http://www.newslocker.com/images/flags/nl.png", "https://img.newslocker.com/2019/11/30/196195782_350.jpg", "https://img.newslocker.com/2019/12/02/196241229_350.jpg", "https://img.newslocker.com/2019/12/02/196238298_350.jpg", "http://www.newslocker.com/images/flags/ar.png", "http://www.newslocker.com/images/flags/it.png", "http://www.newslocker.com/images/flags/us.png", "https://img.newslocker.com/2019/11/29/196181868_725.jpg", "http://www.newslocker.com/images/flags/bo.png", "http://www.newslocker.com/images/flags/ca.png", "http://www.newslocker.com/images/flags/pe.png", "https://img.newslocker.com/2019/12/01/196215644_350.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com:443/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "title": "Move Over, Zac Efron! Ansel Elgort Is Ready to Be Hollywood's Next Heartthrob", "meta_data": {"description": "Efron. Tatum. Hemsworth. Hemsworth. Pratt. Pine. Any other famous Chris' we might have missed. The list of actors in Young Hollywood who can truly be described as heartthrobs on-and-off-screen...", "og": {"title": "Move Over, Zac Efron! Ansel Elgort Is Ready to Be Hollywood's Next Heartthrob - Cinema, Theater & TV news - NewsLocker", "description": "Efron. Tatum. Hemsworth. Hemsworth. Pratt. Pine. Any other famous Chris' we might have missed. The list of actors in Young Hollywood who can truly be described as heartthrobs on-and-off-screen...", "type": "website", "url": "https://www.newslocker.com:443/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": "1335791813,560345808"}, "robots": "index", "tradetracker-site-verification": "5d3490426a1947bbfe3c56de4fa490c0ba416113", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1498831200.0, "source": "http://www.newslocker.com", "summary": ""}