{"url": "https://www.independent.co.uk/news/world/americas/steven-seagal-sexual-harassment-women-tape-audio-comments-dirty-a8016361.html", "text": "Actor Steven Seagal has been caught on tape calling female reporters “c***suckers” and “a bunch of f***ing dirty whores” in leaked tapes.\n\nThe 65-year-old, who is facing several sexual harassment allegations, can be heard ranting to a male interviewer about female journalists in audio clips obtained by the Daily Mail.\n\n“Well, I found that interestingly enough, the few times that I had a hard time, it was usually with women,” the actor said in the clip captured while Seagal was promoting his 1988 film Above the Law.\n\nDownload the new Indpendent Premium app Sharing the full story, not just the headlines\n\n“When somebody is on tour, a promotional tour, he’s there to talk about his film, not about who he’s f***ed or who he would like to f*** or who his wife was with ten years ago.\n\n“They should go into pornography or something else instead of journalism if they want to hear that s***. They’re a bunch of a**holes,” he continued.\n\nThe actor goes on to recall a time a female reporter wrote false and discriminating stories about him after she “pretended like she was in love.”\n\n“If I ever see her again, I’ll tell her to her face, I think she belongs in a zoo,” he said. “Bunch of f***ing dirty whores!”\n\n“You sit down with this sweet little nice girl and she seems to adore you and all this and that, and you're a perfect gentleman, and you know, unbelievable.\n\n“The way you combat is by let's not ever do an interview again to show these c***suckers,” he said.\n\nIn the wake of the Harvey Weinstein scandal, a number of women have come forward with allegations of sexual harassment against Mr Seagal.\n\nShape Created with Sketch. World news in pictures Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. World news in pictures 1/50 2 December 2019 A youth plays on foamy discharge, caused by pollutants, as it mixes with the surf at a beach in Chennai AFP via Getty 2/50 1 December 2019 Southeast Asian Games at the Royce Hotel, Mabalacat, Philippines. Vietnam's Pham Hong Anh in action during her single dance final. Reuters 3/50 30 November 2019 A woman holds a coloured flag at the Botswana Pride Parade in Gaborone. The parade is the first one organised in Botswana, after the Court ruled on June 11 in favour of decriminalising homosexuality, which had been punishable by a jail term of up to seven years. AFP via Getty 4/50 29 November 2019 A child holds a placard during a 'drop dead' flashmob protest against climate change consequences at Lumpini Park in Bangkok, Thailand Reuters 5/50 28 November 2019 Pro-democracy protesters hold an SOS sign and US national flags during a Thanksgiving rally in Edinburgh Place, Hong Kong. Protesters were thanking US President Donald Trump for signing into a law 'The Hong Kong Human Rights and Democracy Act Hong Kong', provoking an angry backlash from the Chinese government. Hong Kong is in its sixth month of mass protests, which were originally triggered by a now withdrawn extradition bill, and have since turned into a wider pro-democracy movement EPA 6/50 27 November 2019 Rescuers with a dog search through the rubble of a collapsed building after an earthquake in Durres, western Albania AP 7/50 26 November 2019 A shepherd leads a flock of sheep on a pontoon bridge in Allahabad AFP via Getty 8/50 25 November 2019 North Korean leader Kim Jong Un inspects a female company belonging to 5492 troops KCNA via Reuters 9/50 24 November 2019 A protester jumps between burning tires during ongoing anti-government protests in Basra, Iraq Reuters 10/50 23 November 2019 Fans dressed as Star Wars characters during day three of the first Test between Australia and Pakistan at The Gabba in Australia Getty 11/50 22 November 2019 Pope Francis speaks with religious leaders during a meeting at the Chulalongkorn University in Bangkok, Thailand Reuters 12/50 21 November 2019 A girl injured in last night's attack by the Syrian regime on a camp for displaced people near the Turkish border in Idlib, Syria is held up to the camera AFP/Getty 13/50 20 November 2019 Indian paramilitary soldiers detain a Congress party supporter during a protest against the withdrawal of Special Protection Group (SPG) cover to party president Sonia Gandhi, her children and former prime minister Manmohan Singh, in New Delh. The move to lift off the SPG security, an elite force that protects prime ministers and their immediate families, led to sharp reactions from the Congress, which accused the government of personal vendetta AP 14/50 19 November 2019 An image taken from a plane window shows Sydney shrouded in smoke from nearby bush fires AAP Imagevia Reuters 15/50 18 November 2019 Protesters run for cover after riot police fired tear gas towards the bridge they were climbing down to the road below, to escape from Hong Kong Polytechnic University. Dozens escaped the besieged campus by lowering themselves on a rope from a footbridge to a highway. Once on the road they were seen being picked up by waiting motorcyclists AFP via Getty 16/50 17 November 2019 Anti-government protesters draped in Iraqi national flags walk into clouds of smoke from burning tires during a demonstration in the southern city of Basra, Iraq AFP via Getty 17/50 16 November 2019 A protester wearing a yellow jacket waves a French flag in a fountain during a demonstration to mark the first anniversary of the \"yellow vests\" movement in Nice, France Reuters 18/50 15 November 2019 A Palestinian protester uses a slingshot to return a tear gas canister fired by Israeli forces amid clashes following a weekly demonstration against the expropriation of Palestinian land by Israel in the village of Kfar Qaddum AFP via Getty 19/50 14 November 2019 A patient suffering from dengue fever receives medical treatment at an isolation ward at a hospital in Larkana, Pakistan. According to local reports, 26 deaths have been reported out of a total of 10,013 confirmed cases of dengue infection. Dengue fever is reportedly caused by a specific type of mosquito, the Aedes mosquito, that bites only during daytime, especially during sunrise and sunset. EPA 20/50 13 November 2019 An anti-government protester flashes the V-sign for victory in front of burning tyres used to block a main road at the entrance of Tripoli. The previous night, street protests erupted across Lebanon after President Michel Aoun defended the role of his allies, the Shiite movement Hezbollah, in Lebanon's government, cutting off several major roads. In his televised address, Aoun proposed a government that includes both technocrats and politicians AFP via Getty 21/50 12 November 2019 An Israeli missile launching from the Iron Dome defence missile system, designed to intercept and destroy incoming short-range rockets and artillery shells. They were sent up to intercept rockets launched from the nearby Palestinian Gaza Strip. Israel's military killed a commander for Palestinian militant group Islamic Jihad in a strike on his home, prompting retaliatory rocket fire and fears of a severe escalation in violence AFP/Getty 22/50 11 November 2019 A species of deer thought to be extinct, the chevrotain, has been spotted for the first time in 30 years in the wilds of Vietnam. The deer is around the size of a domestic cat SIE/GWC/Leibniz-IZW/NCNP /SWNS.C 23/50 10 November 2019 The royal motorcade of Japanese Emperor Naruhito and Empress Masako, under tight security, passes through a street in Tokyo. Thousands of people gathered for the rare open-top car parade featuring the newly enthroned Emperor Kyodo News via AP 24/50 9 November 2019 People knock over a mock-up of the former Berlin Wall during a performance prior to the German first division Bundesliga football match Hertha BSC Berlin v RB Leipzig on the 30 anniversary of the fall off the wall AFP/Getty 25/50 8 November 2019 Flames from an out of control bushfire from a nearby residential area in Harrington, northeast of Sydney. Australian firefighters warned they were in \"uncharted territory\" as they struggled to contain dozens of out-of-control bushfires across the east of the country Kelly-ann Oosterbeek/AFP/Getty 26/50 7 November 2019 Demonstrators shine lasers during a protest against Chile's government in Santiago, the capital Reuters 27/50 6 November 2019 Activists from India's main opposition Congress party shout slogans as they are stopped by police during a protest against what the activists say is economic slowdown in the country, in Guwahati, India Reuters 28/50 5 November 2019 Smoke rises from a fire in downtown Lagos, Nigeria. Firefighters worked hard to try and extinguish a fire at the Balogun market. Thick black smoke and flames shot from the five-story buildings as fire trucks attempted to get access AP 29/50 4 November 2019 Women run down a sand dune as they take part in the desert trek \"Rose Trip Maroc\" in the erg Chebbi near Merzouga. It is a female-oriented trek where teams of three must travel through the southern Moroccan Sahara desert with a compass, a map and a topographical reporter AFP via Getty 30/50 3 November 2019 Riot police descend an escalator inside the City Plaza mall in Hong Kong after a bloody knife fight wounded six people there. A local pro-democracy politician had his ear bitten off during another chaotic day of political unrest in the city AFP via Getty 31/50 2 November 2019 People participate in the celebration of the 'muerteadas de Jalapa del Valle', as part of the Day of the Dead in Mexico EPA 32/50 1 November 2019 Firefighters work to control flames from a backfire during the Maria fire in Santa Paula, California AFP via Getty 33/50 31 October 2019 Aurora Borealis, the Northern Lights, over the Vestrahorn mountain in the east of Iceland PA 34/50 30 October 2019 A model presents a creation at the show Heaven Gaia by Xiong Ying during the China Fashion Week in Beijing. The fashion event runs from 25 October to 2 November EPA 35/50 29 October 2019 Hindu devotees collect rice as offerings on 'Annakut' or 'Govardhan Puja' festival at the Madan Mohan temple in Kolkata. People in large numbers gather at the temple to collect the rice offerings in the belief that it will keep them in good health and they'll never face poverty or scarcity of food AFP via Getty 36/50 28 October 2019 Authorities investigate after a Port Authority bus was caught in a sinkhole in downtown Pittsburgh, Pennsylvania AP 37/50 27 October 2019 South Africa players celebrate after beating Wales in their Rugby World Cup semi-final match. The Springboks will face England in next Saturday's final following fly-half Handre Pollard's match-winning penalty four minutes from time. The match ended 19-16 Reuters 38/50 26 October 2019 Participants from Thailand pose in front of the Chiang Kai-shek Memorial Hall as they take part in the annual gay pride parade in Taipei. Some two hundred thousand revellers marched through Taipei in a riot of rainbow colours and celebration as Taiwan held its first pride parade since making history in Asia by legalising gay marriage AFP/Getty 39/50 25 October 2019 A girl enjoys a ball bath as she is being photographed at the made-for-Instagram museum 'Cali Dreams' in Dusseldorf, Germany. No artworks are shown in this museum, rather each visitor himself becomes an artwork by staging himself in front of one of the 25 sceneries. Cali Dreams is initially open for three months. After this test phase, however, the museum is planned as a long-term project EPA 40/50 24 October 2019 A fire lorry speeds towards a rampant wildfire near Geyserville, California AFP/Getty 41/50 23 October 2019 Protesters facing Lebanese army soldiers wave national flags in the area of Jal al-Dib in the northern outskirts of Beirut. A week of unprecedented street protests against the political class showed no signs of abating, despite the army moving to reopen key roads. Protests were sparked on October 17 by a proposed tax on WhatsApp and other messaging apps AFP/Getty 42/50 22 October 2019 Liberal leader and Canadian Prime Minister Justin Trudeau waves to supporters beside his wife Sophie after the federal election at the Palais des Congres in Montreal. He managed to hold on to power, albeit of a minority government, in one of the most divisive elections in the country’s history Reuters 43/50 21 October 2019 A convoy of US vehicles is seen after withdrawing from northern Syria, on the outskirts of Dohuk, Iraq Reuters 44/50 20 October 2019 Japan players go over to thank their fans after South Africa beat them in the quarter-final of the Rugby World Cup. Makazole Mapimpi double ended the hosts’ dreams in Tokyo 3-26. The Springboks will now face Wales in the semi-finals for a place in the final Reuters 45/50 19 October 2019 Archaeologists remove the cover of an ancient painted coffin discovered at Al-Asasif Necropolis in the Vally of Kings in Luxor, Egypt Reuters 46/50 18 October 2019 A protester throws a tire on a fire to block the highway north of Beirut, Lebanon. Protesters, mainly civil activists, started demonstrating in the downtown area on 17 October, condemning proposed taxes in the 2020 budget. An unexpected addition to impose a daily fee for using WhatsApp calls caused outrage. However, according to the Telecommunications Minister Mohamed Choucair, the charge will not make it through the government palace after the impact it has made on the streets EPA 47/50 17 October 2019 Children watch as army tanks are transported on trucks in the outskirts of the town of Akcakale, in Sanliurfa province, southeastern Turkey, at the border of Syria AP 48/50 16 October 2019 North Korean leader Kim Jong Un riding a white horse amongst the first snow at Mouth Paektu KCNA VIA KNS/AFP/Getty 49/50 15 October 2019 Protesters create a burning barricade after the Supreme Court in Madrid handed lengthy prison sentences to nine of the detained Catalonian leaders for up to 13 years each EPA 50/50 14 October 2019 Protestors light their torches during a peaceful rally in central Hong Kong's business district. The protests that started in June over a now-shelved extradition bill have since snowballed into an anti-China campaign amid anger over what many view as Beijing's interference in Hong Kong's autonomy that was granted when the former British colony returned to Chinese rule in 1997 AP 1/50 2 December 2019 A youth plays on foamy discharge, caused by pollutants, as it mixes with the surf at a beach in Chennai AFP via Getty 2/50 1 December 2019 Southeast Asian Games at the Royce Hotel, Mabalacat, Philippines. Vietnam's Pham Hong Anh in action during her single dance final. Reuters 3/50 30 November 2019 A woman holds a coloured flag at the Botswana Pride Parade in Gaborone. The parade is the first one organised in Botswana, after the Court ruled on June 11 in favour of decriminalising homosexuality, which had been punishable by a jail term of up to seven years. AFP via Getty 4/50 29 November 2019 A child holds a placard during a 'drop dead' flashmob protest against climate change consequences at Lumpini Park in Bangkok, Thailand Reuters 5/50 28 November 2019 Pro-democracy protesters hold an SOS sign and US national flags during a Thanksgiving rally in Edinburgh Place, Hong Kong. Protesters were thanking US President Donald Trump for signing into a law 'The Hong Kong Human Rights and Democracy Act Hong Kong', provoking an angry backlash from the Chinese government. Hong Kong is in its sixth month of mass protests, which were originally triggered by a now withdrawn extradition bill, and have since turned into a wider pro-democracy movement EPA 6/50 27 November 2019 Rescuers with a dog search through the rubble of a collapsed building after an earthquake in Durres, western Albania AP 7/50 26 November 2019 A shepherd leads a flock of sheep on a pontoon bridge in Allahabad AFP via Getty 8/50 25 November 2019 North Korean leader Kim Jong Un inspects a female company belonging to 5492 troops KCNA via Reuters 9/50 24 November 2019 A protester jumps between burning tires during ongoing anti-government protests in Basra, Iraq Reuters 10/50 23 November 2019 Fans dressed as Star Wars characters during day three of the first Test between Australia and Pakistan at The Gabba in Australia Getty 11/50 22 November 2019 Pope Francis speaks with religious leaders during a meeting at the Chulalongkorn University in Bangkok, Thailand Reuters 12/50 21 November 2019 A girl injured in last night's attack by the Syrian regime on a camp for displaced people near the Turkish border in Idlib, Syria is held up to the camera AFP/Getty 13/50 20 November 2019 Indian paramilitary soldiers detain a Congress party supporter during a protest against the withdrawal of Special Protection Group (SPG) cover to party president Sonia Gandhi, her children and former prime minister Manmohan Singh, in New Delh. The move to lift off the SPG security, an elite force that protects prime ministers and their immediate families, led to sharp reactions from the Congress, which accused the government of personal vendetta AP 14/50 19 November 2019 An image taken from a plane window shows Sydney shrouded in smoke from nearby bush fires AAP Imagevia Reuters 15/50 18 November 2019 Protesters run for cover after riot police fired tear gas towards the bridge they were climbing down to the road below, to escape from Hong Kong Polytechnic University. Dozens escaped the besieged campus by lowering themselves on a rope from a footbridge to a highway. Once on the road they were seen being picked up by waiting motorcyclists AFP via Getty 16/50 17 November 2019 Anti-government protesters draped in Iraqi national flags walk into clouds of smoke from burning tires during a demonstration in the southern city of Basra, Iraq AFP via Getty 17/50 16 November 2019 A protester wearing a yellow jacket waves a French flag in a fountain during a demonstration to mark the first anniversary of the \"yellow vests\" movement in Nice, France Reuters 18/50 15 November 2019 A Palestinian protester uses a slingshot to return a tear gas canister fired by Israeli forces amid clashes following a weekly demonstration against the expropriation of Palestinian land by Israel in the village of Kfar Qaddum AFP via Getty 19/50 14 November 2019 A patient suffering from dengue fever receives medical treatment at an isolation ward at a hospital in Larkana, Pakistan. According to local reports, 26 deaths have been reported out of a total of 10,013 confirmed cases of dengue infection. Dengue fever is reportedly caused by a specific type of mosquito, the Aedes mosquito, that bites only during daytime, especially during sunrise and sunset. EPA 20/50 13 November 2019 An anti-government protester flashes the V-sign for victory in front of burning tyres used to block a main road at the entrance of Tripoli. The previous night, street protests erupted across Lebanon after President Michel Aoun defended the role of his allies, the Shiite movement Hezbollah, in Lebanon's government, cutting off several major roads. In his televised address, Aoun proposed a government that includes both technocrats and politicians AFP via Getty 21/50 12 November 2019 An Israeli missile launching from the Iron Dome defence missile system, designed to intercept and destroy incoming short-range rockets and artillery shells. They were sent up to intercept rockets launched from the nearby Palestinian Gaza Strip. Israel's military killed a commander for Palestinian militant group Islamic Jihad in a strike on his home, prompting retaliatory rocket fire and fears of a severe escalation in violence AFP/Getty 22/50 11 November 2019 A species of deer thought to be extinct, the chevrotain, has been spotted for the first time in 30 years in the wilds of Vietnam. The deer is around the size of a domestic cat SIE/GWC/Leibniz-IZW/NCNP /SWNS.C 23/50 10 November 2019 The royal motorcade of Japanese Emperor Naruhito and Empress Masako, under tight security, passes through a street in Tokyo. Thousands of people gathered for the rare open-top car parade featuring the newly enthroned Emperor Kyodo News via AP 24/50 9 November 2019 People knock over a mock-up of the former Berlin Wall during a performance prior to the German first division Bundesliga football match Hertha BSC Berlin v RB Leipzig on the 30 anniversary of the fall off the wall AFP/Getty 25/50 8 November 2019 Flames from an out of control bushfire from a nearby residential area in Harrington, northeast of Sydney. Australian firefighters warned they were in \"uncharted territory\" as they struggled to contain dozens of out-of-control bushfires across the east of the country Kelly-ann Oosterbeek/AFP/Getty 26/50 7 November 2019 Demonstrators shine lasers during a protest against Chile's government in Santiago, the capital Reuters 27/50 6 November 2019 Activists from India's main opposition Congress party shout slogans as they are stopped by police during a protest against what the activists say is economic slowdown in the country, in Guwahati, India Reuters 28/50 5 November 2019 Smoke rises from a fire in downtown Lagos, Nigeria. Firefighters worked hard to try and extinguish a fire at the Balogun market. Thick black smoke and flames shot from the five-story buildings as fire trucks attempted to get access AP 29/50 4 November 2019 Women run down a sand dune as they take part in the desert trek \"Rose Trip Maroc\" in the erg Chebbi near Merzouga. It is a female-oriented trek where teams of three must travel through the southern Moroccan Sahara desert with a compass, a map and a topographical reporter AFP via Getty 30/50 3 November 2019 Riot police descend an escalator inside the City Plaza mall in Hong Kong after a bloody knife fight wounded six people there. A local pro-democracy politician had his ear bitten off during another chaotic day of political unrest in the city AFP via Getty 31/50 2 November 2019 People participate in the celebration of the 'muerteadas de Jalapa del Valle', as part of the Day of the Dead in Mexico EPA 32/50 1 November 2019 Firefighters work to control flames from a backfire during the Maria fire in Santa Paula, California AFP via Getty 33/50 31 October 2019 Aurora Borealis, the Northern Lights, over the Vestrahorn mountain in the east of Iceland PA 34/50 30 October 2019 A model presents a creation at the show Heaven Gaia by Xiong Ying during the China Fashion Week in Beijing. The fashion event runs from 25 October to 2 November EPA 35/50 29 October 2019 Hindu devotees collect rice as offerings on 'Annakut' or 'Govardhan Puja' festival at the Madan Mohan temple in Kolkata. People in large numbers gather at the temple to collect the rice offerings in the belief that it will keep them in good health and they'll never face poverty or scarcity of food AFP via Getty 36/50 28 October 2019 Authorities investigate after a Port Authority bus was caught in a sinkhole in downtown Pittsburgh, Pennsylvania AP 37/50 27 October 2019 South Africa players celebrate after beating Wales in their Rugby World Cup semi-final match. The Springboks will face England in next Saturday's final following fly-half Handre Pollard's match-winning penalty four minutes from time. The match ended 19-16 Reuters 38/50 26 October 2019 Participants from Thailand pose in front of the Chiang Kai-shek Memorial Hall as they take part in the annual gay pride parade in Taipei. Some two hundred thousand revellers marched through Taipei in a riot of rainbow colours and celebration as Taiwan held its first pride parade since making history in Asia by legalising gay marriage AFP/Getty 39/50 25 October 2019 A girl enjoys a ball bath as she is being photographed at the made-for-Instagram museum 'Cali Dreams' in Dusseldorf, Germany. No artworks are shown in this museum, rather each visitor himself becomes an artwork by staging himself in front of one of the 25 sceneries. Cali Dreams is initially open for three months. After this test phase, however, the museum is planned as a long-term project EPA 40/50 24 October 2019 A fire lorry speeds towards a rampant wildfire near Geyserville, California AFP/Getty 41/50 23 October 2019 Protesters facing Lebanese army soldiers wave national flags in the area of Jal al-Dib in the northern outskirts of Beirut. A week of unprecedented street protests against the political class showed no signs of abating, despite the army moving to reopen key roads. Protests were sparked on October 17 by a proposed tax on WhatsApp and other messaging apps AFP/Getty 42/50 22 October 2019 Liberal leader and Canadian Prime Minister Justin Trudeau waves to supporters beside his wife Sophie after the federal election at the Palais des Congres in Montreal. He managed to hold on to power, albeit of a minority government, in one of the most divisive elections in the country’s history Reuters 43/50 21 October 2019 A convoy of US vehicles is seen after withdrawing from northern Syria, on the outskirts of Dohuk, Iraq Reuters 44/50 20 October 2019 Japan players go over to thank their fans after South Africa beat them in the quarter-final of the Rugby World Cup. Makazole Mapimpi double ended the hosts’ dreams in Tokyo 3-26. The Springboks will now face Wales in the semi-finals for a place in the final Reuters 45/50 19 October 2019 Archaeologists remove the cover of an ancient painted coffin discovered at Al-Asasif Necropolis in the Vally of Kings in Luxor, Egypt Reuters 46/50 18 October 2019 A protester throws a tire on a fire to block the highway north of Beirut, Lebanon. Protesters, mainly civil activists, started demonstrating in the downtown area on 17 October, condemning proposed taxes in the 2020 budget. An unexpected addition to impose a daily fee for using WhatsApp calls caused outrage. However, according to the Telecommunications Minister Mohamed Choucair, the charge will not make it through the government palace after the impact it has made on the streets EPA 47/50 17 October 2019 Children watch as army tanks are transported on trucks in the outskirts of the town of Akcakale, in Sanliurfa province, southeastern Turkey, at the border of Syria AP 48/50 16 October 2019 North Korean leader Kim Jong Un riding a white horse amongst the first snow at Mouth Paektu KCNA VIA KNS/AFP/Getty 49/50 15 October 2019 Protesters create a burning barricade after the Supreme Court in Madrid handed lengthy prison sentences to nine of the detained Catalonian leaders for up to 13 years each EPA 50/50 14 October 2019 Protestors light their torches during a peaceful rally in central Hong Kong's business district. The protests that started in June over a now-shelved extradition bill have since snowballed into an anti-China campaign amid anger over what many view as Beijing's interference in Hong Kong's autonomy that was granted when the former British colony returned to Chinese rule in 1997 AP\n\nTV reporter Lisa Guerrero told the Hollywood Reporter the actor allegedly invited her to his home for a “private audition” in 1996.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nSuspicious of the invite, Ms Guerrero said she brought a female casting director with her.\n\nShe said Mr Seagal answered the door in a silk robe and although he never exposed himself to her or touched her, she said the actor told her she could have a bigger role if she returned for a “private rehearsal.”\n\nActress Rae Dawn Chong made similar claims in a blog The Wrap.", "images": ["https://trc.taboola.com/1036135/log/3/unip?en=page_view", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2010/04/14/19/353359.bin"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2010/04/14/19/353359.bin", "keywords": [], "authors": ["Lydia Smith"], "canonical_link": "https://www.independent.co.uk/news/world/americas/steven-seagal-sexual-harassment-women-tape-audio-comments-dirty-a8016361.html", "title": "Steven Seagal calls female reporters 'a bunch of f***ing dirty whores' in tape leaked amid sexual harassment claims", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/world/americas/steven-seagal-sexual-harassment-women-tape-audio-comments-dirty-a8016361.html", "title": "Steven Seagal calls female reporters a 'bunch of f***ing dirty whores' in leaked tape", "description": "Actor can be heard ranting to male interviewer about women in media", "updated_time": "2017-10-24T00:20:11+01:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2010/04/14/19/353359.bin", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "ia": {"markup_url": "https://www.independent.co.uk/pwamp/fbi/8016361"}, "description": "Actor Steven Seagal has been caught on tape calling female reporters “c***suckers” and “a bunch of f***ing dirty whores” in leaked tapes. The 65-year-old, who is facing several sexual harassment allegations, can be heard ranting to a male interviewer about female journalists in audio clips obtained by the Daily Mail.", "keywords": "Steven Seagal, Harvey Weinstein, harassment, Rae Dawn Chong, Lisa Guerrero, Daily Mail, Americas, World, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"tag": "Steven Seagal", "published_time": "2017-10-24T00:20:11+01:00", "modified_time": "2017-10-24T00:20:11+01:00", "section": "Americas", "author_name": "Lydia Smith", "content_type": "story", "word_count": 397, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 4, "external_link_count": 3}, "twitter": {"title": "Steven Seagal calls female reporters a 'bunch of f***ing dirty whore…", "description": "Actor Steven Seagal has been caught on tape calling female reporters “c***suckers” and “a bunch of f***ing dirty whores” in leaked tapes. The 65-year-old, who is facing several sexual harassment", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1508800811.0, "source": "https://www.independent.co.uk", "summary": ""}