{"url": "us.pressfrom.com/news/entertainment/-144004-what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin/", "text": "Utah parents kill their 2 children before themselves after believing mom had terminal disease A couple who recently moved from Switzerland to Utah planned a murder-suicide that left their family of four dead, buying sleeping pills and researching shootings, according to a police report on the investigation into the deaths that was released last week.A couple who recently moved from Switzerland to Utah planned a murder-suicide that left their family of four dead in November after they believed the mother was suffering from a terminal disease, a new police report stated. What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin . The Working Girl star, 60, opened up about her daughter ’s romance with the Coldplay frontman on Thursday when asked if she gave the Fifty Shades of Grey star any dating advice when it came to What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin .\n\n© John Salangsang/BFA/REX/Shutterstock Melanie Griffith Melanie Griffith is over the moon about her daughter Dakota Johnson‘s beau Chris Martin.\n\n\n\nThe Working Girl star, 60, opened up about her daughter’s romance with the Coldplay frontman on Thursday when asked if she gave the Fifty Shades of Grey star any dating advice when it came to her relationship with Martin.\n\n“I adore him!” Griffith said while at the Global Gift Foundation USA Women’s Empowerment Luncheon. “But she is very private about her life and I respect that.”\n\nJohnson and Martin sparked dating rumors after being spotted on a mid-October sushi date in Los Angeles.\n\nSon of cop killed on duty gets police escort to school\n\nWhen Dakota Pitts returned to school for the first time after losing his dad in the line of duty, he got a special welcome from his father's colleaguesFive-year-old Dakota Pitts returned to school for the first time on Monday after losing his father about a week ago. Dakota's dad, Rob Pitts, was Indiana police officer for the Terre Haute and Sullivan police departments. Pitts was killed in the line of duty.\n\nMelanie Griffith 'Adores' Daughter Dakota 's Beau Chris Martin . The Working Girl star, 60, opened up about her daughter ’s romance with the Coldplay frontman on Thursday when asked if she gave the Fifty Shades of Grey star any dating advice when it came to her relationship with Martin . Melanie Griffith 'Adores' Daughter Dakota 's Beau Chris Martin . The Working Girl star, 60, opened up about her daughter ’s romance with the Coldplay frontman on Thursday when asked if she gave the Fifty Shades Similar from the Web. What Melanie Griffith Really Thinks About Daughter Dakota .\n\nThe two were “cozy, laughing and affectionate” a source said at the time, adding it was just the two of them enjoying dinner.\n\n© Provided by TIME Inc.\n\nThe spent time together earlier this year while in Malibu with a different source telling PEOPLE, “They had dinner with friends. They also hung out at Chris’ house and went for a beach walk. They didn’t see each other over the holidays and seem to be catching up now.”\n\nMartin and Johnson were later seen grabbing food and drinks at Soho House in Malibu, where they were snapped smiling and laughing together. An eyewitness told PEOPLE, “Chris and Dakota arrived together in Chris’ car. They met up with friends and had a fun night. They both seemed very happy. They were flirty, and also left the restaurant together.”\n\nTrump misspells Melania's name in initial tweet welcoming her back to White House\n\nPresident Trump misspelled first lady Melania Trump's name in a tweet welcoming her back to the White House on Saturday. \"Great to have our incredible First Lady back home in the White House. Melanie is feeling and doing really well,\" Trump tweeted. Trump quickly deleted the tweet and sent another one with the correct spelling of the first lady's name. \"Great to have our incredible First Lady back home in the White House. Melanie is feeling and doing really well,\" Trump tweeted.\n\nMelanie Griffith gushed over her daughter Dakota Johnson 's boyfriend, Chris Martin , on Thursday, May 10 — details. Us broke the news in December 2017 that Johnson , 28, and the Coldplay frontman, 41, are dating . “They’ve gotten to know each other really well and are very comfortable Melanie Griffith approves of daughter Dakota Johnson ’s relationship with Coldplay singer Chris Martin . When the “Working Girl” star attended the Global Gift Foundation USA Women’s Empowerment Luncheon on Thursday, she told media reporters what she really thinks of Martin .\n\nMore recently, the two attended Ellen DeGeneres’ 60th birthday party together in February. The pair were photographed holding hands as they caught up with Drew Barrymore outside of the bash.\n\nWhile love seems to be in the air for Johnson, it’s also strong with Griffith despite her separation from Antonio Banderas in December 2015.\n\nBanderas told People Now in April even though they were divorced, Griffith “is my family and I will love her until the day I die.”\n\nGriffith tells PEOPLE the feeling is mutual, saying, “I will always love him and he will always love me. We had a great 20 years together.”\n\nAs for how she’ll spend her Mother’s Day this weekend, the mother of three says, “With all the kids and my mom!” Her mother Tippi Hedren, who starred in the Alfred Hitchcock classics The Birds and Marnie, is 88.\n\nRelated video: Antonio Banderas' Heartfelt Words on Ex-Wife Melanie Griffith: 'I'll Love Her Until the Day I Die':", "images": ["http://us.pressfrom.com/upload/images/real/2018/05/15/son-of-cop-killed-on-duty-gets-police-escort-to-school__437839_.jpg", "http://us.pressfrom.com/upload/images/real/2018/05/19/trump-misspells-melanias-name-in-initial-tweet-welcoming-her-back-to-white-house__734176_.jpg", "http://us.pressfrom.com/upload/images/real/2018/05/11/melanie-griffith-standing-posing-for-the-camera__858672_.jpg?content=1", "https://mc.yandex.ru/watch/50253969", "https://static.pressfrom.info/upload/images/small/2019/11/25/shania-twain-closes-out-the-2019-amas-with-legendary-medley-of-her-biggest-hits__431893_.jpg", "https://static.pressfrom.info/upload/images/small/2019/11/25/kaia-gerber-brings-pete-davidson-as-her-wedding-date__466410_.jpg", "http://pressfrom.info/upload/images/real/2018/05/11/what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin__606640_.jpg", "https://static.pressfrom.info/upload/images/small/2019/11/24/justin-timberlakes-outing-with-co-star-alisha-wainwright-was-innocent-despite-hand-holding-source-sa_598118_.jpg", "http://us.pressfrom.com/img/logo-pressfrom-1.png", "http://us.pressfrom.com/img/no_img/flip/no_img_340x220-3.jpg", "https://static.pressfrom.info/upload/images/small/2019/11/26/duck-dynasty-star-sadie-robertson-marries-christian-huff__528138_.jpg", "https://static.pressfrom.info/upload/images/real/2019/11/30/league-city-man-accused-of-killing-wife-on-thanksgiving__135408_.jpg", "http://us.pressfrom.com/img/no_img/content/no_img_content_flip.jpg", "https://static.pressfrom.info/upload/images/small/2019/11/25/selena-gomez-is-being-dragged-for-singing-off-key-at-the-amas-and-its-a-huge-bummer__672956_.jpg", "https://static.pressfrom.info/upload/images/small/2019/11/25/justin-bieber-dyes-his-hair-bright-pink__839311_.jpg", "https://static.pressfrom.info/upload/images/small/2019/11/27/newlyweds-sadie-robertson-and-christian-huff-share-first-wedding-photos-forever-me-and-you__979280_.jpg", "http://us.pressfrom.com/img/default_news.jpg", "http://us.pressfrom.com/upload/images/real/2018/04/23/utah-parents-kill-their-2-children-before-themselves-after-believing-mom-had-terminal-disease__262861_.jpg", "https://static.pressfrom.info/upload/images/real/2019/11/24/justin-timberlakes-outing-with-co-star-alisha-wainwright-was-innocent-despite-hand-holding-source-sa_598118_.jpg", "https://static.pressfrom.info/upload/images/small/2019/11/29/ellie-goulding-s-hat-gets-mocked-during-dallas-cowboys-halftime-performance-it-s-a-lamp-shade__480152_.jpg"], "top_img": "http://pressfrom.info/upload/images/real/2018/05/11/what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin__606640_.jpg", "keywords": [], "authors": [], "canonical_link": "http://pressfrom.info/news/entertainment/-144004-what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin.html", "title": "Entertainment What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"title": "What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin", "type": "article", "url": "http://pressfrom.info/news/entertainment/-144004-what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin.html", "site_name": "PressFrom - US", "description": "Utah parents kill their 2 children before themselves after believing mom had terminal disease \n \n \t\n\nA couple who recently moved from Switzerland to Utah planned a murder-suicide that left their...", "image": "http://pressfrom.info/upload/images/real/2018/05/11/what-melanie-griffith-really-thinks-about-daughter-dakota-johnson-dating-chris-martin__606640_.jpg"}, "description": "What Melanie Griffith Really Thinks About Daughter Dakota Johnson Dating Chris Martin : Utah parents kill their 2 children before themselves after believing mom had terminal disease..."}, "movies": [], "publish_date": null, "source": "http://us.pressfrom.com", "summary": ""}