{"url": "https://www.techradar.com/black-friday/black-friday-cyber-monday-2018-deals-in-usa", "text": "Black Friday itself might be done and dusted but the best deals for 2019 will continue all weekend, plus Cyber Monday deals are just around the corner. That's good news for anyone late to the sales party as that means there's still a significant amount of savings to be had.\n\nYou'll find those savings everywhere and anywhere, both at big box retailers like Best Buy, Walmart and Target as well as online at Amazon, NewEgg and B&H Photo. There's also a number of smaller stores like Kohl's getting in on the sales and that's only good news for consumers.\n\nSo when does Black Friday well and truly end? Admittedly, some deals were for Black Friday only and sold out within minutes or hours, but many deals started a few days before Black Friday and will continue through to Cyber Monday after Thanksgiving.\n\nThere are many different kinds of deals coming up from laptops to phones to AirPods (although the latter is heading quickly out of stock). We've sadly had little in the way of a cracking Nintendo Switch Black Friday deal, and even the PS4 deals - while they have existed, and haven't been too bad - were more scarce than we expected.\n\nBut, based on what we saw on Friday, there's a lot more to come.\n\n💡TechRadar's Big Black Friday Tip: Buy it now!💡 If you're thinking about a deal at the moment, or you're scared it will go cheaper on Cyber Monday, then our advice is simple: if it has a good discount attached to it, go for it! If you later find the product is cheaper elsewhere, you can always buy it again and return the original. Just make sure to check the retailer's terms and conditions for returning items.\n\nIt's basically been Apple products that have been the winners - with $400 cashback on an iPhone 11, lower prices on AirPods and Apple Watches and MacBook / iPads being cheaper than ever before, it's been (and still is) the time to grab yourself a bargain.\n\nThere's more in there too - Dyson has been popular for Black Friday 2019, DNA kits have been a surprise package and we've even seen great discount on power tools as well.\n\nAnyway, enough of telling you what you're getting, and onto the deals themselves - and if you want something more than what we've scavenged from the depths of the web, here are all the top Black Friday sales from around the web first:\n\nAmazon.com: - Black Friday deals now live!\n\n- Black Friday deals now live! Walmart.com : - Black Friday deals in every category\n\n- Black Friday deals in every category BestBuy.com: - Black Friday doorbusters live\n\n- Black Friday doorbusters live Target.com: - Doorbuster deals now live\n\n- Doorbuster deals now live Adidas.com: - up to 75% off everything!\n\n- up to 75% off everything! UnderArmour.com: 30% off sitewide for Black Friday\n\n30% off sitewide for Black Friday Belk.com: Daily doorbusters - 75% off\n\nDaily doorbusters - 75% off Dell: - deals launch at 10am Friday\n\n- deals launch at 10am Friday Disney Plus: Get a free 7-day free trial here\n\nGet a free 7-day free trial here Ebay.com: A strong focus on TVs and consoles\n\nA strong focus on TVs and consoles HomeDepot.com: Daily deal Black Friday savings\n\nDaily deal Black Friday savings JCPenney.com: Pre-Black Friday deals\n\nPre-Black Friday deals Kohls.com: Coupons aplenty in big sale\n\nCoupons aplenty in big sale NorthFace.com: 25% off some crazily-warm styles\n\n25% off some crazily-warm styles Lowes.com: Deals on tools and smart home\n\nDeals on tools and smart home Macy's.com: Preview specials with 60% off womenswear\n\nPreview specials with 60% off womenswear Mixbook: See the new Black Fri-yay deals\n\nSee the new Black Fri-yay deals NewEgg.com: Black Friday deals\n\nBlack Friday deals Nike.com: Big savings on apparel\n\nBig savings on apparel Sears.com: Hefty savings on TVs\n\nHefty savings on TVs Stage.com: Up to 60% off a range of apparel\n\nOur top new Black Friday deals\n\nHP Laptop 15t: $979.99 $519.99 from HP\n\nThis HP laptop is a phenomenal price and comes with a 15-inch display paired with a powerful 10th gen Intel Core i7 processor to power the whole thing. There's also 256GB of SSD storage onboard with Windows 10 built-in.View Deal\n\nPowerbeats Pro wireless earphones | $249.95 $199.95 at Amazon\n\nPowerbeats Pro are available for $50 off this weekend at Amazon, and offer up to nine hours of the high quality audio you'd expect from Beats. Perfect for fitness fanatics, the Powerbeats Pro offer an adjustable ear hook design that keeps your buds firmly in place. You're also getting the Apple H1 chip, so using your earbuds with your Apple devices is smooth and simple.\n\nView Deal\n\nApple 10.2-inch iPad, 32GB: $329.99 $229.99 at Target\n\nThis is the absolute lowest price we've ever seen on a 2019 iPad, with the 32GB model coming in just under $230 this Black Friday weekend. You can pick it up in Gold or Space Grey and enjoy all the latest features for less.\n\nExpires November 30 at 11:59 PSTView Deal\n\niPhone 11 for $699 at Verizon | Get up to $400 off the iPhone 11 with select trade-in and Unlimited\n\nYou can get up to $400 off the iPhone 11 if you trade in a select phone, and if you switch to an Unlimited plan with your handset you can also get a $400 prepaid Mastercard too. There are lots of caveats with this deal, so be sure to read through all the terms and conditions.View Deal\n\nHulu for $1.99/month: $5.99 now just $1.99/month at Hulu\n\nYou could pay $6 a month for Hulu's memorable TV shows and movies, or you could pay just $2 a month for the best deal in streaming. We did. Never say \"Oh, I wish I had a Hulu subscription\" at any point in 2020. View Deal\n\nGoogle Pixel 3a: $399 $249.99 at Best Buy\n\nThe Google Pixel 3a is only a matter of months old, so it's wild that this Best Buy Doorbuster deal is smashing $150 off its asking price. Now you can get one of the best budget phones of 2019 for an even more affordable price. This deal is fantastic though, so it might sell out quickly.\n\nView Deal\n\nXbox One X | Star Wars Jedi: Fallen Order: $499 $349 at Best Buy\n\nThe Xbox One X is the most powerful console on the market right now, and with this early Black Friday deal, it's finally affordable. You'll be able to play all your favorite games in 4K, and this one even comes with Star Wars Jedi: Fallen Order. View Deal\n\n(NEW LOW PRICE) HP 14 Laptop: $599 $369 at Walmart\n\nSave $200 on the HP 14 laptop at Walmart. The powerful 14-inch laptop packs an Intel 10th Gen Core i5-1035G1 processor, 8GB of RAM, and 256GB of storage.\n\nView Deal\n\nAmazon Echo Dot 3rd Gen: $49 $22 at Amazon\n\nThe Echo Dot is already an extremely affordable smart device, but this Black Friday deal cuts it even further, making it just $22. If you're looking for an easy solution to your smart speaker needs, this is a great option.View Deal\n\nApple HomePod | Space Gray $299.99 $199.99 at Best Buy\n\nThe smart speaker for Apple fans, the HomePod is a small but powerful speaker designed to hook into Apple Music and all the other Apple HomeKit enabled devices in your phone, enabling a broad spectrum of voice commands via Siri.View Deal\n\nMacBook Air 2019: $1099 $899 at B&H\n\nYou can save $200 on a new MacBook Air. This is the 2019 model, and features a 13.3-inch display as well as 128GB of internal storage. It runs on a Intel Core i5 with 8GB of RAM.\n\nView Deal\n\nFujifilm Instax Mini 9: $69 $49.95 at Amazon\n\nGet a huge 50% off on the Ice Blue and Flamingo Pink versions of the Instax Mini 9, thanks to this combination of a 28% discount and a $14.96 coupon. This is the bundle without a mini film pack, but represents incredible value for instant photography beginners.View Deal\n\nSanDisk Ultra 2TB SATA SSD: $319.99 $179.99 at Amazon\n\nThe SanDisk Ultra 2TB Internal SATA Solid State Drive is a great SSD if you need that extra bit of space for your files and applications. It boasts 560MB/s sequential read and 530MB/sec write speeds, as well as an advanced 3D NAND structure for added reliability.\n\nView Deal\n\nCanon EOS M50 mirrorless camera: $899 $579 at B&H Photo\n\nThis is Canon's most versatile mirrorless camera. It's lightweight, has a fully articulating touchscreen, an electronic viewfinder, and captures 4K video and 24.1MP photos. And now it's just $579.99.View Deal\n\nPlayStation VR + 2 games + 2 Move controllers: $349.99 $249.99 at Best Buy\n\nPSVR is the next upgrade you should be thinking about if you already own a PS4. This version is $100 off and comes with games Blood & Truth and Everybody's Golf VR and two Move controllers.View Deal\n\nGoogle Nest Learning Thermostat: $249 $179 at Walmart\n\nHello Google, hello savings on the smartest thermostat around. It'll actually cost you less than the MSRP and save you on energy fees on the back end.View Deal\n\nGoogle Nest Hello video doorbell: $229 $149 at Walmart\n\nThere are two main video doorbells – this Nest Hello version and the multiple Amazon-owned Ring doorbells. Both are smart, but if you have any Google Home speakers, this is an easy sell.View Deal\n\nInstant Pot DUO60 6 Qt Pressure Cooker: $99.95 $49 at Walmart\n\nWalmart Black Friday shoppers can save 50% on the best-selling Instant Pot DUO60. That's the lowest price we've seen for the pressure cook would make a perfect gift for anyone on your list.\n\nView Deal\n\nSony WH-1000XM3 Noise Canceling Headphones: $349.99 $279.99 at Best Buy\n\nThese headphones from Sony are the best in the world (according to us), with excellent comfort, high-quality sound, and superb noise cancelling making them an easy buy.\n\nView Deal\n\nHP Pavilion Horizon Blue R5 Laptop: $599 $399 at Walmart\n\nThe powerful HP Pavilion gets a temporary $200 price cut at Walmart. The 15.6-inch laptop features an AMD Ryzen 5 processor, advanced graphics and includes 8GB of RAM and 1TB of storage.\n\n\n\nBose QC35 II: $349.99 $279.99 at Best Buy\n\nBose is no stranger to great comfort and impressive sound quality, and the Bose QC35 II doesn't fall far from the tree. These wireless set of cans also boasts two levels of active noise cancellation, a 2-microphone system and 20 hours of battery life.\n\nView Deal\n\nDyson V7 Motorhead Cord-Free Vacuum: $279 $179 at Walmart\n\nThe powerful Dyson V7 gets a $100 price cut at Walmart. The cord-free vacuum features a V7 motorhead to deep clean carpets and hard floors and includes a convenient hand-held vac.\n\nView Deal\n\nTop 4K TV deal – TCL 6-Series 55-inch: $649 $599 at Amazon\n\nThis is the TCL 6-Series 55-inch 4KTV and it's one of our favorite TVs on a normal day. It being Black Friday, it's even sweeter thanks to an extra $50 price cut through Amazon.\n\nHP Spectre x360 15: $1,599 $1,099 at Best Buy\n\nThis laptop is powered by the latest and greatest Ultrabook hardware like a 10th-generation Intel i7 processor and comes with a gorgeous 4K display. And, ahead of Black Friday you can save a whopping $500 at Best Buy.\n\n(LIMITED STOCK) Apple AirPods Pro: $249.99 $234.99 at Amazon\n\nYou asked for it and we delivered: a real-life deal on AirPods Pro with delivery just before Thanksgiving. Yes, that's how limited this Black Friday AirPods deal is today – it sold out twice on us so far, and now it's saying the AirPods won't be delivered for up to two months - but if you can wait, that's still a great price.View Deal\n\niPhone 11 64GB $699 $125 at Best Buy (after trade-in)\n\nPick up the new iPhone 11 for far less with this Best Buy deal: start with $150 off and trade in your older iPhone to snag up to an additional $425 off for a grand total of $575 in potential savings. You'll have to sign up with Sprint or AT&T for this deal.View Deal\n\nJLab Audio - JBuds: $49 $29 at Best Buy\n\nTrue wireless earbuds can get expensive quickly, just take a look at the AirPods. However, this pair of JBuds from JLab Audio brings that freedom from wires into a package that's a fraction of the cost. And, ahead of Black Friday you can get them for just $29.View Deal\n\nMicrosoft Surface Pro 6 Laptop: $1,199 $849 at Best Buy\n\nYou can save a whopping $350 on the Microsoft Surface Pro 6 laptop at Best Buy with today's Daily Deal. The lightweight laptop features an 11.6-inch touchscreen display and packs 8GB of RAM and 256GB of storage.\n\nView Deal\n\nCanon Rebel T7i: $1199.99 $699.99 at Best Buy\n\nAn incredible, time-limited offer on the Canon Rebel T7i with two lenses (the 18-55mm and 55-200mm), plus a camera bag and 32GB SD memory card. The Rebel T7i (known as the 800D outside the US) is one of our favorite beginner-friendly DSLRs and is great camera to learn your craft on.View Deal\n\nMyHeritage DNA Test Kit: $75 $49 at Amazon\n\nAmazon has the top-rated MyHeritage DNA test kit on sale for $49. You can discover your ancestry and a detailed ethnicity breakdown from 42 regions.\n\nView Deal\n\nAirPods deals\n\n(SOMETIMES OUT OF STOCK) Apple AirPods with Charging Case: $159 $129.99 at Walmart\n\nThese keep going in and out of stock. As of the last update to this page, there were only seven left in stock, according to Walmart. That means they're going fast for the second-gen AirPods.View Deal\n\nApple AirPods (2019) with wireless charging case: $199 $164 at Best Buy\n\nThese are the newest non-Pro AirPods, the updated version with a wirelessly charging case, and today's Black Friday discount offers a savings of $35. That's a rare Apple deal - and we don't see it getting cheaper.View Deal\n\n(LIMITED STOCK) Apple AirPods Pro: $249.99 $234.99 at Amazon\n\nThe brand new AirPods Pro have been incredibly popular already and we're not surprised given how quickly America made the standard AirPods the most popular earphones in the country. These popular, new noise-cancelling headphones' have been going in and out of stock, so just keep an eye.\n\nView Deal\n\nHeadphones deals\n\nBose QC35 II: $349.99 $279.99 at Best Buy\n\nBose is no stranger to great comfort and impressive sound quality, and the Bose QC35 II doesn't fall far from the tree. These wireless set of cans also boasts two levels of active noise cancellation, a 2-microphone system and 20 hours of battery life.\n\nView Deal\n\nBose SoundLink Around-Ear Wireless Headphones II: $279 $179 on Amazon\n\nFeaturing Bose's incredible sound quality, the Bose SoundLink Around-Ear Wireless Headphones II boasts multi-pairing ability, a dual microphone system and a flexible headband. These wireless headphones have up to 15 hours play time with rechargeable lithium ion battery.\n\nView Deal\n\nBose SoundLink II: $229.99 $179.99 at BestBuy\n\nNot only does the Bose SoundLink II deliver Bose's signature high-quality sound and comfort, but also a price tag that's affordable than many Bose headphones out there. This is the perfect Bose headphones for you if you're looking to save some money, with a battery life of up to 15 hours and 2-device pairing capability to boot.\n\nView Deal\n\nPowerbeats3 wireless headphones: $199.95 $89 at Walmart\n\nYou can save $110.95 on these Powerbeats 3 wireless headphones in this amazing Beats Black Friday deal. These earbuds have just gone below $100 at Walmart, so if you're looking for comfortable wireless earbuds with excellent fit, punchy bass, and all the benefits of Apple's W1 chip, you better snap up this deal quick.\n\nView Deal\n\nBeats Solo3 wireless headphones: $299.95 $129 at Walmart\n\nYou can get the Beats Solo3 wireless headphones on sale for $129 at Walmart. A fantastic price for a set of high-quality headphones with incredible battery, wireless range, and Apple device pairing.\n\nView Deal\n\nHyperX Cloud II Gaming Headset: $99 $59 at Walmart\n\nWalmart's Black Friday sale has the HyperX Cloud II Gaming headset on sale for just $59. Perfect for serious gamers, the headset includes a premium USB sound card, a digitally enhanced microphone and 7.1 virtual surround sound.\n\nView Deal\n\nSamsung Galaxy Buds: $129.99 $119 at Walmart\n\nGet the newly released Samsung Galaxy Buds on sale for $119. The earbuds feature Ambient Aware technology which lets you control how much surrounding noise you want to hear.\n\nView Deal\n\nJabra Elite 75t: $199.99 $179.99 at Best Buy\n\nThese brand new true wireless earbuds are already discounted by $20 in the Black Friday sales. With improved battery life and a sports-friendly design, they could give the Apple AirPods a run for their money. You can also get this deal at Amazon if you prefer - but the older 65t versions look like they're getting a big discount on Black Friday itself, down to around $100.View Deal\n\nJabra Elite 65t: $169.99 $99.99 at Best Buy\n\nWith $70 off, you can get these brilliant true wireless earbuds for under $100. Their balanced sound and sophisticated design makes them a good choice for anyone who doesn't want to follow the Apple AirPods crowd.View Deal\n\nBeats Solo 3 Wireless On-Ear Headphones: $299.95 $149.99 at Best Buy\n\nFor a limited time, you can save $150 on the Beats Solo 3 headphones at Best Buy. The wireless headphones provide up to 40 hours of battery life and include three free months of Apple Music for new subscribers.\n\nView Deal\n\nBeats Studio 3 Wireless Over-Ear Headphones: $349.95 $199.99 at Best Buy\n\nBest Buy has the best-selling Beats Studio3 headphones on sale for $209.99. That's a $140 discount for the wireless headphones which include pure adaptive noise-canceling technology and are available in blue, grey and desert sand.\n\nView Deal\n\nBeats by Dr. Dre Powerbeats 3: $ 199.99 $89.99 at Best Buy\n\nOur favorite gym-friendly wireless earbuds have a $100 discount. Yes there's a cable between the two buds, but they connect to your phone wirelessly and get 12 hours on a single charge.\n\nView Deal\n\nNintendo Switch deals\n\nNintendo Switch + 128GB memory card + accessories pack: $392.97 $334 at Best Buy\n\nThe first item we'd advise buying with a Switch is a memory card, and this bundle has a 128GB microSD card. The accessories pack has a carry case, screen cleaner, USB power cable, and Joy-Con cases. Also available with the gray controller bundle.\n\nView Deal\n\n(OUT OF STOCK) Nintendo Switch Lite + 128GB memory card: $225.48 at Amazon\n\nFor just $25 extra on top of the base price of the console a 128GB MicroSD card is an excellent purchase and unlike some cheaper memory cards, this one has the recommended write speed to loads games at the proper speed. Not a fan of the yellow Switch Lite? You can get this bundle in gray or turquoise too.\n\nView Deal\n\n(OUT OF STOCK) Nintendo Switch + Spyro Trilogy: $334 $289 at Walmart\n\nThis is the best Nintendo Switch bundle we've seen in the Us in a long time as free games are a rarity with the super popular console. And you're getting the improved version of the console too with a better battery. You can get this excellent deal on both the gray or red/blue versions of the Switch.View Deal\n\nPS4 deals\n\nPS4 Slim 1TB Console: $299.99 $268 at Walmart\n\nWalmart has a slight discount on the popular PS4 Slim 1TB console. The console includes a matching DualShock 4 Wireless Controller and comes with 1TB of storage, which is a must-buy compared to the standard 500GB version.\n\nView Deal\n\nPS4 DualShock 4 Controller: $59.99 now $38.99 at Walmart\n\nIt's always handy to have a spare controller - whether it's as a battery back-up so you don't have to stop playing when the juice runs out, or for when you friends pop over - and saving yourself $21 is always good.\n\nView Deal\n\nPlayStation Plus 12-month subscription: $59.99 $39.89 at CDKeys\n\n12 months of PS Plus for under $45 is a rare sight to behold, but that's exactly the Black Friday deal today. It provides access to online play, as well as free monthly games to add to your Instant Game Collection on PS4.\n\nView Deal\n\nSmartwatch deals\n\nApple Watch Series 3 GPS, 38mm: $279 $189 at Best Buy\n\nBest Buy has the best-selling Apple Watch 3 down to $189 during its Black Friday sale. The 38mm smartwatch includes GPS technology and offers continuous heart rate monitoring.\n\nView Deal\n\nApple Watch 3 GPS + Cellular, 38mm $379 $229 at Walmart\n\nYou can save over $150 on the Apple Watch 3 with cellular connectivity at Walmart. The smartwatch comes in a silver aluminum case and a white sport band and includes LTE connectivity which allows you to stay connected even when your iPhone isn't nearby.View Deal\n\nApple Watch Series 4 GPS + Cellular 44mm, Sport Loop: $529 $429 at Walmart\n\nWalmart has slashed $100 off the Apple Watch Series 4 with GPS and Cellular. The 44mm smartwatch includes LTE connectivity, which allows you to get internet and phone connectivity on your watch even when your iPhone is far away.\n\nView Deal\n\nApple Watch 4 GPS, 40mm: $349 $299 at Best Buy\n\nYou can save $50 on the Apple Watch 4 at Best Buy. The series 4 smartwatch features GPS technology and continuous heart rate monitoring is available in a white, black, or pink sport band.\n\nView Deal\n\nApple Watch 4 GPS + Cellular, 44mm: $529 $429 at Best Buy\n\nThe bigger, cellular Apple Watch 4 is on sale for Black Friday, and it's $100 off the MSRP that Apple sold it for a year ago. That's a nice discount for this watch that's very similar to the Apple Watch 5 except for the always-on display. View Deal\n\nApple Watch 5 GPS, 40mm: $399 $379 at Walmart\n\nYou can get the all-new Apple Watch 5 on sale at Walmart for $384. The smartwatch is available in a black, white or pink sport band and includes GPS technology and an ECG app that continuously monitors your heart rate.\n\nView Deal\n\nFitbit Ionic smartwatch: $249.95 $199.91 at Amazon\n\nGet the Fitbit Ionic smartwatch on sale for $199.91 at Amazon. The Ionic watch features GPS technology so you can track pace, distance, and routes and includes a built-in NFC chip for contactless payments.\n\nView Deal\n\nGarmin watches and GPS trackers: Save up to 25% at Amazon\n\nWhether you're after a top running watch, like the Garmin Forerunner 945, or a satellite comms unit like the Garmin GPSMAP 661 GPS, Amazon's sale is knocking up to 25% off a wide range of Garmin product.\n\nView Deal\n\nFitbit Inspire HR fitness tracker: $99 $69 at Walmart\n\nSave $30 on the Fitbit Inspire HR fitness tracker at Walmart. The ultra-slim activity tracker is made for everyday wear and offers 24/7 heart rate monitoring and provides up to five days of battery life.\n\nView Deal\n\nFitbit Versa Lite Edition smartwatch: $159.95 $99 at Walmart\n\nYou can get the top-rated Fitbit Versa Lite Edition smartwatch on sale for just $99. This is the biggest discount we've seen for the fitness-packed smartwatch that's available in five different color choices.\n\nView Deal\n\nFitbit Versa smartwatch: $199 $142 at Walmart\n\nGet the Fitbit Versa smartwatch on sale at Walmart for $142. The swim-proof Versa tracks 15+ workouts, calories burned, and sleep and can store up to 300+ songs.\n\nView Deal\n\nFitbit Versa 2 smartwatch: $199.95 $148.99 at Walmart\n\nYou can get the all-new Fitbit Versa 2 on sale at Walmart for $148.99. That's a $50 price cut for the smartwatch that includes 24/7 heart rate monitoring and features Fitbit pay, which allows you to make payments on your wrist.\n\nView Deal\n\nFitbit Ionic Smartwatch: $299 $199.95 at Walmart\n\nYou can get the Fitbit Ionic smartwatch on sale at Walmart for $199.95. That's the best price we've found for the water-resistant Fitbit which features GPS technology and includes a built-in NFC chip which allows you to make secure payments on your wrist.\n\nView Deal\n\niPad and tablet deals\n\nApple 10.2-inch iPad, 32GB: $329.99 $229.99 at Amazon\n\nThis is the absolute lowest price we've ever seen on a 2019 iPad, with the 32GB model coming in just under $230 this Black Friday weekend. You can pick it up in Gold or Space Grey and enjoy all the latest features for less.View Deal\n\nSamsung Galaxy Tab A Tablet: $227.99 $149 at Walmart\n\nA fantastic budget tablet option, you can get the Samsung Galaxy Tab A on sale for $149. Perfect for watching movies and shows, the 10.1-inch tablet features 32GB of storage and provides 13 hours of battery life.\n\nView Deal\n\nApple iPad (6th Gen) 128GB Wi-Fi: $429 $349 at Walmart\n\nYou can save $80 on the 6th generation Apple iPad at Walmart. The 9.7-inch silver tablet packs 128GB of storage and provides up to 10 hours of battery life.\n\nView Deal\n\nApple iPad (6th gen) 128GB Wi-Fi + Cellular: $559.99 $429 at Walmart\n\nIf you're interested in a cellular plan with your tablet, you can get the 2019 iPad with Wi-Fi on sale for $429. That's a $160 discount for the tablet that includes 128GB of storage.\n\nView Deal\n\nApple iPad 10.2-inch 128GB, $429 $329 on Amazon\n\nPick up the new Apple iPad 10.2-inch 128GB model for 23% off with this pre-Black Friday deal. This model comes with the triple-pin connectors previously exclusive to iPad Air and iPad Pro models that allows the iPad to connect to keyboard accessories.View Deal\n\nApple 10.5-inch iPad Pro: $999 $699 at Walmart\n\nThe Apple iPad Pro gets a massive $300 price cut at Walmart's early access sale. That's the lowest price we've seen for the 10.5-inch tablet which packs 512GB of storage.\n\nView Deal\n\n(OUT OF STOCK) iPad Pro 10.5 (2017) WiFi 512GB: $999 $699 at Walmart\n\nYou'll especially like this if you want to fill your tablet up with apps and media - spend just $70 more and you can upgrade your storage to a massive 512GB. At this size you can take full advantage of the more powerful features of the iPad Pro, so don't take the decision lightly.\n\nView Deal\n\niPad Pro 11-inch WiFi 256GB: $949 $799 at Amazon\n\nIf you don't think 64GB is going to cut it, you can also grab an 11-inch iPad Pro with 256GB of storage for $879 at Amazon at the moment. Linked here is the Silver model, but the Space Gray version comes in at $799 if you prefer that. WiFi and Cellular version available for $949.99.View Deal\n\niPad Pro 12.9-inch WiFi 256GB: $1,149 $949 at Best Buy\n\nBest Buy members discount: You can grab the 12.9-inch iPad Pro with 256GB of storage for under $1,000 at Best Buy this week, thanks to the Best Buy Members discounts. If you aren't already a member, signing up is free and easy - and well worth it to save $200 on the latest iPad Pro. WiFi and Cellular version available for $1,099.99.\n\nView Deal\n\niPad Pro 12.9-inch WiFi 512GB: $1,349.99 $1,149.99 at Best Buy\n\nBest Buy Members can save $200 on this 512GB, 12.9-inch iPad Pro. This iPad Pro will keep all your favorite high-performance apps and downloads while running everything smoothly. If you're not already a member, signing up is free and easy and will save you a load of cash over the Black Friday weekend. WiFi and Cellular version available for $1,299.99.\n\nView Deal\n\nAmazon Fire 7 Tablet: $49 $29.99 at Amazon\n\nThe Amazon Fire 7 Tablet isn't quite as powerful or beautiful as the 8-inch Fire 8, but its low price makes it an easy choice for anyone that just wants an affordable tablet to read on. Plus, now that you can get it for just $29.99 it's an easy sell. View Deal\n\nAmazon Fire HD 10: $149.99 $99.99 at Amazon\n\nThe Amazon Fire HD 10 is billed as Amazon's premier media consumption device, with its 10-inch Full-HD display, 32GB of storage and up to 12 hours of battery life. The best part? You can save $50 on Black Friday.View Deal\n\nSamsung Galaxy Tab A 10.1: $219 $149 at Walmart\n\nSamsung's Galaxy Tab A 10.1 is an affordable Android tablet made more affordable with this deal. It runs on Android 9 Pie with an octa-core processor, 2GB of RAM, and 32GB of internal storage. The battery offers up to 13 hours of video playtime on its 1920 x 1200 resolution display.\n\nView Deal\n\nAmazon Fire HD 8 Kids Edition: $129 $79 at Amazon\n\nThe Fire HD 8 Kids Edition is Amazon's awesome tablet that kids can get into. Not only does it feature robust parental controls, but it features a padded case that will stop it from getting destroyed when dropped. And, this $50 Black Friday makes it a great deal.View Deal\n\nAmazon Fire 7 Kids Edition: $99 $40 at Amazon\n\nIf you have kids that need a nigh-unbreakable tablet that won't break the bank, the Fire 7 Kids Edition should be at the top of the list. And, with this $59 off Black Friday deal, you won't even be bothered if your kids find a way to break it. View Deal\n\nTV deals\n\nTCL 32S327 32-Inch 1080p Roku Smart LED TV: $189.99 $149.99 at Amazon\n\nTelevisions with 1080p a rarity for Black Friday, at least when it comes to balancing a good price with a quality picture and ease-of-use. This TCL TV with Roku built-in is one such gem of a deal.View Deal\n\nTCL 55S425 55 inch 4K LED Roku TV: $599.99 $319.99 at Amazon\n\nTCL makes affordable televisions and this 4K set stands out as being among the cheapest for the 55-inch size, especially when you factor in that Roku is built right into the menu system.View Deal\n\nTCL 65-inch 6-Series 4K QLED with Dolby Vision HDR Roku TV: $1099.99 $799.99 at Amazon\n\nTruely, the 6-Series is the TCL 4K television you really want, and at $800, that's a fantastic deal for any 65-inch set. This one happens to be a QLED and use Roku as its easy menu system.View Deal\n\nTCL 75-inch 6-Series 4K TV (75R617): $2,299 $1,399 at Amazon\n\nIt's a big country, so why not get an impressively big TV? That's what you'll get with the 75-inch 4K HDR TV deal, and it has Roku built-in and Dolby Vision HDR. You'll be hard-pressed to find a better value. View Deal\n\nSamsung 43-inch 6 Series Smart 4K UHD TV: $279.99 $229.99 at Best Buy\n\nBest Buy has the Samsung 43-inch 4K TV on sale for $229.99. That's the lowest price we've seen for the UHD TV that delivers bold, bright colors thanks to the PurColor technology and offers smart capabilities.\n\nView Deal\n\nSamsung Flat 43-Inch QLED 4K Q60 Series Ultra HD Smart TV: $799.99 $497.99 at Amazon\n\nGet the 2019 Samsung 43-inch 4K TV on sale for $497.99. The QLED TV delivers bright and bold colors thanks to the Quantum dot technology and works with Amazon Alexa and the Google Assistant for voice control.\n\n\n\nSamsung 65-inch 4K HDR Smart TV: $799 $477 at Walmart\n\nLast year's UN65NU6900 gets a 40% price cut, with over $300 in savings on the mid-range LED TV from Samsung. For that money you get 4K resolution, basic HDR, and two HDMI ports for connecting soundbars or game consoles.\n\nView Deal\n\nSamsung 50-inch 4K UHD Smart TV $549.99 $278 at Walmart\n\nGet the feature-rich Samsung 50-inch 4K smart TV on sale for during Black Friday for $278 at Walmart. That's a $270 discount and the lowest price we've found for Ultra HD smart TV.\n\n\n\nView Deal\n\nLG 55-inch Nano 9 Series Smart 4K UHD TV: $1,199.99 $899.99 at Best Buy\n\nThe feature-packed LG 55-inch 4K TV has dropped a further $50 to $899.99. The Nano 9 Series TV features bold, bright colors and includes ThinQ AI technology which allows your TV to become a smart home hub. View Deal\n\nToshiba Fire TV in 3 sizes: Up to 30% off at Amazon\n\nThere are three different sizes to the Toshiba 4K TV line the Amazon Fire TV interface built-in. All are cheap, yet offer HDR starting at $229 for the 43-inch and going up in price and size.View Deal\n\nHisense 58-inch 4K Android Smart TV: $428 $299 at Walmart\n\nWant to go even cheaper? It's not quite as good a TV, but this 58-inch Hisense TV is now only $299, with 4K resolution and built-in Google Assistant capability (instead of the much-maligned Bixby).View Deal\n\nPhilips 65-inch 4K Android Smart TV: $548 $488 at Walmart\n\nGet the Philips 65-inch 4K TV on sale for $488 at Walmart. The Android smart TV has the Google Assistant built-in which allows you to control your TV and other compatible devices using your voice.\n\nView Deal\n\nRCA 50-inch 4K Ultra HD Roku Smart TV: $699 $249.99 at Walmart\n\nAn excellent budget option, the RCA 50-inch 4K TV is on sale for just the slightly-higher-than-launch $249.99. The smart TV has the Roku experience built-in so you can stream from apps like Netflix, Hulu, Amazon Video, and more.\n\nView Deal\n\nSceptre 65-inch 4K Ultra HD TV: $ 899.99 $379 at Walmart\n\nYou can save a whopping $520 on the Sceptre 65-inch 4K TV. While the big-screen TV lacks smart capabilities it includes four HDMI ports which allow you to stream all your favorite multimedia.\n\nView Deal\n\nLG 75-inch 4K UHD LED Smart TV: $999.99 $729.99 at Best Buy\n\nGet the feature-rich LG 75-inch 4K TV on sale at for $749.99 - wait, no, it's now $729.99! Price drop! The big-screen TV features ThinQ AI technology and has the Google Assistant built-in so you can control your TV and other smart home devices using just your voice.\n\nView Deal\n\nAmazon devices deals\n\nAmazon Fire TV Stick with Alexa Voice Remote: $34.99 $19.99 at Amazon\n\nAt under $20, this is one of the cheapest ways to make a TV smart, with the ability to stream apps like Netflix, Hulu and, of course, Amazon Prime Video, and get Alexa to do the heavy lifting.View Deal\n\nAmazon Echo Dot 3rd Gen (Sandstone): $49 $22 at Amazon\n\nThe Echo Dot is already an extremely affordable smart device, but this Black Friday deal cuts it even further, making it just $22. If you're looking for an easy solution to your smart speaker needs, this is a great option.View Deal\n\nAmazon Echo Dot With Clock (3rd Gen): $59 $34.99 at Amazon\n\nDid you ever wish you had a speaker that talked back to you and had a clock? Well, if so, you're in luck: Amazon's 3rd-Gen Echo Dot has a digital clock built right in, and you can save $25 on Black Friday.View Deal\n\nKindle (2019) with $5 Credit: $89.99 $59.99 at Amazon\n\nAmazon is helping out all the bibliophiles out there reach their 2020 reading goals with this deal on the All-New Kindle that not only reduces the sticker price of the eReader by $30, but also comes with a $5 credit as well. It's a win-win.View Deal\n\nAmazon Fire TV Stick 4K + Echo Dot (3rd Gen): $99.99 $46.99 at Amazon\n\nIf you know you want both a new Amazon Fire TV Stick 4K and a new Amazon Echo Dot, consider picking up this bundle deal that lumps the two together and cuts the price by about $15. Why buy both? Because you can use the Echo Dot to control the Fire TV Stick when you can't find the remote, and the shared ecosystem makes keeping organized a cinch. View Deal\n\nAmazon Fire TV Stick 4K: $49.99 $24.99 at Amazon\n\nJust want a simple streaming stick? Amazon's 4K, voice-activated Fire TV Stick can also be bought at half-price at the moment, offering access to Netflix, Amazon Prime Video and more. View Deal\n\nAmazon Echo Show 5: $89 $49.99 at Amazon\n\nThe Amazon Echo Show is kind of like an Amazon Echo, except that it Shows you things. This smart display will let you watch videos and even show you things like a weather forecast. It's not a huge price drop, but you can save $40 if you buy one today.View Deal\n\nAmazon Fire TV Cube (2019) | $119 $89.99 at Amazon\n\nThe Fire TV Cube brings all your smarthome necessities together and adds 4K streaming straight to your humble television to boot. This is the latest release, so you're getting access to Dolby Vision and HDR+ for a massive range of apps including Disney+. View Deal\n\nAmazon Echo Show 8: $129.99 $79.99 at Amazon\n\nThe new Amazon Echo Show 8 is the Goldilocks of the Amazon Show lineup - it's smaller than the original 10-inch Amazon Echo Show, but way bigger than the Amazon Echo Show 5. Best of all, this brand-new device is available for $30 off its regular price.View Deal\n\nAmazon Echo Sub: $129 $109.99 at Amazon\n\nFor folks who want to add a little more oomph to their favorite music, the Amazon Echo Sub is a perfect addition to your AV setup. The Echo Sub is compatible with most new Echo speakers and features 100W deep bass sound through a 6\" woofer. View Deal\n\nAmazon Fire HD 10: $149.99 $99.99 at Amazon\n\nThe Amazon Fire HD 10 is billed as Amazon's premier media consumption device, with its 10-inch Full-HD display, 32GB of storage and up to 12 hours of battery life. The best part? You can save $50 on Black Friday.View Deal\n\nAmazon Fire HD 8: $79.99 $49.99 at Amazon\n\nThe Amazon Fire HD 8 is Amazon's budget-minded tablet for everyone, packed with a colorful 8-inch display, a quad-core processor and up to 10 hours of battery life. And, this $30 Black Friday discount makes it even better. View Deal\n\nAmazon Music Unlimited 4 months | $0.99 at Amazon\n\nWith a library of over 50 million songs and direct integration with all your Amazon Echo devices, Amazon Music Unlimited offers a streamlined and expansive music streaming experience. While the quality is on par with Spotify, the ease of use with Alexa and price difference for Prime members makes Amazon Music a great subscription for Echo smart speaker owners. And for four months, you can enjoy everything AMU has to offer at just 99 cents! Offer expires January 6.\n\nView Deal\n\nSmart speaker deals\n\nGoogle Home Mini: $49 $19 at Walmart\n\nThe best-selling Google Home Mini is on sale at Walmart for $19. That's the best price we've found for the compact smart speaker which works with the Google Assistant to check the news, answer questions, play music, and more using just your voice. This price is available for all colors too.\n\nView Deal\n\nGoogle Home Mini (Chalk) + Frozen 2 Book: $49 $19 at Walmart\n\nThe perfect Christmas gift idea for Frozen fans, you can get the Google Home Mini and the Frozen 2 Book on sale for $19. The Google Mini on its own normally retails for $49, so with this deal, you're saving $30 and getting access to sound effects and music when you read the book out loud.\n\nView Deal\n\nGoogle Home Mini 2-pack (chalk): $98 $38 at Walmart\n\nFill your home with music and the power of the Google Assistant with the Google Home Mini two-pack that's on sale at Walmart for $45. That's the lowest price we've found for the smart speaker bundle that allows you to play the same music in multiple rooms.\n\nView Deal\n\nBose Home Speaker 300: $259 $199 at Amazon\n\nSnag the Bose Home Speaker 300 on sale for $199. The smart speaker produces an impressive 360-degree sound and works with Amazon Alexa and the Google Assistant for voice control.\n\nView Deal\n\nGoogle Home Smart Speaker: $129 $49 at Walmart\n\nYou can save $50 on the Google Home smart speaker a Walmart. The powerful speaker delivers a rich, full sound and is powered by the Google Assistant and can play music from services YouTube Music, Spotify, Pandora, and more.\n\nView Deal\n\nGoogle Nest Hub: $149 $79 at Walmart\n\nYou can get the Google Nest Hub on sale for $99 and receive three months of free YouTube Music Premium to enjoy on the screen. The smart hub display can control smart home devices and works with the Google Assistant to display photos, make calls, show the news and more.\n\nView Deal\n\nGoogle Home Max: $399 $199 at Walmart\n\nWalmart has slashed $200 off the Google Home Max speaker at Walmart. The smart speaker produces a powerful sound with deep bass and crystal-clear highs and works with the Google Assistant for voice control.\n\nView Deal\n\nGoogle Smart TV Kit, Google Home Mini and Chromecast: $74 $45 at Walmart\n\nA Walmart exclusive, get the Google Home Mini and Chromecast on sale for $45. Together they can help you stream movies, browse shows and more completely hands-free.\n\nView Deal\n\nAppliances deals\n\nInstant Pot DUO60 6 Qt Pressure Cooker: $99.95 $49 at Walmart\n\nWalmart Black Friday shoppers can save 50% on the best-selling Instant Pot DUO60. That's the lowest price we've seen for the pressure cook would make a perfect gift for anyone on your list.\n\nView Deal\n\nRing Video Doorbell Pro: $249 $149 at Amazon\n\nIf you've ever wondered what happens on your front porch while you're doing literally anything else, the Ring Video Doorbell Pro will let you do it. And, on Black Friday, you can get this smart home security system for just $149.View Deal\n\niRobot Roomba 960 Wi-Fi: $649.99 $399.99 at Best Buy\n\nFor a limited time, the Roomba 960 vacuum gets a $250 price cut at Best Buy. The iRobot vacuum cleaner has a compatible app so you can clean and schedule from anywhere and works with Alexa and the Google Assistant for voice control.\n\nView Deal\n\nInstant Pot DUO60 6 Qt Pressure Cooker: $99.95 $49 at Walmart\n\nWalmart Black Friday shoppers can save on the best-selling Instant Pot DUO60. That's the lowest price we've seen for the pressure cook would make a perfect gift for anyone on your list. instant Pot? $49? Top choice.\n\nView Deal\n\nRobot Roomba 670 Robot Vacuum: $329.99 $197 at Walmart\n\nAlways a best-seller during Black Friday, Walmart has the iRobot Roomba 670 on sale for $197. That's a nice discount and the lowest price we've found for the Alexa-enabled robot vacuum.\n\nView Deal\n\nDyson Cyclone V10 Absolute vacuum cleaner: $599.99 $399.99 at Dyson\n\nFor a limited time, you can get the Dyson Cyclone V10 Absolute on sale for $399.99. That's the lowest price we've found for the cordless vacuum which is powered by the V10 digital motor to deep clean carpets and hard floors and can conveniently transform into a handheld vacuum. Ends on Monday, November 18 at 10 AM EST.View Deal\n\nDyson V8 Animal Cordless Stick Vacuum Cleaner: $499 $249 at Amazon\n\nFor a limited time, you can save $200 on the top-rated Dyson V8 Animal vacuum. The cordless vacuum cleaner provides up to 40 minutes of run time and features the powerful Dyson digital motor that's engineered to deep clean homes with pets.\n\nView Deal\n\nBella Pro Series 6qt Digital Air Fryer: $99.99 $49.99 at Best Buy\n\nPrepare your tasty fried foods with less oil with the Bella Pro Digital Air Fryer that's currently 50% off at Best Buy. The six-quart air fryer features an easy touch digital touchscreen and is dishwasher safe for a quick and easy cleanup.\n\nView Deal\n\nFarberware 3.2 Quart Oil-less Digital Air Fryer: $69 $39 at Walmart\n\nWalmart has the best-selling Farberware Fryer on sale for just $39. The 3.2-quart fryer allows you to cook your favorite fried foods with less oil and features eight preprogrammed options - and it's a steal at under $50.\n\nView Deal\n\nFarberware 1.9-Quart Compact Oil-Less Fryer: $44.48 $29.88 at Walmart\n\nGet the Farberware oil-less Fryer on sale at Walmart for just $29.88. The compact fryer uses little to no oil to bake, grill, toast and fry your favorite foods up to 30% faster - and for very little cash.\n\nView Deal\n\nLaptop deals\n\nLenovo Legion Y540 Gaming Laptop: $1,200 $849 at Walmart\n\nThis 15-inch budget gaming laptop is targeting 1080p gaming with these specs, packing a GTX 1660 Ti and 16GB of RAM. You've also got a 256GB SSD in there, along with a 1TB HDD for storage. View Deal\n\nLenovo Legion Y540 Gaming Laptop: $1,399 $999 at Walmart\n\nThis version of the 15.6-inch Y540 laptop comes with an i7-950H processor as well as a GTX 1660 Ti, along with 16GB of RAM and a 512GB SSD. View Deal\n\nApple MacBook Air (2017): $999 $790 at Walmart\n\nThis deal on the original-design MacBook Air gets you the standard 5th-generation Intel Core i5 CPU with 8GB of memory and a 128GB solid-state drive behind a 900p display for $200 off list price.View Deal\n\nApple MacBook Pro 15-inch Intel Core i9, 16GB RAM, AMD Radeon Pro 560X: $2,799.99 $2,349.99 at Amazon\n\nThis deal has just got even better, with Amazon cutting $450 off the price of the MacBook Pro model that comes with a 9th generation Intel Core i9 processor, 512GB SSD and AMD Radeon Pro 560X GPU. View Deal\n\nApple MacBook 15-inch Intel Core i7, 16GB RAM, AMD Radeon Pro 555X: $2,399.99 $2,049.99 at Best Buy\n\nGet a huge $350 off this model of the 15-inch MacBook Pro, with a 9th generation Intel Core i7 processor, 16GB RAM and 256GB hard drive. This model also features the AMD Radeon Pro 555X GPU. This deal now has an extra $150 off compared to a few days ago.View Deal\n\nHP 14 Laptop: $599 $399 at Walmart\n\nSave $200 on the HP 14 laptop at Walmart. The powerful 14-inch laptop packs an Intel 10th Gen Core i5-1035G1 processor, 8GB of RAM, and 256GB of storage.\n\nView Deal\n\nPC components deals\n\nXPG Gammix D30 | 16GB 3,000MHz: $79 $59.99 at Newegg\n\nThis 16GB kit of DDR4 RAM might not be the most beautiful on the market, but at just $49 at Newegg ahead of Black Friday, it's absolutely worth it. And with that 3,000MHz clock speed, it's nice and speedy, too.View Deal\n\nSamsung 32-inch curved monitor: $349 $169 at Walmart\n\nHere's a rather sizable monitor with an 1800R screen curvature for extra immersion in your games and movies. Just know that it's a 1080p display running at 60Hz refresh rate, which is basic but not bad at all for a whopping $170 off list price.View Deal\n\nCorsair K95 Platinum: $199 $129 at Best Buy\n\nThe Corsair K95 Platinum is frankly one of the best keyboards on the market today. With its excellent key switches, robust lighting and build quality and its extensive macro keys, this is one gaming keyboard you don't want to miss. The $70 discount doesn't hurt.View Deal\n\nWD Black 1TB HDD: $69 $59 on Amazon\n\nLooking to get HDD storage on the cheap? Pick up this WD Black 3.5-inch HDD for $9 off - but at such a low price, that's a 13% savings. It's got 7200 RPM SATA 6 GB/s 64MB Cache, if you're wondering.View Deal\n\nWD Blue 6TB HDD: $166 $111.99 on Amazon\n\nIf you want a bit more (read: a lot) of HDD storage, pick up this Blue 6TB from Western Digital. Its 5400 RPM is acceptable but not as fast as other hard drives specced for gaming, but the extra space makes up for it. Note that this cost $2 less previously. View Deal\n\nSamsung 860 Evo 2TB SATA SSD: $400 $229 at Amazon\n\nGet a massive 43% off this fantastic SATA solid state drive, which we've named our best budget SSD. Black Friday is a great time to get a big saving on SATA SSDs, and this is the cheapest price that Amazon has offered for this particular drive.View Deal\n\nSamsung 970 Evo Plus NVMe 2TB SSD: $499 $399 at Amazon\n\nIf you're after a high-performance NVMe drive and don't mind spending a little extra, this is a decent drop for 2TB. That's plenty of space for games, media, or whatever else you want to store. View Deal\n\nHome audio deals\n\nApple HomePod | Space Gray $299.99 $199.99 at Best Buy\n\nThe smart speaker for Apple fans, the HomePod is a small but powerful speaker designed to hook into Apple Music and all the other Apple HomeKit enabled devices in your phone, enabling a broad spectrum of voice commands via Siri.View Deal\n\nSony SSCS8 Center Speaker: $148 $73 at Amazon\n\nIf you're in the process of making a nice surround sound system in your living room, you're going to need a good center speaker. And, right now at Amazon, you can get the Sony SSCS8 for just $73.\n\nView Deal\n\nSony STR-DH790: $378 $198 at Amazon\n\nIf you're on the market for a A/V receiver, you probably already know they can get super expensive. However, ahead of Black Friday you can pick up this Sony STR-DH790 for a whopping 48% off.\n\nView Deal\n\nSony SSC55: $148 $73 at Amazon\n\nThe Sony SSCS5 is an excellent pair of bookshelf speakers that can give you excellent sound without hurting your wallet too much. With 6 ohms of impedence and a reinforced woofer, these speakers will last. And, you can get them for just $73.View Deal\n\nSony HT-S350: $279 $148 at Amazon\n\nThe Sony HT S350 is an easy solution if you're looking for awesome sound in your home theater setup. Plus, ahead of Black Friday, you can get this awesome soundbar for just $148 at Amazon. Now, you can have a nice 2.1 sound setup without your wallet hating you.View Deal\n\nSony PS-LX310BT: $199 $148 at Amazon\n\nWe don't want to sound like a broken record, but if you're a music fan in 2019 you absolutely need a decent record player, and this turntable from Sony perfectly fits the bill. And, ahead of Black Friday you can get it for just $148.View Deal\n\nPhones deals\n\niPhone 6s | 32GB | Space Gray | Straight Talk Prepaid | $299 $99 at Walmart\n\nThis is the cheapest you'll get an iPhone that can still run iOS 13 this Black Friday. At just $99, Walmart have cut the price on its 32GB iPhone 6s by two thirds - an amazing price if you're looking for a cheap Apple device. The 6s itself has held up well since its release, and still powers through recent apps and software updates like a champ.\n\nView Deal\n\niPhone 11, 64GB | Receive a $300 in eGift Cards with activation\n\nWalmart is offering a $300 eGift Card with your purchase of the all-new Apple iPhone 11. You must activate your phone on a qualifying AT&T or Verizon plan and you'll receive the Walmart gift card via ema­­il within 24 hours of phone activation.\n\nView Deal\n\niPhone 11 Pro, 64GB | Receive a $300 eGift Card with activation\n\nGet a $300 in eGift Card from Walmart with your purchase of the iPhone 11 Pro with activation from Verizon or AT&T. The 11 Pro features a 5.8-inch Super Retina XDR OLED display and comes in your color choice of gold, silver, gray or midnight green.\n\nView Deal\n\niPhone 11 Pro Max, 512GB | Receive a $300 eGift Card with activation\n\nBuy the massive iPhone 11 Pro Max and get a $300 eGift Card with activation from Verizon or AT&T. The 11 Pro Max features a 6.5-inch Super Retina XDR OLED display and offers a 512GB storage option.\n\nView Deal\n\niPhone XS, 64GB | Receive a $450 eGift Card with activation\n\nWalmart is offering a $450 eGift Card with your purchase of the iPhone XS when you activate with Verizon or AT&T. The 64GB iPhone features a 5.8-inch Super Retina display and is available in silver, grey or gold.\n\nView Deal\n\niPhone XR, 64GB | Receive a $400 eGift Card with activation\n\nGet a $400 eGift Card with your purchase of the iPhone XR with activation from Verizon or AT&T. The solid iPhone XR features a 6.1-inch Liquid Retina display and comes in six different fun color choices.\n\nView Deal\n\nSamsung Galaxy S10e 128GB: $ 749 $189 (with trade-in) on Samsung\n\nThe Samsung Galaxy S10e is the budget version of the S10 line, but it doesn't sacrifice much for its lower cost. It lacks the telephoto lens and a bit of RAM, but otherwise, it's nearly as fast and capable as its bigger siblings with a 5.8-inch screen that's perfect for smaller hands. Note that this value includes maximum trade-in value and carrier sign-up.View Deal\n\nSamsung Galaxy S10 128GB: $ 899 $339 (with trade-in) on Samsung\n\nThe standard Samsung Galaxy S10 is the flagship phone in all its glory: 6.1-inch screen, Snapdragon 855, 128GB of storage, and a full three-lens camera. Note that this value includes maximum trade-in value and carrier sign-up.View Deal\n\nSamsung Galaxy Note 10 + Free Galaxy Buds: $949.99 $749.99 at Walmart\n\nYou can save $200 off the new Galaxy Note phone and get a free pair of Galaxy Buds while you're at it for Black Friday (an added value of $119). That's a major savings from Walmart.View Deal\n\nSamsung Galaxy Note 10 256GB: $999 $309 (with trade-in) at Samsung\n\nThe new Note 10 is bigger, faster, and sleeker than ever before with a 6.3-inch screen, Snapdragon 855 chipset, 8GB of RAM, a generous 256GB of storage baseline, a triple rear camera - and, of course, the S Pen stylus. Note that this value includes maximum trade-in value and carrier sign-up - at minimum, it's $799.View Deal\n\nDNA deals\n\n23andMe Personal Ancestry + Traits Kit: $99.99 $79 at Walmart\n\nSave $20 on the best-selling 23andME Personal Ancestry and Traits Kit at Walmart. The Kit allows you to discover where your DNA is from out of 1500+ geographic regions and includes an automatic family tree builder.\n\nView Deal\n\n23andMe DNA Test: $199 $99 at Walmart\n\nA unique Christmas gift idea, you can save $100 on the 23andMe DNA test. The DNA kit includes ancestry service plus more than 85 DNA-based online reports on health predispositions, carrier status, and traits with just one test.\n\nView Deal\n\n23andMe Ancestry Personal Genetic DNA Test: $99 $79 at Amazon\n\nA great Christmas gift idea, you can save $20 on the 23andMe Ancestry DNA kit. The popular DNA test allows you to discover your ancestry composition and where your DNA is from across 1500+ regions.\n\nView Deal\n\n23andMe Personal Ancestry + Traits Kit: $99.99 $79 at Walmart\n\nSave $20 on the best-selling 23andME Personal Ancestry and Traits Kit at Walmart. The Kit allows you to discover where your DNA is from out of 1,500+ geographic regions, and includes an automatic family tree builder.\n\nView Deal\n\nMyHeritage DNA Test Kit: $75 $49 at Amazon\n\nAmazon has the top-rated MyHeritage DNA test kit on sale for $49. You can discover your ancestry and a detailed ethnicity breakdown from 42 regions.\n\nView Deal\n\nCameras\n\nCanon EOS M50 mirrorless camera: $899 $579 at B&H Photo\n\nHere's our pick for the best mirrorless camera under $600. And for good reason: it launched at $900 when it came out a year-and-a-half ago. It takes 4K video and 24.1MP photos like a champ.View Deal\n\nGoPro Hero7 White | $199 $139 at Walmart\n\nThis GoPro Black Friday deal is not to be missed if you're looking to get into action photography for cheaper than it's ever been before. The entry-level Hero7 White model is now available for just $139, saving you $70 on a starter action camera made for all-terrain adventures.\n\nView Deal\n\nGoPro HERO7 Black: $329.99 $259.99 at Amazon\n\nWith Hyper Smooth video stabilization and Time Warp video capabilities, the GoPro HERO7 Black is still one of our favorite action cameras out there, even in the shadow of HERO8. This model records 4K at 60 video recording and shoots 12MP stills.\n\nView Deal\n\nGoPro Hero7 Silver: $299 $199 at Best Buy\n\nBest Buy is offering $100 off the ultra-popular GoPro HERO7. The waterproof action cam is just $199 for Black Friday and can stand up against any other camera on sale today.\n\nGoPro Hero White | $199 $139 at Walmart\n\nThis GoPro Black Friday deal is not to be missed if you're looking to get into action photography for cheaper than it's ever been before. The entry-level Hero7 White model is now available for just $139, saving you $70 on a starter action camera made for all-terrain adventures.\n\nView Deal\n\nNikon Z6: $1996.95 $1696.95 at B&H Photo Video\n\nThis is an excellent discount on our current favorite camera in the world. The bundle includes an FTZ adaptor, which lets you use your existing F-mount lenses with the Z6, plus a 32GB Sony XQD card and a water-repellant Ruggard Hunter 25 Holster Bag.\n\nView Deal\n\nCanon EOS RP: $2199.99 $1499.99 at Best Buy\n\nAn incredible price for a full-frame camera, the EOS RP is a fine stills performer and one of our favorite mirrorless snappers. This bundle comes with a free EF-EOS R adaptor to let you use your existing Canon glass, plus the excellent RF 24-240-mm F4-6.3 lens.\n\nView Deal\n\nNikon D3500 bundle: $1,299 $529 at Amazon\n\nOur favorite beginner DSLR is now available as part of this hugely impressive starter bundle. This Nikon D3500 bundle includes two lenses (the 18-55mm VR kit lens and 70-300mm zoom), plus a 128GB SD card, tripod, flash and countless other accessories. Perfect for those just getting started.\n\nView Deal\n\nNikon D5600: $799.99 $599.99 at Best Buy\n\nThis step-up DSLR has never been cheaper thanks to this excellent bundle, which includes an 18-55mm kit lens and 70-300mm zoom to help all focal lengths. The D5600 has a 24.2MP sensor, produces detailed images and has a handy articulating touchscreen too.\n\nView Deal\n\nCanon EOS Rebel T7: $649.99 $499.99 at B&H Photo Video\n\nHurry and catch this excellent, time-limited deal on this Canon EOS Rebel T7, an entry-level DSLR that's an ideal way to learn your photographic craft. It comes with an 18-55mm kit lens and 75-300m zoom, making it versatile enough for most shooting situations.\n\nView Deal\n\nFujifilm XP140: $229.95 $159.95 at BH Photo Video\n\nIf you need a rugged, waterproof camera for the holidays or to hand to the kids, then it's hard to find better value than this Fujifilm XP140 deal. Waterproof to 25m, the 16.4MP XP140 is also dust- and shock-proof and can shoot 4K video. View Deal\n\nSanDisk 128GB Extreme SD Card: $29 $23 on Amazon\n\nIf you're on the hunt for extra storage, this 128GB SD card has never been cheaper at $6 off. Only $6? Sure - but that's 20% off the list price. View Deal\n\nSoftware and other online services\n\nBitdefender Antivirus Plus | $59.99 $23.99 | 60% off\n\nGreat news! You can currently score a huge discount off our #1 rated antivirus. It's a special software treat for TechRadar readers. It means that fantastic virus protection for your PC is now even more affordable.\n\nView Deal\n\nNordVPN | 36 39 months | $430.20 $125.64 | 83% off\n\nNordVPN is ideal for anyone who wants a very fast and easy VPN to use - especially for an effective $3.49 per month! It's range of features include P2P-optimized servers, malware blocking and even Bitcoin support. And it now comes with free NordLocker file encryption, too!\n\nView Deal\n\nPureVPN | 5 years cover | 88% off | $1.32 a month ($79 total)\n\nThis is among the cheapest VPN deals going - it really is ridiculously cheap! You can connect up to five devices to one account, so your smartphone, TV etc, plus it offers over 2,000 servers and claims super fast speeds. All that for one payment of $79 to cover the next five years.\n\nView Deal\n\nBluehost web hosting | Basic Plan| From $2.65 a month | 67% saving\n\nA plan that's ideal for anyone who doesn't need unlimited domains and is only looking at setting up one website with simple features. With this plan you're getting 50GB of bandwith, 100MB per account, 24/7 customer support, and a standard SSL certificate for just $2.65 a month.\n\nView Deal\n\nHostinger web hosting | Single Plan | $0.80/£0.80 a month | 90% saving\n\nThis plan is ideal for anyone who doesn't need unlimited domains and is only looking at setting up one website with simple features. The plan offers 100GB of bandwith, 10GB of disk space, 24/7 customer support and a business email account. Fantastic value web hosting.\n\nView Deal\n\nEXCLUSIVE IDrive 3TB plan | $69.50 $3.48 for 1 year | 95% off\n\n95% off in the name of Black Friday? Now that's a brilliant cloud storage deal. $69.50 may seem a bit pricey for a year's worth of 3TB but $3.48 for a whole 12 months is ridiculously cheap. Not to mention 3TB should go a very long way in covering your storage needs.\n\nView Deal\n\nBlack Friday deals you missed\n\n(SOLD OUT) Razer Deathadder Elite $99 $29 at Newegg\n\nThe Razer Deathadder Elite is one of the most popular gaming mice out there, and for good reason. It's got a robust sensor, a comfortable build and the perfect amount of buttons. And, it's just $29 ahead of Black Friday.\n\n(PRICE INCREASED) Shark ION Robot Vacuum R75: $349 $179 at Walmart\n\nA fantastic price for a robot vacuum, Walmart has the Shark ION Robot Vacuum on sale during Black Friday. The Alexa-enabled vacuum has a compatible app so you can clean and schedule your floors from anywhere.\n\nView Deal\n\n(PRICE INCREASED) Dyson V7 Motorhead Cord-Free Vacuum: $279 $179 at Walmart\n\nThe powerful Dyson V7 gets a $100 price cut at Walmart. The cord-free vacuum features a V7 motorhead to deep clean carpets and hard floors and includes a convenient hand-held vac.\n\n\n\nSamsung Galaxy Tab A Tablet: $227.99 $178.99 at Walmart\n\nA fantastic budget tablet option, you can get the Samsung Galaxy Tab A on sale for $178.99. Perfect for watching movies and shows, the 10.1-inch tablet features 32GB of storage and provides 13 hours of battery life.\n\nView Deal\n\nPowerbeats3 wireless headphones: $199.95 $89 at Walmart\n\nYou can save $110.95 on these Powerbeats 3 wireless headphones in this amazing Beats Black Friday deal. These earbuds have just gone below $100 at Walmart, so if you're looking for comfortable wireless earbuds with excellent fit, punchy bass, and all the benefits of Apple's W1 chip, you better snap up this deal quick.\n\nView Deal\n\nBeats Solo3 wireless headphones: $299.95 $129 at Walmart\n\nYou can get the Beats Solo3 wireless headphones on sale for $129 at Walmart. A fantastic price for a set of high-quality headphones with incredible battery, wireless range, and Apple device pairing.\n\nView Deal\n\nHyperX Cloud II Gaming Headset: $99 $59 at Walmart\n\nWalmart's Black Friday sale has the HyperX Cloud II Gaming headset on sale for just $59. Perfect for serious gamers, the headset includes a premium USB sound card, a digitally enhanced microphone and 7.1 virtual surround sound.\n\nView Deal\n\nSamsung Galaxy Buds: $129.99 $119 at Walmart\n\nGet the newly released Samsung Galaxy Buds on sale for $119. The earbuds feature Ambient Aware technology which lets you control how much surrounding noise you want to hear.\n\nView Deal\n\nBeats Solo3 Wireless Headphones: $299.95 $129 at Walmart\n\nYou can save $170 on the best-selling Beats Solo3 wireless headphones. This deal is for the Beats Pop Collection which includes four different fun color combinations.\n\nView Deal\n\nPowerbeats3 wireless headphones: $199.95 $89 at Walmart\n\nYou can save $110.95 on these Powerbeats 3 wireless headphones in this amazing Beats Black Friday deal. These earbuds have just gone below $100 at Walmart, so if you're looking for comfortable wireless earbuds with excellent fit, punchy bass, and all the benefits of Apple's W1 chip, you better snap up this deal quick.\n\nView Deal\n\nBeats Solo3 wireless headphones: $299.95 $129 at Walmart\n\nYou can get the Beats Solo3 wireless headphones on sale for $129 at Walmart. A fantastic price for a set of high-quality headphones with incredible battery, wireless range, and Apple device pairing.\n\nView Deal\n\nHyperX Cloud II Gaming Headset: $99 $59 at Walmart\n\nWalmart's Black Friday sale has the HyperX Cloud II Gaming headset on sale for just $59. Perfect for serious gamers, the headset includes a premium USB sound card, a digitally enhanced microphone and 7.1 virtual surround sound.\n\nView Deal\n\nSamsung Galaxy Buds: $129.99 $119 at Walmart\n\nGet the newly released Samsung Galaxy Buds on sale for $119. The earbuds feature Ambient Aware technology which lets you control how much surrounding noise you want to hear.\n\nView Deal\n\nBeats Solo3 Wireless Headphones: $299.95 $129 at Walmart\n\nYou can save $170 on the best-selling Beats Solo3 wireless headphones. This deal is for the Beats Pop Collection which includes four different fun color combinations.\n\nView Deal\n\nDeals you've missed\n\n(OUT OF STOCK) GoPro Hero7 White | $199 $139 at Walmart\n\nThis GoPro Black Friday deal is not to be missed if you're looking to get into action photography for cheaper than it's ever been before. The entry-level Hero7 White model is now available for just $139 at Walmart this Black Friday, saving you $30 on a starter action camera made for all terrain adventures. Shoot 1080p video at up to 60fps with image stabilization and take 10MP stills at the tap of a touchscreen button (or through phone, or using your voice).\n\n\n\nView Deal", "images": ["https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe-1200-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe-1200-80.jpg", "keywords": [], "authors": ["Gareth Beavis"], "canonical_link": "https://www.techradar.com/news/black-friday-deals-2019", "title": "The best Black Friday deals 2019: welcome to a full weekend of deals", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2019-11-30T16:38:06+00:00", "description": "The Black Friday sales aren't over yet - and you can find the best remaining deals right here.", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://vanilla.futurecdn.net/techradar/147371/apple-touch-icon.png", "og": {"title": "The best Black Friday deals 2019: welcome to a full weekend of deals", "site_name": "TechRadar", "url": "https://www.techradar.com/news/black-friday-deals-2019", "description": "The Black Friday deals are continuing on into the weekend", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe-1200-80.jpg", "width": 1200}, "type": "article"}, "article": {"publisher": "https://www.facebook.com/TechRadar", "author": "https://www.facebook.com/TechRadar"}, "fb": {"app_id": 235441786508054}, "twitter": {"card": "summary_large_image", "site": "@TechRadar", "title": "The best Black Friday deals 2019: welcome to a full weekend of deals", "description": "The Black Friday deals are continuing on into the weekend", "creator": "@TechRadar", "image": "https://cdn.mos.cms.futurecdn.net/iXHiMjLENZkzcz7wtHkmAe-1200-80.jpg", "account_id": 15560223}, "google-site-verification": "jEzBNX-r47v-rgc86g7xG47qMqF4VJuXdLUueTx8saU", "p": {"domain_verify": "10329f1fd4d0a2cd5c0d3b3b809cb4cd"}, "OMG-Verify-V1": "1036697-2d2c9025-5430-4e79-8349-e8c1c926dd73", "taboola": {"url": "https://www.techradar.com/news/black-friday-deals-2019"}, "botify-site-verification": "xkNFqB6l1qBl8BEqMjQvrHuYinhxlJVe", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E", "theme-color": "#2f6e91", "lomadee-verification": 22816996, "parsely-type": "post", "parsely-pub-date": "2019-11-30T16:38:06+00:00", "parsely-title": "The best Black Friday deals 2019: welcome to a full weekend of deals", "parsely-link": "https://www.techradar.com/news/black-friday-deals-2019", "parsely-author": "Gareth Beavis", "parsely-section": "Black Friday", "parsely-tags": "deals,techdeals,Black Friday,black friday 2019,Black Friday sales,black friday deals,holiday,deals,techdeals,Black Friday,black friday 2019,Black Friday sales,black friday deals,holiday,Internet"}, "movies": [], "publish_date": null, "source": "https://www.techradar.com", "summary": ""}