{"url": "https://www.vibe.com/2017/09/tracee-ellis-ross-raps-big-sean-carpool-karaoke", "text": "Gabrielle Union's exit from America's Got Talent is now under the scope of SAG-AFTRA after it was reported that the actress/author was fired for speaking out against questionable practices at NBC.\n\nSAG-AFTRA, also known as the Screen Actors Guild‐American Federation of Television and Radio Artists labor union for media professionals, announced their investigation Monday (Dec. 2) following reports that Union's firing from the program was rooted in several types of bias. After it was announced that Union and fellow new judge Julianne Hough would not be returning for another season, Love B Scott reported that Union wasn't asked back due to her constantly calling out the problematic behavior by producers and producer Simon Cowell to NBC. Vulture also spoke to sources close to the show who shared several instances where producers displayed racial bias.\n\nWhen it came to the talent on the show, producers were allegedly irked by Union when she asked the preferred pronouns of those who performed in drag. Union also shared concerns over the treatment of talent of color. One case involved 10-year-old black rapper Dylan Gilmer who was a hit with the audience. Despite this, the judges were told to pick an act “that America can get behind.” In the same meeting about Gilmer, co-host Howie Mandel suggested a South African choir who took part in the competition could sing “something from The Lion King.\"\n\nOne of the most notable incidents that happened on the AGT set occurred when Jay Leno made a racist joke towards Koreans. After viewing a painting of Cowell and his five dogs, Leno said the images “looked like something on the menu at a Korean restaurant.” Union urged producers to report the joke to human resources but the notion fell on deaf ears. The joke was ultimately cut out of the episode.\n\nLastly, Union was allegedly told that her rotating hairstyles were “too black” for the AGT audience. A source says both Union and Hough received complaints about their hair, but Union was told dozens that her hairstyles were \"too black.\" The actress wore various of styles on the show like cornrows, sleek bobs and ponytails.\n\nView this post on Instagram\n\nA post shared by Gabrielle Union-Wade (@gabunion) on Aug 13, 2019 at 3:10pm PDT\n\nA spokesperson from SAG-AFTRA confirmed to The Hollywood Reporter the investigation. \"We take issues of workplace health and safety very seriously,\" they said. \"We immediately reached out to Ms. Union's representatives when these reports came to light. It is our practice to work closely with members who reach out to us and their representatives in instances like this, as that usually affords the best protection and best resolution for the affected member.\"\n\nThe statement continues, \"For certain matters, our investigation and enforcement needs to happen independently and we are prepared to handle this issue accordingly, as warranted. Our enforcement action is usually handled confidentially to protect the member involved, and we typically do not publicize these matters unless the member requests that we do so. While we have taken steps to investigate this matter, we have nothing to report now.\"\n\nVulture previously reported that Union and Cowell had a meeting to work out the kinks of their working relationship. Since both of them are repped by CAA, the actress was \"pushed\" into having the private meeting in an effort to smooth things over. The show then went into hiatus and she was fired shortly after.\n\nUnion has been met with support from her husband Dwyane Wade as well as the Time's Up organization and fellow actresses like Megan Good, Debra Messing, Patricia Arquette and Grey's Anatomy actress and activist Ellen Pompeo.\n\nSee some of the messages to Union below.\n\nIt’s unfortunate that @nbc the same network that protected disgusting men like Matt Lauer and punished women for speaking out or not putting up with it...has not changed their practices or culture. I support @itsgabrielleu commitment to speaking up to injustice. It takes courage\n\n— Ellen Pompeo (@EllenPompeo) November 28, 2019\n\nthank you for this @EllenPompeo. be better @nbc. we’re with you @itsgabrielleu. 🖤 https://t.co/UMfcqJZ46w\n\n— Ariana Grande (@ArianaGrande) November 28, 2019\n\nI am lucky to work with really good people at @nbc and am sad and angry to know this has been going on in that same network. I stand with @itsgabrielleu all the way. They should bring her back, with a big raise, and remove @SimonCowell instead. 🤙 https://t.co/ZDsmurRUd4\n\n— Jameela Jamil 🌈 (@jameelajamil) November 28, 2019\n\nSo my child wants act like a whole different human at her grandparents house. I’m exhausted. I saw that I missed a lot on the Twitter. We love you @itsgabrielleu ! #blackhairchallenge pic.twitter.com/A7iSFs17U4\n\n— Tika Sumpter (@iamtikasumpter) November 28, 2019\n\nI love you. I stan you. And I stand with you @itsgabrielleu https://t.co/xMKmthzIz6\n\n— kerry washington (@kerrywashington) November 30, 2019\n\nThe reason why this Gabrielle Union story hits chord with so many black folks is because the workplace that's being described is one where we've all worked. Where they hire you to bring some diversity to the table and then hate you for actually trying to make them diversify.\n\n— Corey Richardson (@vexedinthecity) November 28, 2019\n\nSunday Signs meet #Monday Motivation. @itsgabrielleu has this way of encouraging people to speak their truth. She did that for me on many occasions. I’m proud of her for owning her story and her truth. 💜https://t.co/loK70Vbsjn\n\n— Tamron Hall (@tamronhall) December 2, 2019\n\nThis! This! AND THIIISSSSSSS!!!!!! https://t.co/RCrtKtkQ4L\n\n— Gabrielle Union (@itsgabrielleu) December 1, 2019", "images": ["https://static.vibe.com/files/2019/11/harriet-tubman-jr-1574230853-650x366.jpg", "https://static.vibe.com/files/2019/11/steph-curry-GettyImages-1139837419-1574480863-650x366.jpg", "https://static.vibe.com/files/2017/09/Big-Sean-Carpool-Karaoke-1505920599-compressed.png", "https://static.vibe.com/files/2019/11/burna-boy-grammys-nod-opinion-1575076098-e1575129847851-240x135.jpg", "https://static.vibe.com/files/2019/11/kolinmendezphoto-bkm-yasiin-bey-negus-opening-festivities-81-2547-1574876705-240x135.jpg", "https://static.vibe.com/files/2019/11/queen-and-slim-cover-vibe-homepage-1574868577-240x135.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://static.vibe.com/files/2019/12/GettyImages-1175631877-1575305147-650x366.jpg", "https://www.vibe.com/assets/images/logo/white.svg?17e8de0dd3d4d71eb87f", "https://static.vibe.com/files/2019/12/jill-scott-tour-dates-1575305405-300x169.jpg"], "top_img": "https://static.vibe.com/files/2017/09/Big-Sean-Carpool-Karaoke-1505920599-compressed.png", "keywords": [], "authors": ["Desire Thompson"], "canonical_link": "https://www.vibe.com/2017/09/tracee-ellis-ross-raps-big-sean-carpool-karaoke", "title": "Tracee Ellis Ross Raps With Big Sean On 'Carpool Karaoke'", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no", "article": {"modified_time": "2017-09-20T13:05:45-04:00", "published_time": "2017-09-20T12:00:28-04:00"}, "description": "\"It's past time that y'all knew, I'm not the lady from 'The Chew'\"", "og": {"description": "\"It's past time that y'all knew, I'm not the lady from 'The Chew'\"", "image": {"identifier": "https://static.vibe.com/files/2017/09/Big-Sean-Carpool-Karaoke-1505920599-compressed.png", "height": 350, "width": 640}, "title": "Tracee Ellis Ross Raps With Big Sean On 'Carpool Karaoke'", "type": "article", "url": "https://www.vibe.com/2017/09/tracee-ellis-ross-raps-big-sean-carpool-karaoke", "site_name": "Vibe"}, "twitter": {"card": "summary", "description": "\"It's past time that y'all knew, I'm not the lady from 'The Chew'\"", "image": "https://static.vibe.com/files/2017/09/Big-Sean-Carpool-Karaoke-1505920599-compressed.png", "title": "Tracee Ellis Ross, AKA T-Murda, Spits Hot Fire With Big Sean On 'Carpool Karaoke'", "site": "@vibemagazine"}}, "movies": [], "publish_date": 1505923228.0, "source": "https://www.vibe.com", "summary": ""}