{"url": "https://www.wanttoknow.info/newsstories-0-10000", "text": "News Stories Excerpts of Key News Stories in Major Media\n\nNote: This comprehensive list of news stories is usually updated once a week. Explore our full index to revealing excerpts of key major media news stories on several dozen engaging topics. And don't miss amazing excerpts from 20 of the most revealing news articles ever published.\n\nAfter Disastrous Epstein Interview, Prince Andrew Steps Down From Public Duties\n\n2019-11-20, New York Times\n\nPosted: 2019-11-24 18:57:47\n\nPrince Andrew announced on Wednesday that he would step back from public life, seeking to contain a firestorm over his ties to the disgraced financier Jeffrey Epstein. “It has become clear to me over the past few days that my association with Jeffrey Epstein has become a major disruption to my family’s work and the valuable work going on in the many organizations and charities that I am proud to support,” Prince Andrew said in a statement. “Therefore, I have asked Her Majesty if I can step back from public duties for the foreseeable future, and she has given her permission,” said the prince, who is also known as the Duke of York. The duke, 59, had hoped that the interview, broadcast Saturday by the BBC, would put to rest lingering questions about his ties to Mr. Epstein, as well as accusations that he had sex with a teenage girl who had been supplied to him by his friend. Instead, after the duke submitted to 50 minutes of polite but relentless grilling by the BBC journalist Emily Maitlis, his unsavory association with Mr. Epstein ... mutated into a full-blown scandal. Viewers expressed shock and anger at Prince Andrew’s lack of sympathy for Mr. Epstein’s victims, as well as his unpersuasive denials of sexual misconduct, which included peculiar assertions, such as that he has been medically unable to perspire since his combat tour in the Falklands War. In August ... Virginia Roberts Giuffre, accused the prince of having sex with her three times when she was 17 years old and had been offered to him by Mr. Epstein.\n\nNote: Prince Andrew is finding himself increasingly isolated because of comments he's made about Epstein. Explore an article in the UK's Telegraph titled \"Prince Andrew named in secret new evidence against Jeffrey Epstein.\" For more, see summaries of deeply revealing news articles on Jeffrey Epstein. Watch an excellent segment by Australia's \"60-Minutes\" team \"Spies, Lords and Predators\" on a pedophile ring in the UK which leads to the highest levels of government. A second suppressed documentary, \"Conspiracy of Silence,\" goes even deeper into this topic in the US.\n\nLady Colin Campbell says Jeffrey Epstein is NOT a paedophile during GMB row on Prince Andrew\n\n2019-11-18, MSN News\n\nPosted: 2019-11-24 18:55:37\n\nLady Colin Campbell today said Jeffrey Epstein should not be called a paedophile during a panel discussion about Prince Andrew's BBC Newsnight interview. The royal biographer made the comments while discussing the Duke of York's interview, which aired on Saturday and in which he discussed his links to the disgraced financier. Host Piers Morgan was addressing the prince's visit to Epstein's home when Lady Colin Campbell interrupted to claim that the financier's convictions did not make him a paedophile. \"You all seem to have forgotten that Jeffrey Epstein, the offence with which he was charged and for which he was imprisoned, was 'soliciting prostitution from minors'. \"That is not the same thing as paedophilia,\" she said. The conversation turned heated as Morgan replied: \"Well, what would you call it? If you solicit a 14-year-old for prostitution then you're a paedophile.\" But Lady Campbell ... responded by claiming that the term 'minor' did not refer to a child. She was then corrected by the host. Morgan was referring to allegations that Epstein abused dozens of girls some as young as 14-years-old. Epstein, 66, died in jail on August 10 while facing sex trafficking charges of under-age girls, some as young as 14. He faced sex trafficking accusations in Florida in 2007 but signed a deal that year with prosecutors. The controversial arrangement allowed him to avoid federal charges and plead guilty to lesser state prostitution charges, for which he spent 13 months behind bars.\n\nNote: If the above link fails, this article is also available here. Prince Andrew is finding himself increasingly isolated because of comments he's made about Epstein. For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein. Then watch an excellent segment by Australia's \"60-Minutes\" team \"Spies, Lords and Predators\" on a pedophile ring in the UK which leads directly to the highest levels of government. A second suppressed documentary, \"Conspiracy of Silence,\" goes even deeper into this topic in the US.\n\nFBI probing if Jeffrey Epstein’s death was the result of a ‘criminal enterprise,’ prisons chief says\n\n2019-11-19, CNBC News\n\nPosted: 2019-11-24 18:53:29\n\nThe FBI is investigating whether a “criminal enterprise” played a role in the controversial jailhouse death of well-connected sex criminal Jeffrey Epstein, the head of the federal prison system told a Senate committee Tuesday. But Bureau of Prisons Director Kathleen Hawk Sawyer also testified that there is “no indication, from anything I know,” that the wealthy investor’s demise on Aug. 10 “was anything other than a suicide.” At the time Epstein died, the former friend of Presidents Donald Trump and Bill Clinton was awaiting trial on child sex trafficking charges. Sawyer’s testimony before the Senate Judiciary Committee came on the same day that two guards from a Manhattan jail operated by the BOP were criminally charged with falsifying official records to cover up the fact that they never conducted mandated safety checks on Epstein and other inmates in the hours before he was found unresponsive with a noose around his neck. The New York City medical examiner’s office has ruled Epstein’s death was a suicide by hanging. But Dr. Michael Baden, a forensic pathologist hired by Epstein’s brother, has said that the injuries found on Epstein’s neck were more consistent with those found in homicides. During Tuesday’s hearing, one senator underscored to the prisons boss how skeptical many people are about the official ruling that Epstein killed himself. “Christmas ornaments, drywall and [Jeffrey] Epstein. Name three things that don’t hang themselves,” said Sen. John Kennedy, R-La.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein from reliable major media sources. Then watch an excellent segment by Australia's \"60-Minutes\" team \"Spies, Lords and Predators\" on a pedophile ring in the UK which leads directly to the highest levels of government. A second suppressed documentary, \"Conspiracy of Silence,\" goes even deeper into this topic in the US.\n\nA Dead Cat, A Lawyer's Call And A 5-Figure Donation: How Media Fell Short On Epstein\n\n2019-08-22, NPR\n\nPosted: 2019-11-24 18:50:37\n\nA coterie of intimidating lawyers. A five-figure donation. Even, it is alleged, a cat's severed head in the front yard of the editor-in-chief of Vanity Fair. Such were the tools the disgraced financier Jeffrey Epstein is said to have used to try to soften news coverage and at times stave off journalistic scrutiny altogether. Epstein killed himself, authorities say, in federal prison as he faced criminal charges alleging sex trafficking of underage girls, some as young as 14. And yet with a few notable exceptions, the national media infrequently covered Epstein's behavior and rarely looked at the associates who helped him evade accountability for his actions — at least, not until the Miami Herald's Julie K. Brown's investigative series late last year. \"We count on the press to uncover problems, not merely to report on when problems have been prosecuted,\" says David Boies, an attorney for several of Epstein's accusers. \"And here you had a terrible problem. A horrific series of abuses.\" Boies' firm helped file lawsuits in 2015 and 2017 for clients alleging that Epstein and his associates had sexually trafficked underage girls, at his various homes. The suits were publicly available documents but received little attention in the press. In some cases, Epstein successfully scared off some accusers and struck confidential settlements with others, making it harder for reporters to get them to recount their experiences on the record.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein and media manipulation. from reliable major media sources. Then watch an excellent segment by Australia's \"60-Minutes\" team \"Spies, Lords and Predators\" on a pedophile ring in the UK which leads directly to the highest levels of government. A second suppressed documentary, \"Conspiracy of Silence,\" goes even deeper into this topic in the US.\n\nJeffrey Epstein’s alleged madam Ghislaine Maxwell was a guest at a Jeff Bezos-hosted retreat in 2018\n\n2019-11-01, CNBC News\n\nPosted: 2019-11-24 18:48:28\n\nThe woman alleged to have been a procurer for accused child sex trafficker Jeffrey Epstein was reportedly a guest in 2018 at an exclusive literary retreat hosted by Jeff Bezos, the CEO of Amazon. Vice.com, citing two sources, reported Friday that the woman, Ghislaine Maxwell, attended the “Campfire” retreat last year. One of those sources said that Maxwell had attended three such Campfire retreats hosted by Bezos and Amazon. Maxwell, 57, went to the 2018 iteration of the highly secretive retreat with Scott Borgerson, a tech-firm CEO. That visit would have occurred before Epstein’s most recent arrest, in July of this year, on federal child sex trafficking charges. Maxwell, daughter of the late media tycoon and fraudster Robert Maxwell, has been accused by multiple women of acting as one of the procurers of girls and women for Epstein. One employee of Epstein’s called Maxwell the “lady of the house,” referring to his mansion in Palm Beach, Florida. Some accusers have also said Maxwell at times participated with Epstein in abusing them sexually. In court documents released in August, a woman named Virginia Giuffre said Maxwell directed her as a teenager to have sex with Prince Andrew of Britain, former Senate Majority Leader George Mitchell, former New Mexico Gov. Bill Richardson, hedge funder Glenn Dubin, late MIT scientist Marvin Minsky, modeling company founder Jean-Luc Brunel, the owner of a large hotel chain, and another prince.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein from reliable major media sources. Then watch an excellent segment by Australia's \"60-Minutes\" team \"Spies, Lords and Predators\" on a pedophile ring in the UK which leads directly to the highest levels of government. A second suppressed documentary, \"Conspiracy of Silence,\" goes even deeper into this topic in the US.\n\nAmerica’s billionaires take center stage in national politics, colliding with populist Democrats\n\n2019-11-09, Washington Post\n\nPosted: 2019-11-24 18:46:33\n\nThe political and economic power wielded by the approximately 750 wealthiest people in America has become a sudden flash point in the 2020 presidential election, as the nation’s billionaires push back with increasing ferocity against calls by liberal politicians to vastly reduce their fortunes and clout. On Thursday, Michael Bloomberg, a billionaire and former mayor of New York City, took steps to enter the presidential race, a move that would make him one of four billionaires who either plan to seek or have expressed interest in seeking the nation’s highest office in 2020. His decision came one week after Sen. Elizabeth Warren (D-Mass.) proposed vastly expanding her “wealth tax” on the nation’s biggest wealth holders and one month after Sen. Bernie Sanders (I-Vt.) said America should not have any billionaires at all. The leaders of the anti-billionaire populist surge, Warren and Sanders, have cast their plans to vastly increase taxes on the wealthy as necessary to fix several decades of widening inequality. Financial disparities between the rich and everyone else have widened over the past several decades in America, with inequality returning to levels not seen since the 1920s, as the richest 400 Americans now control more wealth than the bottom 60 percent of the wealth distribution. At least 16 billionaires have in recent months spoken out against what they regard as the danger posed by the populist Democrats, particularly over their proposals to enact a “wealth tax” on vast fortunes.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on income inequality from reliable major media sources.\n\nJulian Assange: Sweden drops rape investigation\n\n2019-11-19, BBC News\n\nPosted: 2019-11-24 18:44:47\n\nProsecutors in Sweden have dropped an investigation into a rape allegation made against Wikileaks co-founder Julian Assange in 2010. Assange, who denies the accusation, has avoided extradition to Sweden for seven years after seeking refuge at the Ecuadorean embassy in London in 2012. The 48-year-old Australian was evicted in April and sentenced to 50 weeks in jail for breaching his bail conditions. He is currently being held at Belmarsh prison in London. The Swedish investigation had been shelved in 2017 but was re-opened earlier this year. With the end of Julian Assange's legal troubles in Sweden, one long chapter in the saga is over. But another one, in the United States, has barely begun. The Wikileaks founder always argued that his fear of being extradited from Sweden to the US was why he had taken refuge in the Ecuadorean embassy in London. That political refuge ended unceremoniously in April, when he was dragged out by British police. Now Assange faces 18 criminal charges in the US, including conspiring to hack government computers and violating espionage laws. If convicted, he could face decades in jail. From behind bars in Belmarsh jail, Assange is trying to prepare for the case. The decision by Swedish prosecutors today means there'll now be no competing extradition request to the one from the US. In June, the then UK Home Secretary, Sajid Javid, formally approved an extradition request from the US.\n\nNote: Read a 2012 article from the UK's Guardian titled \"Don't lose sight of why the US is out to get Julian Assange.\" For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nDesperate Parents Of Autistic Children Trying Cannabis Despite Lack Of Studies\n\n2015-06-10, Forbes\n\nPosted: 2019-11-24 18:42:28\n\nParents of severely autistic children are turning to medical marijuana for relief. There are very few studies linking cannabinoids as a treatment for autism, but that isn't holding these parents back. Most figure they don't have anything to lose. Some [autistic] children are able to function well with various treatments, while others suffer with the inability to speak and self-harming behaviors. According to the Center for Disease Control and Prevention, 1.5% of the children in the U.S. are diagnosed with autism as of 2014. They are using CBD or cannabidiol, which can be derived from marijuana and hemp plants. The stories of autistic children that are helped with CBD oil sound very familiar to the stories of the epileptic children that have responded to CBD. Recently, Kalel Santiago, a child with autism so severe he wasn't able to speak, started speaking his first words after simply spraying hemp oil in his mouth twice daily according to Dr. Giovanni Martinez, a clinical psychologist in Puerto Rico. Dr. Martinez said, “He started using the product three weeks ago. He was a full non-verbal patient. He only made sounds. The only change in his treatments was the use of CBD.” The parents pursued the treatment on their own. Dr. Martinez has also been doing his own research on CBD and shared it with the parents. “I'm very impressed with the language he has acquired,” said Dr. Martinez.\n\nNote: Read more about the healing potential of CBD. For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\nWhy You Should Move Into An \"Agrihood\"\n\n2016-11-08, Forbes\n\nPosted: 2019-11-24 18:40:12\n\nWhen Stephanie Walsh and her husband were looking to buy a home in Atlanta, GA, they had a pretty unusual set of qualifications for their new home: They wanted to have access to local, organic produce (and not just from the grocery store); they wanted a neighborhood that was easily walkable; and they wanted to be true friends — not just smile and nod acquaintances — with their neighbors. On a whim, she searched the internet for “ecofriendly neighborhoods near Atlanta” and happened upon the website for Serenbe, a community of 270 “green” homes and 30 retailers planned around a 25-acre organic working farm and 15 miles of trails. “I fell in love immediately,” she says. They’ve now lived in Serenbe for over four years, and Walsh says they hardly ever leave. Serenbe is what’s known as an “agrihood,” a community that is usually planned around a farm and offers access to unblemished landscapes, locally grown food, and homes built to environmentally friendly standards. The planning of agrihoods is done in a way that fosters community and interaction between the people who live there. In Arizona’s Agritopia, fences aren’t any higher than 5 feet, making it very easy to have a conversation with the family next door when you see them in their backyard. “Every house has a front porch, and the houses are closer to the street,” says resident Katie Critchley. “You can be sitting on your porch and be able to have a normal-decibel-level conversation with someone walking their dog. It forces you to say hello.”\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nIn Detroit, A New Type of Agricultural Neighborhood Has Emerged\n\n2019-11-04, Yes! Magazine\n\nPosted: 2019-11-24 18:38:30\n\nAnother trend has entered the urban agricultural scene: agrihoods, short for agricultural neighborhoods. The Urban Land Institute defines agrihoods as master-planned housing communities with working farms as their focus. Overwhelmingly, they have large swaths of green space, orchards, hoop houses and greenhouses, and some with barns, outdoor community kitchens, and environmentally sustainable homes decked with solar panels and composting. Agrihoods, which number about 90 nationwide, are typically in rural and suburban areas. Within the city of Detroit, home to nearly 1,400 community gardens and farms, there is one officially designated agrihood, Michigan Urban Farming Initiative. The Michigan initiative is a 3-acre farm focusing on food insecurity in one of Detroit’s historic communities that was once home to a thriving Black middle class. Now the median home value is under $25,000, and about 35% of the residents are homeowners. The Detroit agrihood model plans to provide a Community Resource Center with educational programs and meeting space across from the garden, a café, and two commercial kitchens. “For us, food insecurity is the biggest issue,” says, Quan Blunt, the Michigan initiative’s farm manager. “The closest [fresh] produce store to this neighborhood is Whole Foods [4 miles away in Midtown], and you know how expensive they can be.” At MUFI, produce is free to all. The farm is open for harvesting on Saturday mornings.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nFederal Court: First Amendment Protects Sharing Food With Homeless People\n\n2018-08-27, Forbes\n\nPosted: 2019-11-24 18:36:49\n\nThe 11th U.S. Circuit Court of Appeals ruled on Wednesday that feeding the homeless is “expressive conduct protected by the First Amendment.” The decision revives a challenge brought by a local chapter of Food Not Bombs, which sued Fort Lauderdale, Florida for requiring a permit to share food in public parks. Originally started in the early 1980s by anti-nuclear activists in Cambridge, Massachusetts, Food Not Bombs protests war and poverty. Today, this network of social justice pacifists claims over 5,000 chapters worldwide. Writing for the court, Judge Adalberto Jordan explained that for the Fort Lauderdale chapter, “providing food in a visible public space” is “an act of political solidarity meant to convey the organization’s message.” But in October 2014, Fort Lauderdale enacted an ordinance that bans sharing food in public parks, unless the hosts obtain a “conditional use permit” from the city. In February 2015, Food Not Bombs sued the city. Having ruled that Food Not Bombs does have a First Amendment right to share food, the 11th Circuit sent the case back down to the lower court. “The court’s opinion recognized sharing food with another human being is one of the oldest forms of human expression,” said Kirsten Anderson, litigation director at the Southern Legal Counsel and lead attorney on the case. “This decision strengthens our message to cities across the country that they need to invest in constructive solutions to homelessness instead of ... punishing people who seek to offer aid.”\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\n‘I’ve had this story for three years’: ABC News anchor slams her network’s handling of Epstein scoop\n\n2019-11-05, Washington Post\n\nPosted: 2019-11-19 01:29:01\n\nAmy Robach of ABC News: “I tried for three years to get it on, to no avail, and now it’s all coming out. And it’s like these new revelations and I freaking had all of it. I am so pissed right now. ... What we had was unreal.” Those remarks come courtesy of James O’Keefe’s Project Veritas. The “unreal” story [was] related to Jeffrey Epstein, the shadowy financier who died in prison in August of an apparent suicide as he awaited trial for sex trafficking conspiracy and sex trafficking. In August, NPR’s David Folkenflik documented how three news outlets - Vanity Fair, the New York Times and ABC News - “fell short” in tugging on various strands of the Epstein story. ABC News managed to conduct an interview with Virginia Roberts Giuffre, who at the age of 17 had “become part of Epstein’s household.” She has alleged that Epstein “trafficked” her to his friends, including Prince Andrew. “I viewed the ABC interview as a potential game-changer,” Giuffre wrote in an email to NPR. As it turns out, Robach also viewed the interview with Giuffre as a game-changer. “Then the Palace found out that we had her whole allegations about Prince Andrew and threatened us in a million different ways,” says Robach. “We were so afraid we ... quashed the story. She told me everything. She had pictures, she had everything. She was in hiding for 12 years, we convinced her to come out.” Robach also mentions ... Alan Dershowitz, who represented Epstein in 2008 and also stepped in as ABC News was working on the Giuffre-Epstein story.\n\nNote: Don't miss this most telling leaked video. For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein and media manipulation from reliable major media sources.\n\nMainstream media largely ignores ABC's Epstein scandal; CNN’s scant coverage is lampooned\n\n2019-11-06, Fox News\n\nPosted: 2019-11-19 01:27:09\n\nMainstream media outlets have largely ignored the Project Veritas bombshell that ABC News killed a story that would have exposed the now-deceased sex offender Jeffrey Epstein three years ago. Fox News found no coverage on CNN, MSNBC, CBS News, or NBC News from noon through midnight ET on Tuesday while the story was lighting up social media. During that same time frame, Fox News covered the scandal on five different programs. Mainstream media essentially has an unspoken rule not to cover anything Project Veritas does, as the group’s controversial founder, James O'Keefe, describes himself as a “guerrilla journalist”. But the ABC video has been verified by ... ABC itself as authentic, and has therefore created quite a conundrum for mainstream media. Project Veritas’ most recent project, before releasing ABC News anchor Amy Robach's explosive hot mic tape, was publishing undercover recordings made by a now-former CNN employee who secretly documented staffers criticizing the network. The recordings also captured CNN president Jeff Zucker telling top news executives to focus solely on the impeachment of President Trump, even at the expense of other important news. “The traditional media surely do not like Project Veritas snooping around into their behind-the-scenes operations, but the Project Veritas videos of Amy Robach's and Jeff Zucker's comments do lend insight to the workings of these news organizations,\" [DePauw University professor and media critic Jeffrey] McCall said.\n\nNote: Don't miss this most telling leaked video. Listen also to a one-hour interview by Project Veritas of WantToKnow.info founder Fred Burks. For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein and media manipulation. from reliable major media sources.\n\nABC News Defends Its Epstein Coverage After Leaked Video Of Anchor\n\n2019-11-05, NPR\n\nPosted: 2019-11-19 01:23:58\n\nA newly surfaced video of an ABC News anchor's unguarded remarks about the network's coverage of the late Jeffrey Epstein has thrown ABC on the defensive. In a leaked video posted Tuesday by the right-wing activist group Project Veritas, news anchor Amy Robach expresses her frustration to a colleague over ABC's failure to broadcast her interview with a key accuser of Epstein. Robach complains that the network \"quashed\" her interview, suggesting that ABC had yielded to threats from powerful forces, including Buckingham Palace. Prince Andrew is among those men whom the accuser alleges Epstein trafficked her to for sex. Robach's comments in late August 2019 came just two days after an NPR story disclosed the existence of Giuffre's interview and ABC's failure to broadcast it. In the video, Robach is ... speaking remotely through her microphone with an unseen colleague. \"I've had the story for three years,\" Robach says in the video. \"We would not put it on the air. Um, first of all, I was told, 'Who was Jeffrey Epstein? No one knows who that is. This is a stupid story.' Then the palace found out that we had her whole allegations about Prince Andrew and threatened us a million different ways.\" Robach goes on to say that Giuffre alluded to others in the interview, including former President Bill Clinton, Harvard University law professor emeritus Alan Dershowitz and Epstein's former girlfriend, Ghislaine Maxwell. Giuffre has made similar accusations against all of them also in court documents.\n\nNote: Don't miss this most telling leaked video. Read also an article showing how a variety of independent news websites have condemned ABC and CBS over this matter. Meanwhile Newsweek has posted an article titled,\"'Epstein Didn't Kill Himself,' Former Navy Seal Blurts Out on Fox News.\" For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein from reliable major media sources.\n\nEpstein’s Autopsy ‘Points to Homicide,’ Pathologist Hired by Brother Claims\n\n2019-10-30, New York Times\n\nPosted: 2019-11-19 01:22:08\n\nA forensic pathologist hired by Jeffrey Epstein’s brother disputed the official finding in the autopsy of his death, claiming on Wednesday that the evidence suggested that he did not take his own life but may have been strangled. The New York City medical examiner’s office concluded in August that Mr. Epstein had hanged himself in his jail cell while awaiting trial on sex trafficking charges. But the private pathologist, Dr. Michael Baden, said on the morning TV show “Fox & Friends” that Mr. Epstein, 66, experienced a number of injuries - among them a broken bone in his neck - that “are extremely unusual in suicidal hangings and could occur much more commonly in homicidal strangulation.” Dr. Baden, a former New York City medical examiner and a Fox News contributor, added, “I’ve not seen in 50 years where that occurred in a suicidal hanging case.” The findings by Dr. Baden were strongly disputed by the city’s chief medical examiner, Dr. Barbara Sampson. Dr. Baden said Mr. Epstein had “three fractures in the hyoid bone, the thyroid cartilage.” The autopsy also showed Mr. Epstein had several bones broken in his neck. The city medical examiner said Mr. Epstein’s death was “hanging” and the manner was “suicide.” Before that determination was made public, an article in The Washington Post noted Mr. Epstein’s injuries included a broken hyoid bone. Mr. Epstein’s death led to several investigations into how a high-profile inmate apparently killed himself just weeks after he was placed on suicide watch.\n\nNote: Newsweek has also posted an article titled, \"'Epstein Didn't Kill Himself,' Former Navy Seal Blurts Out on Fox News.\" For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein from reliable major media sources.\n\n'Jeffrey Epstein didn’t kill himself' meme pops up on MSNBC\n\n2019-11-12, Fox News\n\nPosted: 2019-11-19 01:20:14\n\nThe sentence “Jeffrey Epstein did not kill himself” has emerged as a pop culture catchphrase popping up on TV and on memes across social media, sometimes creating awkward moments when people question the narrative surrounding the now-deceased sex offender’s mysterious death. The statement was uttered by an attendee of last weekend’s University of Alabama-Louisiana State University football game when an MSNBC reporter inquired what students thought about President Trump’s decision to attend the event. MSNBC’s Monica Alba asked a student what he liked about the president but didn’t receive the answer she expected. “I would say mainly just the no-nonsense policies and especially since Jeffrey Epstein didn’t kill himself,” a student identified as Parker said on live television. New York City Medical Examiner officially listed Jeffrey Epstein’s death as a suicide by hanging. However, everyone from forensic experts and social media sleuths to ABC News anchor Amy Robach have suggested there is more to the story. Robach said on an infamous hot mic video – that was leaked to the media from within ABC News – that she “100 percent” thinks Epstein was actually murdered. “He made his whole living blackmailing people. There [were] a lot of men in those planes, a lot of men who visited that island, lot of powerful men who came into that apartment,” Robach said. \"I knew immediately.\"\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein from reliable major media sources.\n\nFormer Twitter Employees Charged With Spying for Saudi Arabia\n\n2019-11-06, New York Times\n\nPosted: 2019-11-19 01:18:21\n\nAli Alzabarah was an engineer who rose through the ranks at Twitter to a job that gave him access to personal information and account data of the social media service’s millions of users. Ahmad Abouammo was a media partnerships manager at the company who could see the email addresses and phone numbers of Twitter accounts. On Wednesday, the Justice Department accused the two men of using their positions and their access to Twitter’s internal systems to aid Saudi Arabia by obtaining information on American citizens and Saudi dissidents who opposed the policies of the kingdom and its leaders. Mr. Alzabarah and Mr. Abouammo were charged with acting as agents of a foreign power inside the United States, in the first complaint of its kind involving Saudis in the country. The case raised questions about the security of American technology companies already under scrutiny for spreading disinformation and influencing public opinion, showing that these firms can be penetrated from the inside as well. It also underscored the broad effort that Crown Prince Mohammed bin Salman of Saudi Arabia and his close advisers have conducted to silence critics both inside the kingdom and abroad. Jamal Khashoggi, a columnist for The Washington Post who was critical of the way Saudi Arabia is run, was murdered last year by Saudi agents in Istanbul.\n\nNote: Read more on Saudi Arabia's extreme efforts to silence its critics. For more along these lines, see concise summaries of deeply revealing news articles on government corruption and media manipulation from reliable major media sources.\n\nReport: Election Vendors Are 'Prime Targets,' Need Oversight\n\n2019-11-12, New York Times/Associated Press\n\nPosted: 2019-11-19 01:16:20\n\nThe private companies that make voting equipment and build and maintain voter registration databases lack any meaningful federal oversight despite the crucial role they play in U.S. elections, leaving the nation's electoral process vulnerable to attack, according to a new report. The Brennan Center for Justice on Tuesday issued the report, which calls on Congress to establish a framework for federal certification of election vendors. The authors say this could be established as a voluntary program similar to how voting machines are certified, with incentives for state and local election officials to use vendors that have completed the process. It would include the establishment of federal standards and the ability for federal officials to monitor compliance and address any violations. The report's co-author Lawrence Norden acknowledged it was too late for any of this to happen in time for the 2020 presidential election. Although Congress sent $380 million to states last year for election security, Norden said it was a \"drop in the bucket\" of what is needed as state and local election officials look to fund the replacement of outdated and insecure voting systems, increase cybersecurity personnel and add security upgrades. Just three companies provide more than 80% of voting systems in the U.S.. Other systems like voter registration databases and electronic pollbooks are also supplied and, in some case, maintained by vendors.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on elections corruption from reliable major media sources.\n\nRichest 1% of Americans Close to Surpassing Wealth of Middle Class\n\n2019-11-10, MSN News/Bloomberg\n\nPosted: 2019-11-19 01:14:30\n\nThe U.S.’s historic economic expansion has so enriched one-percenters they now hold almost as much wealth as the middle- and upper-middle classes combined. The top 1% of American households have enjoyed huge returns in the stock market in the past decade, to the point that they now control more than half of the equity in U.S. public and private companies, according to data from the Federal Reserve. The very richest had assets of about $35.4 trillion in the second quarter, or just shy of the $36.9 trillion held by the tens of millions of people who make up ... much of the middle and upper-middle classes. It may not be long before one-percenters actually surpass the middle and upper-middle classes. Household wealth in the upper-most bracket grew by $650 billion in the second quarter of 2019, while Americans in the 50th to 90th percentiles saw a $210 billion gain. By another measurement the top 1% of taxpayers had incomes starting at $515,371 in 2017, according to the latest Internal Revenue Service data. For now, those Americans in 90th to 99th percentiles - well-to-do, but not the super rich - still control the biggest share of wealth, with $42.6 trillion in assets. The lone group left out of the fun: the bottom 50% of Americans. Those households have 35.7% of liabilities in the U.S. and just 6.1% of assets.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on income inequality from reliable major media sources.\n\nDog Learning to Talk By Using a Custom Soundboard to Speak\n\n2019-11-04, MSN News\n\nPosted: 2019-11-19 01:12:31\n\nMany dog parents already know their pets communicate with them, but what EXACTLY are they trying to say? A speech-language pathologist with an 18-month-old dog is working to find out, and she’s already discovered that her dog Stella can literally tell her things — like she’s tired after playing and now would like a nap, or that instead of playing at this moment she would prefer to eat, and that she would like to go outside, specifically to the park. It’s all possible through the use of an adaptive device Christina Hunger, 26, devised to help Stella communicate not only words but her thoughts and feelings too. When the Catahoula/Blue Heeler mix wants to “talk,” she steps on buttons corresponding with words Hunger recorded and programmed into the device. And Stella is already putting her language skills to work. One day, the pup was whining at the front door and started pacing back and forth. Hunger assumed that she needed to go outside. Instead, Stella walked to her device and tapped out, “Want,” “Jake” “Come” then stood in front of the door until Hunger’s fiancé, Jake, came home a few minutes later and then Stella immediately pressed “Happy” and rolled over for a belly rub. Hunger, who works in San Diego with 1- and 2-year-old children, many of whom also use adaptive devices that help them communicate, began teaching Stella words when the canine was about 8 weeks old. The 50-pound dog now knows at least 29 words and can combine up to five words to make a phrase or sentence.\n\nNote: Watch a video of this amazing feat at the link above and an CNN interview with the owner.\n\nThe civil rights leader ‘almost nobody knows about’ gets a statue in the U.S. Capitol\n\n2019-09-20, Washington Post\n\nPosted: 2019-11-19 01:10:33\n\nStanding Bear was born sometime between 1829 and 1834 in the Ponca tribe’s native lands in northern Nebraska. In 1876 ... Congress declared that the Poncas would be moved to Indian Territory in Oklahoma. More than a third of the Poncas died of starvation and disease — including Standing Bear’s sister and his beloved son. Standing Bear and his burial party evaded capture while they traveled home but were caught and detained after visiting relatives at the Omaha reservation. The man who caught them, Brig. Gen. George Crook ... was moved by Standing Bear’s reasons for leaving the Indian Territory and promised to help him. The civil rights case that resulted was called Standing Bear v. Crook. The U.S. attorney argued that Standing Bear was neither a citizen nor a person. On the second day, Chief Standing Bear was called to testify, becoming the first Native American to do so. He raised his right hand and, through an interpreter, said: “My hand is not the color of yours, but if I pierce it, I shall feel pain. If you pierce your hand, you also feel pain. The blood that will flow from mine will be the same color as yours. The same god made us both. I am a man.” The judge agreed, ruling for the first time in U.S. history that “the Indian is a ‘person’ ” and has all the rights and freedoms promised in the Constitution. The judge also ordered Crook to free Standing Bear and his people immediately. Standing Bear ... buried his son alongside his ancestors. When he died there in 1908, he was buried alongside them, too.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nThe Netherlands is paying people to cycle\n\n2018-12-21, CNN News\n\nPosted: 2019-11-19 01:08:56\n\nWith 17 million residents and 23 million bicycles, the Netherlands already has more bikes than people. Now, it wants to get even more cyclists on the roads - and will pay people to do it. The Dutch government recently announced that it will invest $390 million (€345 million) in cycling infrastructure to get 200,000 more people commuting by bike in three years' time. Fifteen routes will be developed into \"cyclist freeways\" (highways that cater to those on bikes), 25,000 bike parking spaces will be created and more than 60 bike storage facilities will be upgraded, according to the Ministry of Infrastructure and Water Management. \"My ambition is to ensure that people can easily get to work or school, or visit family and friends,\" says Stientje van Veldhoven, state secretary for that department, who is spearheading the project. To get people to ditch their cars, money is being laid on the table. The Netherlands currently rewards commuting cyclists with tax credits of $0.22 (€0.19) per kilometer. Companies and employees would agree on the distance of a person's cycling route. However, this is currently a little-known benefit not supported by many employers, according to the infrastructure ministry. That's something the government is hoping to change by better promoting the scheme and getting more companies on board. There are already 11 major employers in the Netherlands committing to measures such as financing employees' bikes.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nSuicide Has Been Deadlier Than Combat for the Military\n\n2019-11-01, New York Times\n\nPosted: 2019-11-12 00:57:09\n\nSuicide rates for active-duty service members and veterans are rising, in part, experts say, because a culture of toughness and self-sufficiency may discourage service members in distress from getting the assistance they need. In some cases, the military services discharge those who seek help, an even worse outcome. More than 45,000 veterans and active-duty service members have killed themselves in the past six years. That is more than 20 deaths a day — in other words, more suicides each year than the total American military deaths in Afghanistan and Iraq. The latest Pentagon figures show the suicide rate for active-duty troops across all service branches rose by over a third in five years, to 24.8 per 100,000 active-duty members in 2018. Those most at risk have been enlisted men under 30. The data for veterans is also alarming. In 2016, veterans were one and a half times more likely to kill themselves than people who hadn’t served in the military, according to the House Committee on Oversight and Reform. Among those ages 18 to 34, the rate went up nearly 80 percent from 2005 to 2016. The risk nearly doubles in the first year after a veteran leaves active duty, experts say. The Pentagon this year also reported on military families, estimating that in 2017 there were 186 suicide deaths among military spouses and dependents. Military officials note that the suicide rates for service members and veterans are comparable to the general population after adjusting for the military’s demographics — predominantly young and male.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on military corruption and health from reliable major media sources.\n\nABC Killed Jeffrey Epstein Sex Trafficking Story Three Years Ago, News Anchor Amy Robach Caught on Camera Saying\n\n2019-11-05, Newsweek\n\nPosted: 2019-11-12 00:52:28\n\nABC News' Amy Robach, best known as co-anchor of 20/20, claimed that ABC killed her story about convicted pedophile Jeffrey Epstein's sex trafficking of minors three years ago in sensational hot microphone footage leaked Tuesday. In the footage, reportedly taken in August and published online Tuesday by the right-wing activist group Project Veritas, Robach, 46, says: \"I've had this story for three years. I've had this interview with [Epstein accuser] Virginia Roberts. We would not put it on the air. First of all I was told, 'Who is Jeffrey Epstein? No one knows who that is. This is a stupid story.'\" \"Then the palace found out we had her whole allegations about Prince Andrew and threatened us in a million different ways,\" Robach continues, referring to the British royal that Roberts alleged in a 2015 court filing Epstein trafficked her to when she was 17. \"[Roberts] told me everything,\" Robach says in the clip. \"She had pictures. She had everything. She was in hiding for 12 years. We convinced her to come out. We convinced her to talk to us. It was unbelievable what we had. Clinton. Everything.\" Epstein was arrested on federal charges of sex trafficking of minors and conspiracy to sex traffic minors in July. He was found dead in his New York prison cell in August. Epstein's death has been ruled suicide by hanging, however, Epstein's family believe he was murdered. A private pathologist hired by the Epstein estate said last week that Epstein's autopsy showed injuries more consistent with \"homicidal strangulation\" than suicide.\n\nNote: Watch the incredible interview of this revelation. For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein from reliable major media sources.\n\nThe fight to stop Nestlé from taking America's water to sell in plastic bottles\n\n2019-10-29, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-11-12 00:50:03\n\nThe network of clear streams comprising California’s Strawberry Creek run down the side of a steep, rocky mountain in a national forest two hours east of Los Angeles. Last year Nestlé siphoned 45m gallons of pristine spring water from the creek and bottled it under the Arrowhead Water label. Though it’s on federal land, the Swiss bottled water giant paid the US Forest Service and state practically nothing, and it profited handsomely: Nestlé Waters’ 2018 worldwide sales exceeded $7.8bn. Conservationists say some creek beds in the area are now bone dry and once-gushing springs have been reduced to mere trickles. The Forest Service recently determined Nestlé’s activities left Strawberry Creek “impaired” while “the current water extraction is drying up surface water resources”. Still, a year later, the Forest Service approved a new five-year permit that allows Nestlé to continue using federal land to extract water, a decision critics say defies common sense. At the national level, former agriculture secretary Ann Veneman serves on Nestlé’s board. Former Forest Service special uses leader Gary Earney administered Nestlé’s water permit between 1984 and 2007 and is now one of its most vocal critics. During that time, he witnessed “devastating” Forest Service budget cuts that made it impossible to monitor Nestle’s activities or properly manage the forest. Former San Bernardino national forest supervisor Gene Zimmerman ... left the agency in 2006 to work as a contractor for Nestlé.\n\nNote: Nestlé is one of the companies pushing to transform fresh water into a Wall Street commodity. For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption from reliable major media sources.\n\nFDA approves ketamine-like nasal spray for depression\n\n2019-03-06, CNN News\n\nPosted: 2019-11-12 00:48:15\n\nThe US Food and Drug Administration approved Janssen Pharmaceuticals Inc.'s esketamine on Tuesday for treatment-resistant depression; the drug is the chemical cousin of ketamine, the powerful anesthetic that has been used illegally as the club drug Special K. It will be sold as Spravato. It's for patients who have tried at least two other medications without success, and it should be taken with an oral antidepressant. \"There has been a longstanding need for additional effective treatments for treatment-resistant depression, a serious and life-threatening condition,\" Dr. Tiffany Farchione, acting director of the Division of Psychiatry Products at the FDA's Center for Drug Evaluation and Research, said. Spravato is a nasal spray administered by an approved health care provider in a doctor's office or a medical clinic. It may also be self-administered but only under the supervision of a care provider and cannot be taken home. Depending on the severity of the patient's depression, it is given either once a week or once every other week. The drug is rapidly acting, so it starts working faster than other antidepressants, according to Janssen. It works by restoring brain cells in patients with treatment-resistant depression. Currently available treatments for major depression are ineffective in 30% to 40% of patients. The drug was designated as a breakthrough therapy in 2013, a status intended to \"expedite the development and review of drugs for serious or life-threatening conditions,\" the FDA said at the time.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on mind-altering drugs from reliable major media sources.\n\nCIA-trained Afghan forces behind war atrocities\n\n2019-10-31, NBC/Associated Press\n\nPosted: 2019-11-12 00:45:39\n\nHeavily armed men burst into the home in the middle of night, hustling four brothers into separate rooms. Afghan special forces then shot them in the head and heart. The operation, the CIA-trained Afghan unit said, targeted the Islamic State group's militants in a remote region of eastern Nangarhar Province. In reality, the raid took place in the province's capital of Jalalabad. The truth of their deaths was eventually revealed by local and international media and the country's intelligence chief, Masoom Stanikzai, was forced to resign. But that's not enough, says Human Rights Watch in a new report released Thursday documenting what it says are mounting atrocities by U.S.-backed Afghan special forces and rising civilian deaths by both American and Afghan forces. It calls for an investigation into whether the U.S. has committed war crimes in Afghanistan. The report says U.S.-led peace talks to end the 18-year-old war have omitted addressing the future of the Afghan special forces that work \"as part of the covert operations of the Central Intelligence Agency.\" The report suggests either disbanding them or bringing them under the control of the Defense Ministry. \"These troops include Afghan strike forces who have been responsible for extrajudicial executions and enforced disappearances, indiscriminate airstrikes, attacks on medical facilities, and other violations of international humanitarian law, or the laws of war,\" it says.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on war and intelligence agency corruption from reliable major media sources.\n\nMasters of war: architects of modern conflicts\n\n2019-10-23, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-11-12 00:43:52\n\nIf the horsemen of the apocalypse ever hung up their riding boots, this could be a photo of the retirement party. Five men and a woman of very different backgrounds and different continents, brought together by an investment bank and shared history of mayhem. The smiles and hand-holding in the group photo at the JP Morgan International Council in New Delhi are redolent of fond memories. The dean of the bunch is ... Henry Kissinger, the 96-year-old living embodiment of cold war realpolitik with a wealth of foreign policy knowledge and major wars to his name, including the undeclared, illegal mass bombing of Cambodia. Standing in the rear are three of the leading minds behind the 2003 Iraq invasion. Tony Blair is at the left, next to Condoleezza Rice, who was George Bush’s national security adviser at the time. Over to their right is John Howard who, as Australian leader at the time, sent his country’s troops into the fray. The latter-day crusade in pursuit of Saddam Hussein’s non-existent weapons of mass destruction was one of the most disastrous mistakes in history. In among the trio is Robert Gates, former CIA director and defence secretary, who sat the Iraq war out but as deputy director of the CIA did advocate a bombing campaign against Nicaragua. At the centre and focal point of the little group is its newest member, Narendra Modi. The Indian prime minister ... may be being inducted early for moving troops into Kashmir, revoking its autonomous status and rounding up Muslims, even at the risk of nuclear war with Pakistan.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on war from reliable major media sources.\n\nTrump says he could send US military into Mexico to ‘wage war’ on drug cartels\n\n2019-11-05, The Independent (One of the UK's leading newspapers)\n\nPosted: 2019-11-12 00:41:52\n\nDonald Trump has suggested sending the US Army over the border into Mexico to “wage war” on drug cartels in a typically bombastic tweet. The US president said his country stood “ready, willing & able to get involved and do the job quickly and effectively” if his Mexican counterpart, Andres Manuel Lopez Obrador, asked him for help. Mr Lopez Obrador declined the offer during a press conference on Tuesday. Mr Trump’s suggestion came after an American family was slaughtered by gunmen during an ambush in Mexico’s Sonora state. The family had been traveling in a convoy of SUVs. Mr Trump has long used the threat of violent crime within Mexico for political ends, blaming the US neighbour for “sending” rapists and murderers north over their shared frontier. The rhetoric has underpinned his stringent migration policies and border strategy.​ In a press conference on Tuesday, Mr Lopez Obrador said: “I haven’t seen the message from President Trump, but I am sure that it comes from a desire to help, to cooperate, that it has not been disrespectful nor interfering. Every time we speak, it is with that desire to help, and the government respects that greatly. We are very grateful to President Trump – to any foreign government which wants to help – but in these cases we have to act independently and according to our constitution, and in line with our tradition of independence and sovereignty.” He did not want to see a war break out, he said. “War is synonymous with irrationality. We are for peace.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\n50 Years Ago, Sugar Industry Quietly Paid Scientists To Point Blame At Fat\n\n2016-09-13, NPR\n\nPosted: 2019-11-12 00:38:08\n\nIn the 1960s, the sugar industry funded research that downplayed the risks of sugar and highlighted the hazards of fat, according to a newly published article in JAMA Internal Medicine. The article draws on internal documents to show that an industry group called the Sugar Research Foundation wanted to \"refute\" concerns about sugar's possible role in heart disease. The SRF then sponsored research by Harvard scientists that did just that. The result was published in the New England Journal of Medicine in 1967, with no disclosure of the sugar industry funding. There's no evidence that the SRF directly edited the manuscript published by the Harvard scientists in 1967, but there is \"circumstantial\" evidence that the interests of the sugar lobby shaped the conclusions of the review, the researchers say. The documents in question are five decades old, but the larger issue is of the moment, as Marion Nestle notes in a commentary in the same issue of JAMA Internal Medicine: \"Is it really true that food companies deliberately set out to manipulate research in their favor? Yes, it is, and the practice continues. In 2015, the New York Times obtained emails revealing Coca-Cola's cozy relationships with sponsored researchers who were conducting studies aimed at minimizing the effects of sugary drinks on obesity. More recently, the Associated Press obtained emails showing how a candy trade association funded and influenced studies to show that children who eat sweets have healthier body weights than those who do not.\"\n\nNote: Read more on the sugar industry's manipulation of science. For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\nThe Kindness Quotient\n\n2019-11-01, Foreign Policy\n\nPosted: 2019-11-12 00:35:42\n\nJacinda Ardern’s sudden, spectacular rise to the position of New Zealand’s prime minister in 2017 propelled her into headlines around the world. Deservedly so. In an era defined by the emergence of populist leaders who are often authoritarian, reactionary, and male, Ardern stands out as progressive, collaborative, and female. In New Zealand, Ardern’s commitment to fighting child poverty and homelessness has come as a relief after years of relentless increases in both. Whereas the world’s right-wing populists stigmatize and stereotype marginalized people, Ardern has established kindness as a key principle for government policy and has worked to promote inclusion and social cohesion. A family tax package that took effect last July is forecast to reduce the number of children living in poverty by 41 percent by 2021. She has extended her values-based approach to foreign policy as well—most dramatically by offering New Zealand as a home for 150 of the refugees currently stranded in camps run by Australia in Papua New Guinea and Nauru. Ardern has also identified climate change as the defining issue for her generation. On April 12, a little more than five months into her term, her government declared an end to new permits for oil and gas exploration in New Zealand’s waters, making it clear that the country was prepared to lead the way in this critical struggle.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nThis Could Be The Most Progressive Country On Earth\n\n2018-10-24, Huffington Post\n\nPosted: 2019-11-12 00:33:48\n\nWhen 6-year-old Eddie Writes decided the world needed a little more kindness, he did the only thing he thought would work ― he wrote to his city’s mayor and asked for help putting on an annual “Kindness Day.” Much to Eddie’s surprise, Wellington Mayor Justin Lester wrote back. On Nov. 16, New Zealand’s capital city will be holding its first Manaaki Day (manaaki being the Maori word for kindness), taking Eddie’s ideas of how to encourage and celebrate charitable acts ― “We can buy toys for children that don’t have any,” for example ― to improve the social well-being of citizens. The mayor’s support for the new holiday is part of a new wave of progressive, child-centred politics sweeping New Zealand, led by Prime Minister Jacinda Ardern, herself a new parent. Ardern was met with thunderous applause at the United Nations last month for her speech calling for kindness and cooperation from world leaders. Watched by her partner and their then 4-month-old daughter, Ardern pledged New Zealand would be “a kind and equitable nation where children thrive, and success is measured not only by the nation’s GDP but by better lives lived by its people.” Ardern also has her sights on New Zealand’s growing housing affordability problems. The country’s housing market is heated, with home prices rising more than 60 percent in a decade. Ardern blamed speculation from overseas buyers. The government responded with a law that took effect Monday banning foreign buyers from purchasing existing properties.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nMicrosoft tried a 4-day workweek in Japan. Productivity jumped 40%\n\n2019-11-04, CNN News\n\nPosted: 2019-11-12 00:32:02\n\nA growing number of smaller companies are adopting a four-day workweek. Now the results of a recent trial at Microsoft (MSFT) suggest it could work even for the biggest businesses. The company introduced a program this summer in Japan called the \"Work Life Choice Challenge,\" which shut down its offices every Friday in August and gave all employees an extra day off each week. The results were promising: While the amount of time spent at work was cut dramatically, productivity — measured by sales per employee — went up by almost 40% compared to the same period the previous year, the company said in a statement. In addition to reducing working hours, managers urged staff to cut down on the time they spent in meetings and responding to emails. They suggested that meetings should last no longer than 30 minutes. Employees were also encouraged to cut down on meetings altogether by using an online messaging app. The effects were widespread. More than 90% of Microsoft's 2,280 employees in Japan later said they were impacted by the new measures, according to the company. By shutting down earlier each week, the company was also able to save on other resources, such as electricity. Microsoft ... says it will conduct another experiment in Japan later this year. It plans to ask employees to come up with new measures to improve work-life balance and efficiency, and will also ask other companies to join the initiative.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nCBS staffer fired over ABC’s Epstein scandal speaks out: ‘I’m not the whistleblower… the leaker is still inside’\n\n2019-11-08, Fox News\n\nPosted: 2019-11-11 21:42:10\n\nA CBS News employee, fired after ABC executives informed CBS she'd had access to a leaked hot mic video that revealed the Disney-owned network killed a Jeffrey Epstein scoop, says she did not leak the tape and was unfairly axed without being able to defend herself. Ashley Bianco was a producer on ABC’s “Good Morning America” before joining “CBS This Morning” last month. Earlier this week, the controversial group Project Veritas published the damning video in which ... anchor Amy Robach complained that her bosses killed a story that would have exposed the now-deceased child sex offender Epstein three years ago. Bianco said she was fired by CBS after the network received a call from ABC informing her new boss that she once had access to the leaked video. “I did not\" leak the tape, Bianco told journalist Megyn Kelly in an interview posted Friday on YouTube. “I’m not the whistleblower. I’m sorry to ABC, but the leaker is still inside.” CBS News declined to comment on Bianco's claim. Bianco denied ever communicating with anyone from Project Veritas and said she simply made a clip of the video and saved it in ABC's internal system. “I never heard of Project Veritas until this,” she said. Bianco, who deleted various social media accounts before speaking out, said she did not inform her manager that she clipped it, but “everyone in the office was freaked out” by Robach’s comments. “Everyone was watching it,” Bianco said, noting that the purpose for “clipping” it was to watch it back later for “office gossip.” Bianco told Kelly that she doesn’t know who leaked the tape because “everyone” at ABC was aware it existed.\n\nNote: The silence of other most major media around this huge story is deafening. Watch an interview with the fired woman. For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein from reliable major media sources.\n\nGovernment Loophole Gave Oil Companies $18 Billion Windfall\n\n2019-10-24, New York Times\n\nPosted: 2019-11-04 20:33:31\n\nThe United States government has lost billions of dollars of oil and gas revenue to fossil-fuel companies because of a loophole in a decades-old law. The loophole dates from an effort in 1995 to encourage drilling in the Gulf of Mexico by offering oil companies a temporary break from paying royalties on the oil produced. However, the rule was poorly written, the very politicians who originally championed it have acknowledged, and the temporary reprieve was accidentally made permanent on some wells. As a result, some of the biggest oil companies in the world, including Chevron, Shell, BP, Exxon Mobil and others, have avoided paying at least $18 billion in royalties on oil and gas drilled since 1996, according to a new report from the Government Accountability Office. The companies, which hold government leases to drill in the Gulf, continue to extract oil and gas from those wells while not being required to pay royalties, a right the industry has gone to court to defend. Roughly 22 percent of oil production from federal leases in the Gulf of Mexico was royalty-free in 2018 because of the loophole, the Interior Department said. The report of the windfall to oil companies comes as the Trump administration has moved to further reduce the cost of offshore drilling for the industry, proposing to significantly weaken safety rules put in place after the deadly 2010 Deepwater Horizon explosion in the Gulf of Mexico.\n\nNote: A 2013 Washington Post article suggests practices like this are common across major industries. For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nThe FBI Spends a Lot of Time Spying on Black Americans\n\n2019-10-29, The Intercept\n\nPosted: 2019-11-04 20:31:15\n\nThe FBI has come under intense criticism after a 2017 leak exposed that its counterterrorism division had invented a new, unfounded domestic terrorism category it called “black identity extremism.” A number of civil rights groups have filed public records requests to try to better understand who exactly the FBI is investigating under that designation. The latest batch of FBI documents ... reveals that between 2015 and 2018, the FBI dedicated considerable time and resources to opening a series of “assessments” into the activities of individuals and groups it mostly labeled “black separatist extremists.” This designation was eventually folded into the category of “black identity extremism.” Assessments differ from full-blown investigations - or “predicated investigations,” in the bureau’s lingo - because they do not need to be predicated on a factual basis. As a new report by the civil liberties group Defending Rights & Dissent notes, when choosing targets for an assessment, agents are allowed to use ethnicity, religion, or speech protected by the First Amendment as a factor, “as long as it is not the only one.” As the report notes, “Even though the standards for opening an assessment are extraordinarily low, the FBI is allowed to use extremely intrusive investigative techniques in performing them, including physical surveillance, use of informants, and pretextual interviews.” The bureau has in recent years shifted its target from those espousing “separatist” views to the much larger group of those protesting police violence.\n\nNote: Read more about the FBI's use of \"Black Identity Extremism\" as a label in its terrorism investigations. For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the erosion of civil liberties from reliable major media sources.\n\nInvestigation Shows Hundreds Of Patients Dying At California Rehab Centers\n\n2019-06-25, CBS (Bay Area affiliate)\n\nPosted: 2019-11-04 20:29:13\n\nThe average 30-day stay at a California rehab costs families $40,000. It’s expensive and often highly risky. The Russells [checked] their 19-year-old son, Teddy Russell, into Mountain Vista last summer. “During intake, they had trouble with the blood pressure cuff and she said, ‘No, I have no medical training at all,’” said Anne Russell, talking about the counselor at the rehab. Mountain Vista Farm is a state licensed residential detox facility, which in California is not required to have a doctor on site. Anne Russell believes the lack of medical support drastically changed the course of her family’s life. “We trusted them to help him and our son trusted us and it was just a nightmare,” she said. Detox centers must check on patients every 30 minutes for the critical first 72 hours but that didn’t happen. Seven hours after being dropped off at Mountain Vista Farm, Teddy Russell was dead. The state has the power to suspend a rehab facility’s license after a Class A deficiency. Teddy’s death resulted in two of those. But the state didn’t shut this place down. In fact, we’ve learned it rarely shuts any rehab down. Instead the penalty in Teddy’s case was a $700 fine. Public records show Teddy’s story is not unique. 190 people have died at other rehab facilities in California since 2010. We found dozens of deficiencies, from falsifying records, failing to report deaths, and employing unqualified staff to not monitoring patient vitals, like what happened to Teddy.\n\nNote: John Oliver has a hard-hitting video on the serious problems found at many rehab centers. For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\nNBC News can’t seem to shake Ronan Farrow and the scandal he uncovered\n\n2019-10-27, Washington Post\n\nPosted: 2019-11-04 20:26:51\n\nNBC News just can’t seem to escape the talk of scandal. For weeks, the network has been rebutting allegations by a former correspondent, Ronan Farrow, that it suppressed his reporting on sexual assault allegations against movie producer Harvey Weinstein and covered up harassment and assault accusations against its former star, Matt Lauer. The story has been propelled by Farrow’s best-selling book, “Catch and Kill,” which asserts ... that NBC stopped Farrow’s reporting on Weinstein in mid-2017 after Weinstein threatened to reveal Lauer’s misconduct. Farrow published a blockbuster story about Weinstein in the New Yorker seven weeks later. In an extraordinary segment on her MSNBC show, Rachel Maddow urged NBC News to undertake an independent investigation of the network’s conduct. “The allegations about the behavior of Harvey Weinstein and Matt Lauer are gut-wrenching,” said Maddow, MSNBC’s biggest star and the second, after MSNBC host Chris Hayes, to call out her bosses on an NBC-owned platform. Brooke Nevils [is] a “Today” show producer who in Farrow’s book accuses Lauer of raping her. Network officials deny any pattern of harassment complaints or “hush-money” settlements, and say Lauer was fired just hours after Nevils came forward with her accusation in late 2017. But NBC has resisted calls for the kind of independent investigation that other news organizations have undertaken in the wake of harassment scandals.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on sexual abuse scandals from reliable major media sources.\n\nWomen At Ernst & Young Instructed On How To Dress, Act Nicely Around Men\n\n2019-10-21, Huffington Post\n\nPosted: 2019-11-04 20:24:50\n\nWhen women speak, they shouldn’t be shrill. Clothing must flatter, but short skirts are a no-no. After all, “sexuality scrambles the mind.” Women should look healthy and fit, with a “good haircut” and “manicured nails.” These were just a few pieces of advice that around 30 female executives at Ernst & Young received at a training held in the accounting giant’s gleaming new office in Hoboken, New Jersey, in June 2018. The 55-page presentation, used during the day-and-a-half seminar on leadership and empowerment, was given to HuffPost by an attendee who was appalled by its contents. Full of out-of-touch advice, the presentation focused on how women need to fix themselves to fit into a male-dominated workplace. The training, called Power-Presence-Purpose or PPP ... was billed to participants as advice on how to be successful at EY, according to Jane, a training attendee and former executive director at the firm. Attendees were even told that women’s brains are 6% to 11% smaller than men’s, Jane said. She wasn’t sure why they were told this, nor is it clear from the presentation. Women’s brains absorb information like pancakes soak up syrup so it’s hard for them to focus, the attendees were told. Men’s brains are more like waffles. They’re better able to focus because the information collects in each little waffle square. The only reason to talk to women about their size of their brains is to make them feel inferior to men, said Bruce McEwen, a neuroscientist at Rockefeller University.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption from reliable major media sources.\n\nGeneral Motors Sides With Trump in Emissions Fight, Splitting the Industry\n\n2019-10-28, New York Times\n\nPosted: 2019-11-04 20:23:03\n\nGeneral Motors, Fiat Chrysler and Toyota said Monday they were intervening on the side of the Trump administration in an escalating battle with California over fuel economy standards for automobiles. Their decision pits them against leading competitors, including Honda and Ford, who this year reached a deal to follow California’s stricter rules. The Trump administration has proposed a major weakening of federal auto emissions standards set during the Obama administration, prompting California to declare that it will go its own course and keep enforcing the earlier, stricter standards. The automakers siding with the administration, led by the industry group the Association of Global Automakers, say that the federal government, not California, has the ultimate authority to set fuel economy standards. The legal fight between the Trump administration and California over auto pollution rules has swelled into a battle over states’ rights and climate change that is likely to only be resolved once it reaches the Supreme Court. The Obama-era national fuel economy standard requires automakers to build vehicles that achieve an average fuel economy of 54.5 miles per gallon by 2025, which would eliminate about six billion tons of carbon dioxide pollution over the lifetime of those vehicles. The Trump administration is planning to roll back the fuel-economy standard to about 37 miles per gallon. Nearly two dozen other states have filed suit against the Trump administration, alongside California, over the emissions rules.\n\nNote: This is proof that the mileage our cars get is not determined by market forces, but rather by government regulation. Average mileage has risen consistently with regulation, not with innovation. For lots more on this, see this webpage. For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nLies, Damned Lies, and Medical Science\n\n2010-11-01, The Atlantic\n\nPosted: 2019-11-04 20:20:40\n\nCan any medical-research studies be trusted? That question has been central to [Dr. John] Ioannidis’s career. He’s what’s known as a meta-researcher, and he’s become one of the world’s foremost experts on the credibility of medical research. He zoomed in on 49 of the most highly regarded research findings in medicine over the previous 13 years, as judged by the science community’s two standard measures: the papers had appeared in the journals most widely cited in research articles, and the 49 articles themselves were the most widely cited articles in these journals. Of the 49 articles, 45 claimed to have uncovered effective interventions. Thirty-four of these claims had been retested, and 14 of these, or 41 percent, had been convincingly shown to be wrong or significantly exaggerated. If between a third and a half of the most acclaimed research in medicine was proving untrustworthy, the scope and impact of the problem were undeniable. “Even when the evidence shows that a particular research idea is wrong, if you have thousands of scientists who have invested their careers in it, they’ll continue to publish papers on it,” he says. “It’s like an epidemic, in the sense that they’re infected with these wrong ideas, and they’re spreading it to other researchers through journals.” Of those 45 super-cited studies that Ioannidis focused on, 11 had never been retested. Perhaps worse, Ioannidis found that even when a research error is outed, it typically persists for years or even decades.\n\nNote: For more along these lines, read the revealing comments of Marcia Angell, former editor-in-chief of the New England Journal of Medicine, on the massive corruption she found in the medical industry. For more, see concise summaries of deeply revealing news articles on corruption in science from reliable major media sources.\n\nToo Many Men\n\n2018-04-18, Washington Post\n\nPosted: 2019-11-04 20:18:48\n\nA combination of cultural preferences, government decree and modern medical technology in the world’s two largest countries has created a gender imbalance on a continental scale. Men outnumber women by 70 million in China and India. The consequences of having too many men, now coming of age, are far-reaching: Beyond an epidemic of loneliness, the imbalance distorts labor markets, drives up savings rates in China and drives down consumption, artificially inflates certain property values, and parallels increases in violent crime, trafficking or prostitution in a growing number of locations. Among men, loneliness and depression are widespread. Villages are emptying out. Men are learning to cook and perform other chores long relegated to women. Bachelors are furiously building houses in China to attract wives, and prices are soaring. But otherwise they are not spending, and that in turn fuels China’s huge trade surplus. In India, there is the opposite effect: Because brides are scarce, families are under less pressure to save for expensive dowries. Trafficking of brides is on the rise. Foreign women are being recruited and lured to China, effectively creating similar imbalances in China’s neighbors. With the increase in men has come a surge in sexual crime in India and concerns about a rise in other crimes in both countries. Harassment of schoolgirls in India has in some towns sparked an effort to push back — but at a cost of restricting them to more protected lives.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles from reliable major media sources.\n\nOnce he was a refugee. Now he’s a CEO making video games for peace.\n\n2019-10-14, Washington Post\n\nPosted: 2019-11-04 20:16:08\n\nLual Mayen sits in a modern office space, set in a trendy Washington, D.C., neighborhood. As a newborn in his parents’ arms, Mayen endured a 225-mile trek from his war-torn home in South Sudan to a refugee camp in Northern Uganda. Mayen was born into war, but his mission is peace. Now 24 years old, he is a video game developer residing in the United States, leading his own company and using the experiences from his past to inform his products: games aimed at peace-building and conflict resolution. He created the first version of Salaam, which means “peace” in Arabic, while still living as a refugee. In the game’s new version, players adopt the role of a refugee who must flee falling bombs, find water and gain energy points to ensure the character’s survival as the player’s country journeys from a war-torn present into a peaceful existence. If the player’s character runs out of energy, the player is prompted to purchase more food, water, and medicine for their character with real-world money. The funds go beyond the game to benefit a living refugee through Junub’s partnerships with various NGOs. Mayen is aiming to have Salaam ready to launch in December, determined to grow the category of social impact gaming to give back to his community. “Peace is something that is built over time,” Mayen said. “It’s not about people coming together and signing cease-fires and so on. It’s a generation of change. It’s a change of mindset. It’s a change of attitude toward each other.\"\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nThe Country Winning The Battle On Food Waste\n\n2019-04-08, Huffington Post\n\nPosted: 2019-11-04 20:14:30\n\nChung Sun-hee finely crushes eggshells, dries and saves her coffee grounds, and separates large vegetable offcuts into smaller pieces. Later, the 55-year-old professional translator will bury them in her backyard, in rotating plots. Chung is one of a growing number of city dwellers who are getting into urban farming, not just to grow their own vegetables, but also as an exercise in waste reduction. Her new habits reflect a larger change underway in South Korea’s densely populated capital. Once a city where unsightly and foul-smelling landfills loomed over entire neighborhoods, Seoul now operates one of the most rigorous food waste recycling programs in the world. The South Korean government banned sending food to landfills in 2005 and, in 2013, also prohibited the dumping of garbage juice (leftover water squeezed from food waste) into the sea. Today, a staggering 95 percent of food waste is recycled ― a remarkable leap from less than 2 percent in 1995. On Chung’s street, residents emerge at dusk to deposit small yellow bags into designated waste collection buckets. Since 2013, South Koreans have been required by law to discard food waste in these biodegradable bags, priced according to volume and costing the average four-person family about $6 a month. This tax pays for roughly 60 percent of the cost of collecting and processing the city’s food waste, according to government data.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nWhy Chile’s Route of Parks will be a ‘game changer for tourism’\n\n2019-09-26, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-11-04 20:12:47\n\nThe pioneering conservationist behind the world’s most ambitious rewilding project has revealed “game-changing” plans that could transform tourism in Chilean Patagonia. After 25 years of strategic land acquisition by Kristine Tompkins and her late husband Douglas – which led to the creation last year of five new national parks in southern Chile – Tompkins said the next challenge was to encourage 60 communities across the region to develop tourism ventures that will help protect the biodiversity on their doorstep. Speaking in London at the European launch of the 1,700-mile Route of Parks, a marketing initiative encompassing 17 national parks throughout Patagonia, Tompkins said: “We want local people to have a sense of ownership and pride. They will become the first line of defence in conservation.” The launch of the route ... follows the creation of five new national parks and the expansion of three others, all in Chilean Patagonia after the Tompkins Foundation handed over a million acres to the Chilean state – the largest private donation of land ever. The handover was ... aimed at returning farmed land to its natural state and creating wildlife corridors. The Foundation also owns land in Argentina, where its flagship rewilding project is seeing species being reintroduced to the newly created Iberá national park in the north-west. In total the Tompkins’ philanthropic work amounts to $345m. To date the Foundation has helped protect 5.75 million hectares across Chile and Argentina.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nDesigner babies are on the way. We're not ready\n\n2019-08-16, CNN News\n\nPosted: 2019-10-28 22:48:51\n\nIn November, Dr. He Jiankui announced that twin girls had been born in China from embryos whose genes he had altered using CRISPR gene-editing technology. According to the magazine Science, he hoped to build a baby-designing business. In March, a World Health Organization committee argued for a moratorium on clinical human genome editing \"until its implications have been properly considered.\" But no system of global guidance exists to implement or enforce such a ban on the practice. In June, a Russian scientist declared that he plans to proceed anyway. You can imagine what bad actors with eugenic fantasies could do with this technology. But today, many parents, with the best interest of their future children in mind, choose embryos based on the genes inside. Since 1978, when the first child, Louise Brown, was born using in-vitro fertilization, this and other assisted reproductive technologies have expanded immensely, creating over a million babies. Because preimplantation genetic diagnosis allows parents to avoid transmitting mutations to children, CRISPR will unfortunately probably be used to enhance progeny with socially desired traits such as height, certain athletic abilities or intelligence. Such uses will be very profitable. Due to high costs, assisted reproductive technologies, including preimplantation genetic diagnosis, are not available to everyone and are thus altering how thousands of affluent people -- but not poorer individuals -- thrive and live.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\nWe Have No Reason to Believe 5G Is Safe\n\n2019-10-17, Scientific American\n\nPosted: 2019-10-28 22:46:47\n\nThe telecommunications industry and their experts have accused many scientists who have researched the effects of cell phone radiation of \"fear mongering\" over the advent of wireless technology's 5G. The chairman of the Federal Communications Commission (FCC) recently announced ... that the commission will soon reaffirm the radio frequency radiation (RFR) exposure limits that the FCC adopted in the late 1990s. These limits are based upon a behavioral change in rats exposed to microwave radiation and were designed to protect us from short-term heating risks due to RFR exposure. Yet, since the FCC adopted these limits based largely on research from the 1980s, the preponderance of peer-reviewed research, more than 500 studies, have found harmful biologic or health effects from exposure to RFR at intensities too low to cause significant heating. The World Health Organization's International Agency for Research on Cancer (IARC) classified RFR as \"possibly carcinogenic to humans\" in 2011. Last year, a $30 million study conducted by the U.S. National Toxicology Program (NTP) found “clear evidence” that two years of exposure to cell phone RFR increased cancer in male rats and damaged DNA in rats and mice of both sexes. The Ramazzini Institute in Italy replicated the key finding of the NTP using a different carrier frequency and much weaker exposure to cell phone radiation over the life of the rats.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the risks and dangers of wireless technologies from reliable major media sources.\n\nUN says 1st local polio case found in Zambia since 1995\n\n2019-10-23, Washington Post/Associated Press\n\nPosted: 2019-10-28 22:44:40\n\nThe World Health Organization says Zambia has reported its first local case of polio since 1995, in a 2-year-old boy paralyzed by a virus derived from the vaccine. In a report this week, WHO said the case was detected on the border with Congo, which has reported 37 cases of polio traced to the vaccine this year. The U.N. health agency said there is no established link between the Zambia case and the ongoing Congo outbreak but said increased surveillance and vaccination efforts are needed, warning that “there is a potential for international spread.” In rare cases, the live virus in oral polio vaccine can mutate into a form capable of sparking new outbreaks. Nine African countries are currently battling polio epidemics linked to the vaccine as WHO and partners struggle to keep their efforts to eradicate polio on track. Elsewhere, cases have been reported in China, Myanmar and the Philippines. On Thursday, WHO and partners are expected to announce they have rid the world of type 3 polio virus. There are three types of polio viruses. Type 2 was eliminated years ago. That now leaves only type 1. But that refers only to polio viruses in the wild. Type 2 viruses continue to cause problems since they are still contained in the oral polio vaccine and occasionally evolve into new strains responsible for some vaccine-derived outbreaks. The global effort to eradicate polio was launched in 1988 and originally aimed to wipe out the potentially fatal disease by 2000.\n\nNote: See an NPR article titled \"Mutant Strains Of Polio Vaccine Now Cause More Paralysis Than Wild Polio.\" For more along these lines, see concise summaries of deeply revealing news articles on vaccines from reliable major media sources.\n\nDeported parents may lose kids to adoption, investigation finds\n\n2018-10-09, NBC News/Associated Press\n\nPosted: 2019-10-28 22:42:37\n\nAn Associated Press investigation drawing on hundreds of court documents, immigration records and interviews in the U.S. and Central America identified holes in the system that allow state court judges to grant custody of migrant children to American families — without notifying their parents. And today, with hundreds of those mothers and fathers deported thousands of miles away, the risk has grown exponentially. More than 300 parents were deported to Central America without their children this summer, many of whom allege they were coerced into signing paperwork they didn't understand, affecting their rights to reunify with their children. Some parents also contended that U.S. officials told them their children would be given up for adoption. \"And the reality is that for every parent who is not located, there will be a permanent orphaned child, and that is 100 percent the responsibility of the administration,\" U.S. District Judge Dana Sabraw said in August while overseeing a lawsuit to stop family separations. The AP asked the State Department, as well as embassy officials in El Salvador, Guatemala and Honduras, whether they were working with deported parents to find their children in the U.S.. The State Department deferred to the Department of Homeland Security, which said in a statement: \"DHS is not aware of anyone contacting embassy or consulate in a foreign country to be reunified with a child. This is unsurprising given the fact that these parents made a knowing decision to leave their child in a foreign country.\"\n\nNote: This would seem to amount to child trafficking by the U.S. government. For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\nArizona official accused of human smuggling via a Marshall Islands adoption scheme\n\n2019-10-09, CNN News\n\nPosted: 2019-10-28 22:40:58\n\nAn Arizona county assessor is accused of human smuggling as part of a scheme that involved more than 40 pregnant women from the Marshall Islands brought to the United States to give up their babies for adoption, federal prosecutors said Wednesday. Paul D. Petersen, an adoption lawyer licensed in Utah and Arizona and elected Maricopa County assessor, was arrested Tuesday night in Arizona. He faces 11 felony counts in Utah, including human smuggling, sale of a child and communications fraud. He also faces fraud, conspiracy, theft and forgery charges in Arizona. Petersen's illegal adoption scheme allegedly involved the recruitment, transportation and payments to dozens of pregnant women from the islands in the central Pacific. Arizona Attorney General Mark Brnovich said in a statement that Petersen allegedly falsified information to place the Marshallese women on state-funded health care to cover delivery costs. The Arizona scheme bilked the state out of more than $814,000, the statement said. After the adoptions, the women either moved to Arkansas or returned to the Marshall Islands. In Utah, according to court documents, Petersen is accused of running an enterprise to transport pregnant Marshallese women to the state for adoptions. Each woman was allegedly offered $10,000 \"to induce them to place their children up for adoption in Utah,\" the documents said. A memorandum of understanding sent to one adoptive family by Petersen listed a fee of $35,000.\n\nNote: Could it be that these children are being used for nefarious purposes? This excellent video report suggests that two politicians may have been killed for trying to reveal illegal child trafficking in government.\n\nMark Zuckerberg's plea for the billionaire class is deeply anti-democratic\n\n2019-10-21, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2019-10-28 22:38:42\n\nHitting back against presidential candidate Bernie Sanders’s assertion that billionaires should not exist – and his calls to tax their wealth at much higher rates – Facebook CEO Mark Zuckerberg, worth $70bn, took to Fox News to defend his beleaguered class. Billionaires, he argued, should not exist in a “cosmic sense,” but in reality most of them are simply “people who do really good things and kind of help a lot of other people. And you get well compensated for that.” He warned too about the dangers of ceding too much control over their wealth to the government, allegedly bound to stifle innovation and competition. Zuckerberg’s reasoning isn’t unique among the 1%. As common as this argument is, it also happens not to be true. Take the basis of Mark Zuckerberg’s fortune. The internet was developed out of a small Pentagon network intended to allow the military to exchange information during the Cold War. And of the top 88 innovations rated by R & D Magazine as the most important between 1971 and 2006, economists Fred Block and Matthew Keller have found that 77 were the beneficiaries of substantial federal research funding, particularly in early stage development. This isn’t all to say that the private sector hasn’t played a significant role in driving innovation. But the the fortunes built off of each couldn’t exist were it not for the government more often than not taking the first step, funding innovation far riskier than venture capitalists and angel investors can usually stomach.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on income inequality from reliable major media sources.\n\nNot in front of the telly: Warning over 'listening' TV\n\n2015-02-09, BBC News\n\nPosted: 2019-10-28 22:35:59\n\nSamsung is warning customers about discussing personal information in front of their smart television set. The warning applies to TV viewers who control their Samsung Smart TV using its voice activation feature. When the feature is active, such TV sets \"listen\" to what is said and may share what they hear with Samsung or third parties, it said. Privacy campaigners said the technology smacked of the telescreens, in George Orwell's 1984, which spied on citizens. The warning came to light via a story in ... the Daily Beast which published an excerpt of a section of Samsung's privacy policy for its net-connected Smart TV sets. These record what is said when a button on a remote control is pressed. The policy explains that the TV set will be listening to people in the same room to try to spot when commands or queries are issued via the remote. It goes on to say: \"If your spoken words include personal or other sensitive information, that information will be among the data captured and transmitted to a third party.\" Corynne McSherry, an intellectual property lawyer for the Electronic Frontier Foundation, [said] that the third party was probably the company providing speech-to-text conversion for Samsung. She added: \"If I were the customer, I might like to know who that third party was, and I'd definitely like to know whether my words were being transmitted in a secure form.\" The third party handling the translation from speech to text is a firm called Nuance, which specialises in voice recognition, Samsung has confirmed to the BBC.\n\nNote: Read more about Samsung's privacy issues in this 2013 Houston Chronicle article. For more along these lines, see concise summaries of deeply revealing news articles on the disappearance of privacy from reliable major media sources.\n\nGlobal antibiotic overuse is like a ‘slow motion train wreck’\n\n2018-03-28, PBS\n\nPosted: 2019-10-28 22:33:00\n\nAntibiotic resistance contributes to the death of 700,000 people around the world each year. Experts have predicted it will eclipse the number of people affected by cancer by 2050. One of the biggest causes is the overuse of antibiotics. On Monday, a group led by researchers from the Center for Disease Dynamics, Economics and Policies released a new study looking at the global consumption of antibiotics. They found the use of antibiotics worldwide has increased 65 percent from 2000 to 2015. What happens is, antibiotics kill bacteria that make us sick. But the bacteria over time evolve and develop an ability to survive the onslaught of the antibiotics. They, in essence, get smart. So, over time, bacteria survive that have resistance built in. The biggest contributor to this problem is in low- to mid-income countries. Back in 2000, the usage of antibiotics in the lower- to mid-income countries vs. high-income countries was about equal. In 2015, the usage in those low- to mid-income countries doubled. The projections are, by 2030, our use of antibiotics, if nothing changes, will be triple what it is today. And what that means is, there are going to be many more antibiotics which become really just basically useless, more so-called superbugs out there. And we are facing the prospect of a post-antibiotic world. We could get back to a world ... where something as simple as a cut or a blister could kill you, which is what the world was like before we had antibiotics.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\nThinking About Having a ‘Green’ Funeral? Here’s What to Know\n\n2018-03-22, New York Times\n\nPosted: 2019-10-28 22:31:26\n\nA typical American funeral usually involves a few hallmarks we’ve come to expect: an expensive coffin, lots of flowers, an embalming for the deceased and a number of other add-ons. But how necessary are those embellishments? Enter the “green burial.” The specifics of a green burial vary widely, but typically they require far fewer resources for the care of the body and skip a number of the traditional steps, making them better for the environment. Plus, they can save families on funeral costs. Interest in these pared-down, eco-friendly options has grown as people look for ways to cut their carbon footprint. 72 percent of cemeteries are reporting an increased demand. The Green Burial Council’s steps for minimizing negative environmental effects include forgoing embalming, skipping concrete vaults, rethinking burial containers and maintaining and protecting natural habitat. Choices can be made at each step of the death care process to limit waste, reduce the carbon footprint and even nourish the local ecosystem. Embalming, vaults and coffins can be expensive. Replacing them with other options or scrapping them altogether can save money as well as the environment. The extent of how “green” a burial can be is up to the individual; the service can be as simple as wrapping the deceased in a cotton shroud before lowering them into the ground. The services can also [involve] a memorial ceremony and burial in a conservation park like Washington’s Greenacres.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nHow Kenya Got To Be No. 3 On A Survey Of Most Generous Nations\n\n2017-11-27, NPR\n\nPosted: 2019-10-28 22:29:01\n\nEach year, the Charities Aid Foundation (CAF) compiles a World Giving Index, and the 2017 rankings list Kenya as the third most generous nation behind Myanmar and Indonesia. The rankings are based on three data points from Gallup's World Poll: the percent of respondents who have donated, volunteered and helped a stranger in the previous month. Overall, the survey found that global giving was down, led by a decline in developed countries. The United States dropped from 2nd to 5th but still gives the largest percentage of its gross domestic product — 2.1 percent. But as reflected by Kenya's rise from 40th five years ago to number 3, there is a bright spot in the new rankings. And it's not just a Kenyan trend. \"The big ", "images": ["https://www.wanttoknow.info/m/images/header-mission.png", "https://www.wanttoknow.info/m/images/header-logo.png", "https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif", "https://www.wanttoknow.info/images/rss.gif", "https://www.WantToKnow.info/images/news-magnify.jpg"], "top_img": "https://www.WantToKnow.info/images/news-magnify.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "News Stories", "meta_data": {"description": "News stories: Excerpts from highly revealing major media news stories suggest major cover-ups of health, energy, media, 9/11, war, elections, and more. Links to original stories provided for easy verification.", "keywords": "news,articles,9/11,911,elections,energy,inventions,financial,global,warming,government,health,mass,media,,information,polls,able,danger,avian,flu,corporate,corruption,dolphins,whales,hurricane,katrina,income,inequality,inspirational,microchips,mind,control,nature,reality,non-lethal,nonlethal,privacy,secrecy,secret,societies,terrorism,ufos,vaccines,war", "viewport": "width=device-width, initial-scale=1", "ROBOTS": "INDEX,FOLLOW", "Revisit-after": "21 days", "rating": "general", "google-site-verification": "93poa4ULbuO4k4m5pcOzlCUyZF-QR_CMpiv-eFUo8sw"}, "movies": [], "publish_date": null, "source": "https://www.wanttoknow.info", "summary": ""}