{"url": "http://www.newslocker.com/en-us/news/celebrity/the-beckhams-the-wilsons-amp-more-celeb-couples-who-do-charity-work-together/", "text": "Taylor Swift Talks the Importance of 'Ownership Over What You Do' as She Covers British Vogue Taylor Swift is involved in every aspect of her music — and she realizes how important that has been to her success.\n\nIn an interview with Andrew Lloyd Webber for British Vogue‘s January issue, the 29-year-old pop powerhouse opens up about how her career to date, spanning over a decade, has been partly shaped by her dedication to her work behind the scenes.\n\n“I thinkis really important — also from the side of ownership over what you do and make,” says Swift who, Read more\n\nLaverne Cox on Her Hair Journey and Feeling Beautiful at Age 47 She’s an acclaimed actress, an LGBTQ+ trailblazer in Hollywood, and now, as the new brand ambassador of leading haircare brand Matrix Total Results, Laverne Cox is ready to take on the beauty industry.\n\nSpeaking with PEOPLE after announcing the partnership, the Emmy Award-winning actress gets candid about everything from maintaining her natural curls and experimenting with wigs, to feeling confident and content at age 47.\n\n“I love Matrix’s ‘Live Your Color’ campa Read more\n\nEva Longoria Shares Adorable New Photo of Her Son Santiago: 'Sunday Mood' Eva Longoria‘s son Santiago “Santi” Enrique Bastón has reached maximum cuteness, with the help of a cuddly stuffed panda bear.\n\nThe actress, 44, shared a snapshot of her 17-month-old, dressed in an all-white onesie, laying on the floor while curled-up with a plush panda.\n\n“Sunday Mood ,” Longoria captioned the sweet post.\n\nInside what appears to be a playroom stocked other fluffy animals and another giant panda, the toddler glances upward past the camera lens fo Read more\n\nWill & Grace Star Shelley Morrison Dies at 83 Shelley Morrison, best known for her longtime role in Will & Grace, has died. She was 83.\n\nMorrison died on Sunday at Cedars-Sinai Medical Center in Los Angeles from heart failure after a brief illness, her publicist Lori DeWaal confirmed to PEOPLE. The Associated Press was the first to report the news of the star’s death.\n\nFor eight seasons, from 1999-2006, Morrison was in 68 episodes, starring opposite Megan Mullally’s Karen Walker as her longtime maid and confidant, Rosario Sala Read more\n\nRHOA's Kenya Moore Says Co-Sleeping with Infant Daughter Led to Intimacy Problems with Husband Kenya Moore is further opening up about the intimacy issues she and her now-estranged husband Marc Daly were going through before their split.\n\nOn Sunday’s Real Housewives of Atlanta, the former Miss USA, 48, confided in friend Porsha Williams about her marital problems, admitting that co-sleeping with their infant daughter Brooklyn Doris, now 1, had put a strain on their sex life.\n\n“The baby has changed so much in our lives,” Moore said. “She’s in the bed all th Read more\n\nPete Davidson Requires Fans to Sign $1 Million NDA Before His Comedy Shows: Reports If you want to see Pete Davidson perform, you may have to be willing to sign a $1 million nondisclosure agreement.\n\nOver the weekend, the comedian, 26, reportedly required audience members to sign an NDA before his Nov. 27 show at the Sydney Goldstein Theater in San Francisco.\n\nStacy Young, who had purchased a ticket for the performance, shared a copy of the NDA on a Facebook post for the event, saying that she was first notified about the agreement on the day of the show.\n\nThe NDA notes that &ldqu Read more\n\nCarly Steel Is Engaged! See the TV Host's Proposal Photos in Front of the Eiffel Tower Wedding bells are in the air for Carly Steel!\n\nThe TV host, 32, and her fiancé Jacob Andreou recently got engaged in Paris, PEOPLE confirms exclusively.\n\nAndreou, the Vice President of Product at Snapchat, got down on one knee to propose to his beloved in front of a gorgeous view of the Eiffel Tower.\n\nRELATED: The Most Jaw-Dropping Celebrity Engagement Rings\n\nAs the iconic tower twinkled in the City of Love, Andreou slipped the diamond engagement ring on Steel’s finger. After she said y Read more\n\nLenny Kravitz Celebrates Zoë Kravitz's Birthday with Sweet Father-Daughter Throwback Photo Lenny Kravitz is sending love to his daughter Zoë Kravitz in honor of her 31st birthday.\n\nOn Sunday, the “Here to Love” singer, 55, shared a sweet throwback photo of himself holding his daughter closely in his arms when she was young.\n\n“Another year of dancing through this life with you my love,” Lenny wrote. “The best is yet to come.”\n\nIn June, the Big Little Lies star married actor Karl Glusman at her father’s home in France. Zoë&rsquo Read more\n\nSarah Hyland Says Her Cousin Will 'Forever Be in Our Hearts' on Anniversary of His Death Sarah Hyland is honoring her cousin on the one-year anniversary of his death.\n\nOn Sunday, the Modern Family actress, 29, paid tribute to Trevor Canaday, who died at age 14 after a drunk driver ran through a red light at an intersection and caused a collision last December.\n\n“Thinking about my family today. Exactly one year ago my little cousin was killed by a drunk driver,” Hyland wrote on her Instagram Story. “A senseless and reckless act took away a beautiful so Read more\n\nThe Bachelorette's Jed Wyatt Goes Instagram Official with New Girlfriend Ellen Decker Jed Wyatt has moved on.\n\nThe Bachelorette winner, who split from Hannah Brown after it was revealed that he had a girlfriend when he went on the show, revealed in a Thanksgiving Instagram post that he is in a new relationship.\n\nOn Thursday, Wyatt, 25, shared a photo of himself and Ellen Decker in Miami, calling her “the only person to make me smile more than riding a jetski .” Wyatt also seemingly included a nickname for the couple — Jellen — in a hashtag.\n\nDecker Read more\n\nWhen Calls the Heart Star Andrea Brooks Welcomes Her First Child, a Baby Girl Andrea Brooks is a first-time mom!\n\nThe When Calls the Heart star announced she gave birth to a baby girl and shared a black-and-white image of herself cradling her newborn daughter.\n\n“..and then there was you. ,” Brooks, 30, captioned the sweet announcement post on Instagram Saturday.\n\nFriends and fans were quick to flood the comments with words of congratulations. Her costar Pascale Hutton, left a red heart emoji under the post, while Riverdale star Vanessa M Read more\n\nSimon Cowell's Company Breaks Silence on Gabrielle Union's AGT Firing Simon Cowell‘s company is speaking out about Gabrielle Union‘s grievances with America’s Got Talent during her one-season run on the NBC talent competition show.\n\nIn the wake of the actress’ unexpected firing from AGT, Syco Entertainment, which produces AGT,released a joint statement with NBC and production company Fremantle on Sunday. “We remain committed to ensuring a respectful workplace for all employees and take very seriously any questions about workplace Read more\n\nAnother Girl! Chanel Iman and Sterling Shepard Reveal Sex of Second Child Another baby girl is on the way for Chanel Iman and Sterling Shepard!\n\nThe pregnant model, 29, announced the sex of her second child with her NFL husband, 26, on Instagram Sunday.\n\n“Blessed with another baby girl on the way ,” Iman captioned the sweet photo of the couple dressed in white with their 15-month-old daughter Cali.\n\nOn Aug. 26, Iman revealed on Instagram that the couple was expecting their second child, writing, “Excited to announce we will be a family of four Read more\n\nKaley Cuoco Celebrates Her 'Coolest Birthday to Date' While Filming New Show in Thailand Kaley Cuoco had an extra special 34th birthday.\n\nOn Saturday, the actress and Big Bang Theory alum shared footage from her birthday celebrations to Instagram. Cuoco was surprised by the cast and crew of her upcoming drama series The Flight Attendant as they filmed in Bangkok, Thailand.\n\nIn the clip, the actress gets emotional as she’s presented with two cakes while the cast and crew sing a rendition of “Happy Birthday.”\n\n“Thank you so much,” Cuoco s Read more", "images": ["https://img.newslocker.com/2019/12/01/196224993_725.jpg", "https://img.newslocker.com/2019/12/01/196232442_725.jpg", "http://www.newslocker.com/images/share-facebook.png", "http://www.newslocker.com/images/flags/gb.png", "https://img.newslocker.com/2019/12/01/196225828_725.jpg", "http://www.newslocker.com/images/flags/es.png", "https://img.newslocker.com/2019/12/01/196226671_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/flags/pt.png", "http://www.newslocker.com/images/rss.png", "https://img.newslocker.com/2019/12/01/196230891_725.jpg", "https://img.newslocker.com/2019/12/01/196228658_725.jpg", "https://img.newslocker.com/2019/12/01/196229596_725.jpg", "http://www.newslocker.com/images/flags/fr.png", "http://www.newslocker.com/images/flags/be.png", "https://img.newslocker.com/2019/12/02/196253049_725.jpg", "https://img.newslocker.com/2019/12/01/196231265_725.jpg", "https://img.newslocker.com/2019/12/01/196232057_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2019/12/02/196234829_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "http://www.newslocker.com/images/flags/mx.png", "https://img.newslocker.com/2019/12/02/196235180_725.jpg", "https://img.newslocker.com/2019/12/01/196229894_725.jpg", "https://img.newslocker.com/2019/12/02/196252333_725.jpg", "http://www.newslocker.com/images/flags/ng.png", "https://img.newslocker.com/2019/12/02/196234011_725.jpg", "http://www.newslocker.com/images/flags/cl.png", "https://img.newslocker.com/2019/11/30/196209956_725.jpg", "http://www.newslocker.com/images/flags/cr.png", "http://www.newslocker.com/images/flags/ec.png", "https://img.newslocker.com/2019/12/02/196236094_725.jpg", "http://www.newslocker.com/images/flags/in.png", "https://img.newslocker.com/2019/11/30/196210949_725.jpg", "https://img.newslocker.com/2019/12/02/196236093_725.jpg", "http://www.newslocker.com/images/logo.jpg", "http://www.newslocker.com/images/flags/br.png", "http://www.newslocker.com/images/newslocker-cube.png", "http://www.newslocker.com/images/flags/do.png", "https://img.newslocker.com/2019/12/01/196231771_725.jpg", "http://www.newslocker.com/images/flags/co.png", "http://akns-images.eonline.com/eol_images/Entire_Site/2017319/rs_600x600-170419170459-600.Faith-Hill-Tim-McGraw-Charity.kg.041917.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/flags/ve.png", "http://www.newslocker.com/images/flags/au.png", "http://www.newslocker.com/images/flags/de.png", "https://img.newslocker.com/2019/11/30/196209771_725.jpg", "https://img.newslocker.com/2019/11/30/196210280_725.jpg", "http://www.newslocker.com/images/flags/nl.png", "https://img.newslocker.com/2019/12/02/196251587_725.jpg", "https://img.newslocker.com/2019/12/01/196211741_725.jpg", "https://img.newslocker.com/2019/12/01/196215192_725.jpg", "http://www.newslocker.com/images/flags/ar.png", "https://img.newslocker.com/2019/12/02/196251588_725.jpg", "http://www.newslocker.com/images/flags/it.png", "https://img.newslocker.com/2019/12/01/196231497_725.jpg", "http://www.newslocker.com/images/flags/us.png", "http://www.newslocker.com/images/flags/bo.png", "https://img.newslocker.com/2019/12/01/196223698_725.jpg", "http://www.newslocker.com/images/flags/ca.png", "http://www.newslocker.com/images/flags/pe.png", "https://img.newslocker.com/2019/12/02/196233185_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017319/rs_600x600-170419170459-600.Faith-Hill-Tim-McGraw-Charity.kg.041917.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com:443/en-us/news/celebrity/the-beckhams-the-wilsons-amp-more-celeb-couples-who-do-charity-work-together/", "title": "The Beckhams, The Wilsons & More Celeb Couples Who Do Charity Work Together", "meta_data": {"description": "Besides supermodel good looks, David and Victoria Beckham sound like some super parents.Last year, the famous couple cheered on their middle son as he competed in the children's race...", "og": {"title": "The Beckhams, The Wilsons & More Celeb Couples Who Do Charity Work Together - Celebrity news - NewsLocker", "description": "Besides supermodel good looks, David and Victoria Beckham sound like some super parents.Last year, the famous couple cheered on their middle son as he competed in the children's race...", "type": "website", "url": "https://www.newslocker.com:443/en-us/news/celebrity/the-beckhams-the-wilsons-amp-more-celeb-couples-who-do-charity-work-together/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017319/rs_600x600-170419170459-600.Faith-Hill-Tim-McGraw-Charity.kg.041917.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": "1335791813,560345808"}, "robots": "index", "tradetracker-site-verification": "5d3490426a1947bbfe3c56de4fa490c0ba416113", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492855200.0, "source": "http://www.newslocker.com", "summary": ""}