{"url": "https://www.pastemagazine.com/articles/2018/01/the-50-best-movies-on-hbo-go-and-hbo-now-january-2.html?p=2", "text": "25. The Tale\n\nYear: 2018\n\nDirector: Jennifer Fox\n\nJennifer Fox has just done something utterly brilliant, and you need to see it. Be prepared to feel uncomfortable, because The Tale, adapted from her narrative memoir of the same name, will do a number on your head, in the way that a particularly vivid nightmare sometimes can, whether you personally have a childhood sexual abuse story or not. This film was made three years ago. It’s not a response to or the property of any movement, any hashtag; it’s not finally, finally pulling back the veil on the terrible stories no one ever told until now. We have always told these stories. They have always existed and we have always told them. We just didn’t do it with hashtags. To even characterize this film as “a story about sexual abuse” would be a shallow read on a very deep work of art. The Tale is, at a certain level, “about” sexual abuse. But focus on that for too long and you’ll miss the astonishing, courageous, gorgeous mosaic of ways in which it is deliberately, doggedly and totally not. This is a film about the morphing quicksand terrain of human memory and it’s about the stories we tell ourselves in order to stay sane and most of all it’s about the Plinian, volcanic power of emotional honesty. If you want to talk about the spirit of the moment, the guiding spirit of the times, maybe we need to pan back from anything as specific as sexual abuse of girls and women and talk about why being honest is the ultimate act of revolution. Plenty of people make autobiographical films. The Tale is so deeply and specifically autobiographical that it almost becomes something else. Fox as director and writer puts her documentarian’s tools to work to create a meta-textual tapestry depicting the ways in which our memories inform (and misinform) our self-concept. And this beautiful, gripping, disturbing film deserves to be looked at with as much nuance as it offers. It manages to dive so deeply into the personal that it explodes into something universal. —Amy Glynn\n\n24. Leaving Neverland\n\nYear: 2019\n\nDirector: Dan Reed\n\nIt’s all heartbreaking. The damage to the psyches of children, certainly, but everything else is sad as hell, too: the endless voracious need for approval at any cost, the radioactive half-life of a lie, the emptiness at the center of fame, the way child abuse is a perpetual motion machine that infects one generation after another. In an oblique way, HBO’s Leaving Neverland is a reminder that the monstrous people who sexually abuse children do not simply drop out of the skies. They are forged. Created. Usually by abusers of their own. You look at Michael Jackson—his collapsing, bleaching face; his skinny little body; his soft, mealy speaking voice—and you can see a victimizer who was also a victim. If we could hold that perception and really understand it, would it change anything? The desire to withhold forgiveness from such people is deep and tenacious, and it’s more than understandable why that’s the case. No one tests the limits of forgiveness quite like someone who has molested children.\n\nThe four hours of Leaving Neverland are characterized by a cavernous sense of aural and visual space. The sound editing is almost uncomfortably intimate; I squirmed at the audible swallowing and breathing sounds in the interview segments. There’s also the way archival photo images are centered deeply in the frames—small, surrounded by black space, static. It’s elliptical, allusive. And effective. The testimony of the two alleged victims (and their mothers and their wives) is uncontested, and they do not affirmatively prove anything, but their stories strike so many of the same chords that you’d have to be awfully spaced out not to notice. The seduction of the boys’ star-struck and ambitious mothers. (Wade Robson’s mom relocated him from Australia to Hollywood, splitting up her family on the promise of Jackson’s mentorship and help.) The extended, extensive grooming process. Manipulative generosity. (A passage where James Safechuck describes Michael taking him to a jeweler to buy him a ring is especially creepy; apparently, Jackson had an elaborate story that James was helping him select something for a woman friend, and the kid’s delicate little fingers were the right size.) Creating a shared secret. We say people who hurt children don’t deserve to be forgiven, but just as it’s a mistake to see Leaving Neverland as a film about Michael Jackson, so is it a distraction to conflate forgiveness with releasing people from accountability. It doesn’t demand that viewers make a call on any of that, which is as it should be. It tells a piercingly sad and highly disturbing story that might or might not change how you feel about Michael Jackson, but will almost certainly draw a haunting, highly detailed sketch of the legacy of damage that ensues when someone violates children. —Amy Glynn\n\n23. Going Clear: Scientology and the Prison of Belief\n\nYear: 2015\n\nDirector: Alex Gibney\n\nAlex Gibney’s up-close examination of Scientology, its practices and the controversies that surround the religion founded by science-fiction writer L. Ron Hubbard is also a stirring portrait of eight former adherents, who tell their stories of how they came to practice Scientology and their reasons for leaving the church. While much of the ideological content in Gibney’s film has circulated on the Internet for years, there was still a number of items to be learned from watching the film and hearing from the men who made it. While Going Clear is part exposé and part condemnation of a controversial religion, director Gibney has said that he was most interested in “the journey of the key characters in the film”—and how people got lost in the ‘prison of belief.’” —Christine N. Ziemba\n\n\n\n22. Paradise Lost: The Child Murders at Robin Hood Hills\n\nYear: 1996\n\nDirectors: Joe Berlinger, Bruce Sinofsky\n\nIf you’ve never heard of the West Memphis Three, do some research before you begin—you’ll want to be prepared. Within only a minute of the film’s opening, as Metallica’s “Welcome Home (Sanitarium)” noodles forebodingly over pixelated camcorder videos, intolerable images taken straight from police evidence glance across frame, so quickly and frankly you’ll immediately question if they are, in fact, real. Of course, they are—they are images no person should ever have to see, and yet Joe Berlinger and Bruce Sinofsky use them only to expose the unbelievable horror at the heart of the appropriately named Paradise Lost. What unfolds over the following two and a half hours is just as heartbreaking: a trio of teenage boys (one with an IQ of 72) is put on trial for the brutal murders of three prepubescent boys, the only evidence against them a seemingly forced confession by the young kid with the below-average IQ, and laughably circumstantial physical proof. The film explores the context of West Memphis, its blindly devoted Christian population and how the fact that these teenagers dressed in black and listened to Metallica somehow led to their predictable fates at the hands of a comprehensively broken justice system. With surprising access to everyone involved in the trial, as well as a deft eye for the subtle exigencies of any criminal case such as this, Paradise Lost is a thorough, infuriating glimpse of the kind of mundane evil that mounts in some of America’s quietest corners. Welcome home. —Dom Sinacola\n\n21. Won’t You be My Neighbor?\n\nYear: 2018\n\nDirector: Morgan Neville\n\nMorgan Neville’s winning portrait Won’t You Be My Neighbor? withholds darkness. Which makes sense since the Oscar-winning director of 20 Feet From Stardom has turned his attention to Fred Rogers, a kindly TV personality who entertained a couple generations of kids with his benign PBS program Mister Rogers’ Neighborhood. Rogers died in 2003 at the age of 74, and this year marks the 50th anniversary of his landmark show, so expect plenty of tributes over the next several months. Appropriately, as an official chronicling of the man’s life and legacy, Won’t You Be My Neighbor? isn’t remotely innovative. We get polished interviews from colleagues, family members and Rogers’ widow. There are plenty of clips from his show, as well as other archival material. There’s a gimmick-y recurring use of animation to illustrate parts of his story that’s the only truly cloying element of a film that mostly eschews mawkishness. And yet, Won’t You Be My Neighbor? is a stunningly moving film that also feels just the teensiest bit radical. That word will be used a lot during this golden anniversary for Mister Rogers’ Neighborhood, as his fans remind everyone that, rather than starring a smiling square who couldn’t have looked less manly, the show was actually a pretty progressive program that frankly discussed everything from race relations to John F. Kennedy’s assassination. Neville accentuates Rogers’ unembarrassed sweetness as an example of his principled stand against bigotry and injustice, making the case with conviction and gusto.\n\nAt my True/False screening, the audience was warned before Won’t You Be My Neighbor? that we ought to have Kleenex in hand to prepare for what we were going to experience. I’m an unashamed movie crier, but I resent being prepped for how I should feel about a movie I’m about to see. And yet, the warning was warranted: The tears elicited from Won’t You Be My Neighbor? are a testament to Neville’s tasteful, loving (but not fawning) depiction of a decent, unassuming man. The movie’s not just a balm in the age of Trump—it’s an opportunity for viewers to reconnect with their own decency, and Neville’s gentle skill at arguing for goodness ends up being a minor miracle. —Tim Grierson\n\n20. Bessie\n\nYear: 2015\n\nDirector: Dee Rees\n\nIt may have taken 20 years to make it, but when Bessie finally arrived, she came, she saw and she conquered. The HBO film has garnered 12 well-deserved Emmy nominations, with Queen Latifah, co-stars Michael Kenneth Williams and Mo’Nique, and director Dee Rees all getting the nod. One scene in particular—with the reverse paper bag test—is one of Bessie’s finest moments, as it encompasses all that makes the HBO film so wonderful. There’s Queen Latifah in all her glory, finally setting up her own tour and making sure everyone knows who’s boss. There’s the hilarity when she lets down one of the hopefuls auditioning—“You must be darker than the bag to be in my show!” After all, Bessie is an incredibly funny movie at times. And there’s the whole inversion of the brown paper bag test. Where Bessie Smith grew up in a world that demanded black women performing back-up be lighter than a brown paper bag, Bessie makes up a new rule that gives her back some agency and sets a different tone (literally and figuratively) for her showcase. Bessie was, in no way, your average blues performer and for that reason Lili Fini Zanuck and her husband Richard D. Zanuck knew they couldn’t just deliver your average black-performer-who-grew-up-poor-and-made-it-big biopic. The familiar story of a talented woman done in by a man (or many men), or childhood tragedies, or her own celebrity was not Bessie’s story—she wasn’t lighter than a brown paper bag, and, thankfully, wasn’t presented as such. —Shannon M. Houston\n\n\n\n19. American Splendor\n\nYear: 2003\n\nDirectors: Robert Pulcini, Shari Springer Berman\n\nHarvey Pekar’s “American Splendor” books are fascinating: Pekar believed that even the most mundane and seemingly uncomplicated lives were worth documenting. American Splendor showcases this theory by combining real footage of Pekar, fictionalized versions of characters from his life—maintaining both stylized caricatures and naturalistic drama—and even animated segments pulled from the comics to create a cohesive whole that presents an ordinary life as a fascinating experience. —Ross Bonaime\n\n\n\n18. Blindspotting\n\nYear: 2018\n\nDirector: Carlos López Estrada\n\nMovies like Blindspotting, kitchen sink movies in the business of tackling as many subjects and relevant social issues as they can squeeze into two hours, tend to risk overstuffing: They try to be about everything, so end up being about nothing. Let Blindspotting serve as an object lesson in keeping the sink tidy and organized, its \"about everything\" narrative built around an anchor, being Oakland, that holds the \"everything\" in place, from police violence, to gentrification, to cultural appropriation and code switching, to workaday prejudice and systemic racism. Blindspotting is about Oakland first, the contemporary woes weighing Oakland down second and the overarching problems of the time we live in a close third. Above all else it is about the vigor of Daveed Diggs and Rafael Casal, its co-leads and authors, who, having spent nine years writing the script, have finally realized their vision, an ode to their hometown and a timelapse snapshot of America. The film is uplifted by Diggs’ and Casal’s raw talent as storytellers, poets and MCs—Diggs’ hyperkinetic rapping is one of the film’s best merits—but its backbone is a product of the emphasis put on its backdrop. —Andy Crump\n\n17. Hedwig and the Angry Inch\n\nYear: 2001\n\nDirector: John Cameron Mitchell\n\nThis troubled yet lovable “slip of a girly boy” is the best thing that happened to us since Frank N. Furter. With this film, John Cameron Mitchell not only proved himself as a bona fide rocker with a killer set of legs, he also got to show off his writing and directing skills, prompting him to further explore his talents with Shortbus (2006) and Rabbit Hole (2010). The film tells the story of Hansel Schmidt (Cameron Mitchell), growing up in communist East Germany, fascinated with rock music and already seemingly very in tune with his sexuality. This self-awareness is enhanced when he meets Luther Robinson (Maurice Dean Wint), an American soldier who wins Hansel’s heart with licorice drops and jelly rolls. Hansel needs some sugar in his bowl! Hansel and Luther get married, but in order for Hansel to leave the country, he needs to undergo an official sex change. Hansel takes on his mother’s name, Hedwig, and agrees to the operation—but wakes up to find that something went wrong. All she’s left with is a one-inch mound of flesh between her legs—the infamous “Angry Inch.”\n\nHedwig and Luther’s romance doesn’t last, and soon Luther leaves her for another man. To deal with her pain, Hedwig forms a rock band with some Korean Hausfraus, before meeting Tommy Speck (Michael Pitt), a fair-skinned, innocent-looking young boy whom she believes to be her soul mate. Tommy, whose Christian background stops him from pursuing the affair any further, leaves Hedwig—but not before she christens him with his stage name: Tommy Gnosis. When he goes off to become a famous rock star, Hedwig is appalled to find he is performing the songs she had written for him. Fueled with hurt and humiliation, Hedwig and The Angry Inch—now consisting of Eastern European musicians—follow Tommy’s tour in order to preach their predicament to the masses.\n\nMost of the film’s songs are performed live, and with songs like “The Origin of Love,” “Wig in a Box” and “Angry Inch,” one can totally imagine Hedwig fanatics going wild in small, atmospheric theaters for decades to come—just around midnight. —Roxanne Sancto\n\n16. Amélie\n\nYear: 2001\n\nDirector: Jean-Pierre Jeunet\n\nDelicate and delicious, Amélie is an easily, exceedingly lovable little French trifle. With the face of an angel, the heart of a child and the haircut of a Parisian pixie, Amélie Poulain (Audrey Tautou) sweeps us clean off our feet while Tautou launches herself into the American consciousness as the do-gooding waitress who sends her secret crush photos and riddles, masking her identity in order to make their first encounter—and first kiss—the most romantic moment of her life. Her fantastical adventures—in the name of idealized, even cinematic, coupling—unfold in flights of magical realism, Jean-Pierre Jeunet holding up love itself as both realistically magical and magically realistic. —Nick Marino\n\n15. Frantic\n\nYear: 1988\n\nDirector: Roman Polanski\n\nFrantic is not one of Polanski’s more highly regarded films in most circles, yet its first act is about as convincing an exhibition of talent as any in his oeuvre. In many ways, Frantic is a conventional mystery-thriller about an American doctor (a suitably frayed Harrison Ford) in Paris searching for his kidnapped wife—something probably about due for an action-oriented Liam Neeson remake—but Polanski elevates the material to great heights, or at least does before the absurd twists of the plot catch up with him. It’s really in the first act that Frantic earns its title, but not through the frenetic style that a modern director would employ to interpret it. Polanski allows Ford to give us that quality in his performance, and in restraining the editing and composition of the piece, to give us the space to really take that performance in. Where Polanski and his team shine brightest, though, is in the mood of that first hour or so. Working with a Hollywood budget, Polanski delivers a rich neo-noir atmosphere while avoiding all the aesthetic cliches that implies. Paris comes alive through the lens of Witold Sobocinski, but it’s an old life, history dimly radiating from every corner of the frame. In that opening hour Ford’s displaced and distressed American seems most at risk not from his wife’s kidnappers, but from the worn details that surround him and the way the light seems folded into ancient shadows: the overwhelming sense of our insignificance in a storied place—even when we’re in crisis. —Chad Betz\n\n14. The Lost Boys\n\nYear: 1987\n\nDirector: Joel Schumacher\n\nIf vampires are among the original heartthrobs, it makes all the more sense for Joel Schumacher—he of Brat Pack and other generic onscreen glossiness—to have doubled down with a Tiger Beat collage of ’80s teen idols: Jason Patric, Kiefer Sutherland, Jami Gertz and the Coreys (Haim and Feldman). Patric and Haim are siblings who sense something is amiss in their new coastal California town, where a lot of people have gone missing lately. While Patric’s Michael falls in with hottie Star (Gertz) and her gang leader/vamp BF David (Sutherland), Haim’s Sam bonds with the nerdy vampire-hunting Frog brothers, Edgar and Allan (get it?), at the local comic book store. It’s super slick, cheesy and a nostalgia trip for the pre-Twilight generation. Schumacher scores bonus points for casting Dianne Wiest as a newly single mom, Edward Herrmann as her suspicious new suitor, and Barnard Hughes as the boys’ curmudgeonly gramps. Despite its titular hat tip to J.M. Barrie, The Lost Boys is about as deep as a baby’s premolars, but don’t let that stop you from “vamping out.” —Amanda Schurr\n\n13. Deadwood: The Movie\n\nYear: 2019\n\nDirector: Daniel Minihan\n\nA decade has passed in Deadwood between the show’s finale and Deadwood: The Movie, and longer has come and gone in the real world. Beloved characters have vacated the town, passed away with the beloved actors behind them. Deadwood isn’t used to that much temporal space. The longest narrative gap it ever weathered over the course of its 2004-2006 run was a seven month stretch hastening an affair and a bonanza gold mine. It’s a show where events and episodes occur over hours, where the threat of even minor change can send its entrenched group of outcasts to the brothel-worn mattresses. As South Dakota looks to enter the United States, Deadwood is about to finish the painful pubescence it began during the show and finally grow up. It left off with seething, begrudging closure—the kind found after a lopsided armistice—when gold magnate George Hearst (Gerald McRaney) strong-armed Alma Garret (Molly Parker) into selling her lucrative claim by, among other things, having her husband murdered. With all parties in that conflict returning to town to celebrate this new statehood, irredentism and its dictatorial opposite come into conflict. Hearst may own the town, but nobody stays bitter like a Deadwood resident. Tragic reunions, new beginnings, and those signature beatings—all the run-ins, disappointments, and excitements good fan service requires are included in its wide-ranging story. And the funerals have gotten way more elaborate since Seth Bullock (Timothy Olyphant) and Sol Star (John Hawkes) buried the murderer Ned Mason in the show’s second episode.\n\nEveryone, including the protagonistic owners of the hardware store, gets a life update. Community leader, killer, and brothel/bar operator Al Swearengen (Ian McShane) is on a jaundiced decline as law enters the land. Calamity Jane (Robin Weigert) has somehow survived her alcoholism, but is even more death-obsessed than she was after Wild Bill Hickok’s murder. Some get more detail than others, like Joanie Stubbs (Kim Dickens) or Mr. Wu (Keone Young), who merely drop by for familiarity’s sake and to help the characters actually doing something during the movie. Some of these developments are propped up by flashbacks that could be clip show-ish; others more delicate and wistful recollections whose images reignite the pain we haven’t seen these characters experience in 10 years. They’re obsessive fragments, moments of time snipped, captured, and replayed like a haunting tune stuck in their heads. The focus on memory feels natural, but it’s perhaps even more understandable when taking into account the Alzheimer’s diagnosis of show creator David Milch (who also wrote the film). The “curiosity, bitterness, and incredulity” of mental decline meets the “unflinching dignity” of idealism, something seen in every corner of Deadwood’s hard, angry, honorable inhabitants. Time, and the perspective its passage brings, is new for the show. But its addition only serves to cement its legacy as one of the best ever. As a series capper, the movie is a satisfying, loving end that fulfills old Deadwood’s imperfect promises while mostly avoiding the pitfalls of nostalgia. —Jacob Oller\n\n12. First Man\n\nYear: 2018\n\nDirector: Damien Chazelle\n\nWe first meet Neil Armstrong (Ryan Gosling) as a remote, almost chilly flyboy who is less Maverick than a willful, stoic technician. The year is 1961, and he and his wife Janet (Claire Foy) are paralyzed by the malignant tumor attacking their daughter Karen’s brain. When she dies, the family barely holds itself together and, in fact, Armstrong joins NASA in large part because the couple’s mourning is tearing them both apart. From there, we follow many of the familiar contours of the NASA story and Armstrong’s part in it, as he digs himself deeper and deeper into his work—and removes himself further and further from his family—in an obsession with … what, exactly? One of the movie’s slyest, most daring and affecting conceits is that we never quite know what’s going on with Armstrong, and neither does anyone else in the film, not least of all Janet, who is left raising two increasingly difficult boys while her husband buries himself in his work, perhaps to hide the grief that consumes him. It just turns out that work is something that’s going to change the world. This would seem like a bit of a turn for director Damien Chazelle, whose Whiplash and La La Land barely seem to exist in the same universe of Neil Armstrong and the space race. But his lyrical intensity, his ability to find the hard edges of his story while still being able to leave us in awe, is a perfect fit for this material. The space sequences, of which there are three major ones, are like musical numbers of their own, with Chazelle plunging us into the terror of what’s happening, the utter sense that, for all the technical know-how and noble intentions, everything could explode at any minute without anyone having the slightest idea why. These were, after all, experiments, and with those experiments came tragic failures. Chazelle is able to ground us with the details while making sure, when it all clicks together, that it can still soar. Chazelle has shown the ability to lift us off our feet before, but this is a major step forward. —Will Leitch\n\n11. Capturing the Friedmans\n\nYear: 2003\n\nDirector: Andrew Jarecki\n\nThis is the story of Arnold Friedman and his son Jesse, convicted of multiple counts of child molestation that supposedly took place in the basement of their home in a quiet New York suburb during the ’80s. In Capturing the Friedmans, filmmaker Andrew Jarecki interviews the victims and prosecutors, but never reaches a conclusion as to the veracity of the charges, tacitly acknowledging that guilt and innocence are fluid concepts in such sensational and shameful circumstances. Instead, he documents the implosion of the family and the destruction of an already tenuous marriage. Surely, the details of the abuse are disturbing, but almost as unsettling is the cruelty with which the two older Friedmans reject their mother in blind loyalty to their shamefaced father and numb younger brother, further facilitating the family’s emotional separation. —Emily Reimer\n\n10. Us\n\nYear: 2019\n\nDirector: Jordan Peele\n\nUs clarifies what Get Out implies. Even after only two films, Jordan Peele’s filmmaking seems preconfigured for precision, the Hitchcock comparisons just sitting there, waiting to be shoved between commas, while Peele openly speaks and acts in allusions. Us, like Get Out before it but moreso, wastes nothing: time, film stock, the equally precise capabilities of his actors and crew, real estate in the frame, chance for a gag. If his films are the sum of their influences, that means he’s a smart filmmaker with a lot of ideas, someone who knows how to hone down those ideas into stories that never bloat, though he’s unafraid to confound his audience with exposition or take easy shots—like the film’s final twist—that swell and grow in the mind with meaning the longer one tries to insist, if one were inclined to do so, that what Peele’s doing is easy at all. A family comedy studded with dread, then a home invasion thriller, then a head-on sci-fi horror flick, Us quickly acquaints us with the Wilson family: calming matriarch Adelaide (Lupita Nyong’o), gregarious dad Gabe (Winston Duke), daughter wise beyond her years Zora (Shahadi Wright Joseph) and adorable epitome of the innocent younger brother, Jason (Evan Alex). Though far from shallow, the characters take on archetypal signifiers, whether it’s Zora’s penchant for running or that Gabe’s a big guy whose bulk betrays a softer heart, Peele never spoonfeeding cheap characterizations but just getting us on his wavelength with maximum efficiency. Us isn’t explicitly about race, but it is about humanity’s inherent knack for Othering, for boxing people into narrow perspectives and then holding them responsible for everyone vaguely falling within a Venn diagram. Regardless of how sufficiently we’re able to parse what’s actually going on (and one’s inclined to see the film more than once to get a grip) the images remain, stark and hilarious and horrifying: a child’s burned face, a misfired flare gun, a cult-like spectacle of inhuman devotion, a Tim Heidecker bent over maniacally, walking as if he’s balanced on a thorax, his soul as good as creased. Divorced from context, these moments still speak of absurdity—of witty one-liners paired with mind-boggling horror—of a future in which we’ve so alienated ourselves from ourselves that we’re bound to cut that tether that keeps us together, sooner or later, and completely unravel. We are our undoing. So let the Hitchcock comparisons come. Peele deserves them well enough. Best not to think about it too hard, to not ruin a good thing, to demand that Us be anything more than sublimely entertaining and wonderfully thoughtful, endlessly disturbing genre filmmaking. —Dom Sinacola\n\n9. Big Trouble in Little China\n\nYear: 1986\n\nDirector: John Carpenter\n\nNext to The Thing or Halloween, Big Trouble in Little China feels like little more than a lark, one more toss-off showcase for John Carpenter’s genre-bending curatorial spirit. Part goopy menagerie of grotesque special effects, part super-cool fantasy adventure, Big Trouble follows an all-American truck driver as he falls ass-backwards into a plot involving an ancient Chinese sorcerer seeking to fulfill a prophecy that will restore him to human form. The flick eschews most building-blocks of horror or tension to focus on carefree action bro Jack Burton, the aforementioned trucker played to the hilt by Kurt Russell, who was pretty much at the height of his laid-back dude-ical powers back in the ’80s. In fact, Carpenter may be that decade’s best unheralded action director, and Russell his charming muse, way more fun to watch than a Schwarzenegger or a Stallone or a VanDamme—Adonises barely able to grimace out full sentences, let alone crack a smile—because there wasn’t much more to what he was doing, or what Carpenter was filming, than going mullet-first into whatever madcap caper struck his fancy. All one-liners, shameless machismo, shiny biceps and a gnarly pair of mom jeans, Jack Burton is comparable perhaps only to John McClane in his unflagging ability to take absolutely nothing seriously about the serious situations constantly surrounding him. —Dom Sinacola\n\n\n\n8. Out of Sight\n\nYear: 1998\n\nDirector: Steven Soderbergh\n\nAs through Jim Jarmusch’s eyes in Only Lovers Left Alive, Detroit via Steven Soderbergh is a metropolis equal parts romance and history, both a place where people can escape their typical lives for a time and a place that people want to escape to leave behind the suffocating weight of centuries of human industry. Though he photographs the city in the cobalt blues of cold temperatures and the biting grays of colorless winter, Soderbergh seems to revel in the weird sprawl of Metro Detroit, fascinated by how the violence of boxing matches at the State Theater can so quickly—as if it were only a matter of changing a green screen—lapse into the wealthy compounds of Bloomfield Hills or the crystalline hotel rooms of the Renaissance Center, where you can eat a $25 burger listening to gun shots in the street below. Out of Sight is by far the best Elmore Leonard adaptation, the only one to truly embrace Leonard’s hometown as a place far more magical—far more dangerous and upsetting and beautiful and enchanting—than any director has ever admitted before. The rollicking yarn about a bank robber and consummate prisoner Jack Foley (George Clooney) who meets U.S. Marshal Karen Sisco (Jennifer Lopez) mid-prison-break and then entertains dreams of going clean to weirdly woo her, the film’s dedicated to its Michigan metropolis because no other locale has similarly, best and marvelously charmed its way to the bottom. —Dom Sinacola\n\n7. Can You Ever Forgive Me?\n\nYear: 2018\n\nDirector: Marielle Heller\n\nTen minutes into the film, the aging, broke, world-weary Lee Israel (Melissa McCarthy) walks by a room of a handful of women circled around a fastidiously dressed man decrying “Writer’s Block” as laziness, as a justification of the inability to do work or to be original. At a party held in her agent Marjorie’s (Jane Curtin) enormous apartment (there’s a coat check guy), Israel is an invisible outsider in the world of the literary elite. No one talks to her, and there’s the palpable friction of her contempt for the snobbery of such characters who ramble on about structure and reflexivity and her yearning to be recognized and embraced as worthy and talented. The writer of a handful of well-received and panned biographies, Israel is told by Marjorie that she has not made a name for herself, that she has disappeared behind her writing. Or, as Israel retorts, she’s doing her job—but still, she has doubt. And what do so many queer people do when they want to toe the line between disappearing into someone else and flaunting their own persona? They do drag. Certainly, one of the fundamental questions at the heart of Can You Ever Forgive Me?, written by Nicole Holofcener and Jeff Whitty, based on Lee Israel’s autobiography, is a notion of authenticity within art, or, in this case, within writing. To make ends meet, Israel begins to forge and embellish the personal letters of literary and social figures like Dorothy Parker and Noël Coward, and as she becomes further invested in the con of selling them to collectors and bookstore owners, she realizes she has to negotiate the space between her persona as a writer and how much of that persona is predicated on imitation without a real grasp on her own sensibilities or idiosyncrasies as a writer. How much real is there in this representation, how much authenticity is there in her artifice?\n\nThrough the eyes of Israel and Jack Hock (Richard E. Grant), New York retains the gritty luster of the 1970s, a time where the city still had a place for them. Heller and Holofcener and Whitty have an otherworldly skill at pinpointing the queer bitterness of these people’s lives, their willingness to keep living, and what may lurk beneath their armor. Like few other films, Can You Ever Forgive Me? seems tailor-made for a person like me: It’s a film about the frustrating, often sad life of writers, the anxiety of being able to create, the uncertainty of whether you have a voice in your craft, the adoration for a time and its figures to whence you do not belong, the things queer people will do to fight off loneliness. —Kyle Turner\n\n6. The Favourite\n\nYear: 2018\n\nDirector: Yorgos Lanthimos\n\nLove is a battlefield, as Pat Benatar once opined—a cliche that can also convey how love and sex, though not necessarily mutually inclusive, are never neutral. Those acts and feelings are political. A kiss is never just a kiss, and in Yorgos Lanthimos’s The Favourite, massaging someone’s leg, one person standing and the other on their knees, is not just a massage. From a fiendishly barbed screenplay by Deborah Davis and Tony McNamara (this is the first film of Lanthimos’s not co-written by him), The Favourite is about ailing, naïve, fussy Queen Anne (Olivia Colman)—ruler of Great Britain from 1702 to 1707—who acts like a wanton child (or is she treated like a child?) and submits most of her power and leadership duties to her “favourite,” Lady Sarah Churchill, Duchess of Marlborough (Rachel Weisz). This is convenient for Lady Sarah, who uses this opportunity for political strategy, swaying the Queen’s Tory-like politics to her own Whiggian politics, despite the battles she must carry on in court regularly (particularly against Robert Harley, a Tory, played by Nicholas Hoult). Her role as the Queen’s right-hand woman is as emotionally exhausting as it is politically fulfilling; while pushing for higher land taxes in order to finance an ongoing war with France, she is expected to quell the Queen’s many insecurities and neuroses. When Sarah’s distant cousin, and former lady herself, Abigail Hill (Emma Stone) lands on the steps of the palace, Abigail realizes she, too, can strategize to climb her way back to the top, even if it means pushing Sarah aside at all costs. Weisz and Stone are well-equipped as foils, and it is within their precision in comic timing, calculation (the film features the best hand job scene since The Master) and volleying passions that the film is able to ground their presences in the same kind of melancholy resignation as Anne’s. Cinematographer Robbie Ryan uses fisheye and wide angle lenses, bending the interior architecture like the women’s allegiances and truths, to unsettling effect. Arguably, Queen Anne is, at heart, an optimist, living in a world in which affection and vulnerability can be depoliticized, not tied to class or royalty or nationhood. This detachment from the reality of the varying power dynamics and spectacles around her and her court—and her forced confrontation with the nature of the quasi-love triangle—gives The Favourite its beating broken heart. Rather than being concerned with historical authenticity (Sandy Powell’s costumes are gorgeously anachronistic), Lanthimos gestures towards an emotional reality that posits the lover and the loved as soldiers, capable of being a casualty in what each party believes is a greater cause. What a blazing and burning feat of melodrama. —Kyle Turner\n\n5. In the Bedroom\n\nYear: 2001\n\nDirector: Todd Field\n\nBased on a story by Andre Dubus, Todd Field’s In the Bedroom is a quiet, understated and devastating exploration of grief in the aftermath of a happy family torn apart by the murder of Frank Fowler (Nick Stahl) by his girlfriend Natalie’s (Marisa Tomei) ex (William Mapother). Of course, Nick’s parents (Sissy Spacek and Tom Wilkinson) handle the loss of their son in very different ways, inevitably alienating themselves from each other, compounding their isolation and profound loss. Field’s directorial debut is an arresting (and emotionally exhausting) work, combining elements of romance, drama and the taut tension of a very good thriller to reveal and unfold the story at the core of the film, which is Spacek and Wilkinson’s joint and individual journeys to contend with the utterly life-shattering experience of unexpectedly losing a child. The shifts from grief to anger and blame to guilt to need are incredibly real, and Spacek and Wilkinson deliver stellar, deeply nuanced performances. Field was critically lauded for the restrained style of the film, and for good reason: This is a riveting character study, the deepest, fathomless of dives into the psychology of family in the midst of loss. —Amy Glynn\n\n\n\n4. Paddington 2\n\nYear: 2018\n\nDirector: Paul King\n\nA sequel to 2014’s Paddington, Paddington 2 picks up where its predecessor left off, with Paddington Brown (né Bear and voiced by Ben Whishaw) living contentedly with his human family, including Hugh Bonneville (Downton Abbey) and a newly name-recognizable Sally Hawkins (The Shape of Water), joined by that British A-Lister of yore Hugh Grant, dramatic heavyweight Brendan Gleeson, and many others. (In fact, one of the simple joys for parents watching the film lies in recognizing this or that British actor.) A simple, commendable desire to find a good gift for his Aunt Lucy (currently spending her days in a nice retirement home for bears in Lima, Peru, natch) leads Paddington to set his eyes on a certain antique pop-up book as the perfect present. When that scoundrel and fading thespian Phoenix Buchanan (Grant) also sets his sights on the same book, well, hijinks, misunderstandings and adventure ensue. Paddington 2 reminds us how difficult it can be to pull off a sweetly tempered, gently moving children’s movie by doing exactly that, and doing it so well. —Michael Burgin\n\n3. Widows\n\nYear: 2018\n\nDirector: Steve McQueen\n\nBeyond all its other attributes, what’s perhaps most remarkable about Widows is the man who made it. An Oscar-winning filmmaker and, before that, an acclaimed visual artist known for his arresting video installations, Steve McQueen has long focused on the suffering of the human soul, again and again exploring the anguish within our spirit. There hasn’t been much indication that the thrills of pulp fiction have been part of his DNA, and so it might be easy to assume that McQueen, while adapting the 1980s British crime series created by Lynda La Plante, would either condescend to the audience or drain the material of its vibrancy. Incredibly, his Widows does neither: This is a mature, exciting, utterly engrossing heist film that proves to be far more than just a crime drama. Set in Chicago, the film stars Viola Davis as Veronica, who’s in the midst of mourning. Her husband Harry (Liam Neeson) has just died in a shootout with the police—although she doesn’t quite want to acknowledge it, Harry was a professional bank robber, and his most recent haul ended up killing him and his partners. But Veronica’s grief has to be put on hold after a dangerous man named Jamal (Brian Tyree Henry), who’s running for political office, approaches her with an urgent message. He was the target of Harry’s last heist, and now he wants his money back—even though it burned up in the fire that claimed Harry and his team. If Veronica doesn’t come up with a couple million dollars, she’ll end up like her husband. Veronica is terrified—she works for the city’s teachers union and doesn’t have the resources or the means to grant Jamal’s request—which is when she hits upon an idea. Harry left behind a journal with detailed plans for his next heist. Veronica recruits the widows of Harry’s team to pull off that robbery. These women—working-class Linda (Michelle Rodriguez) and sheltered, spoiled Alice (Elizabeth Debicki)—don’t seem like the bank-robbing types. But what other option do they have? To call Widows merely a heist film would be to shortchange it. And yet, when it comes time for the robbery, McQueen, cinematographer Sean Bobbitt and editor Joe Walker deliver an exhilarating one that’s steeped in our knowledge of these characters and their personal stakes. If thrillers are meant to be escapist, nobody told this cast and crew. Sure, Widows is a dynamite entertainment, but it’s also more mournful, thought-provoking and intelligent than that. Adults often complain there aren’t good mainstream movies for them—ones that can engage them, entertain them and leave them with something to chew on as they leave the theater. Widows is here waiting for you. —Tim Grierson\n\n2. Annie Hall\n\nYear: 1977\n\nDirector: Woody Allen\n\nThe sole best picture winner in Woody Allen’s canon—or whatever amounts to his legacy nowadays—Annie Hall succeeds in many forms, not the least as a great romantic comedy, simply because it patiently takes the time to reveal a relationship’s many moments, major and not so much—the wide spectrum of happy and sad, of bittersweet and just plain bitter. From fighting over which movie to see, to laughing while chasing down lobsters in the kitchen, Allen’s film grasps the delicacy of how such a bond can shift imperceptibly from bliss to something else entirely. It doesn’t hurt that Allen’s wit and humor is perfectly matched (even challenged) by Diane Keaton, in her iconic, Oscar-winning performance. However his films have soured sense, Annie Hall remains an enduring classic. —Jeremy Medina\n\n\n\n1. Robocop\n\nYear: 1987\n\nDirector: Paul Verhoeven\n\nThroughout the late-’70s and indulgent 1980s, “industry” went pejorative and Corporate America bleached white all but the most functional of blue collars. Broadly speaking, of course: Manufacturing was booming, but the homegrown “Big Three” automobile companies in Detroit—facing astronomical gas prices via the growth of OPEC, as well as increasing foreign competition and the decentralization of their labor force—resorted to drastic cost-cutting measures, investing in automation (which of course put thousands of people out of work, closing a number of plants) and moving facilities to “low-wage” countries (further decimating all hope for a secure assembly line job in the area). The impact of such a massive tectonic shift in the very foundation of the auto industry pushed aftershocks felt, of course, throughout the Rust Belt and the Midwest—but for Detroit, whose essence seemed composed almost wholly of exhaust fumes, the change left the city in an ever-present state of decay. And so, though it was filmed in Pittsburgh and around Texas, Detroit is the only logical city for a Robocop to inhabit. A practically peerless, putrid, brash concoction of social consciousness, ultra-violence and existential curiosity, Paul Verhoeven’s first Hollywood feature made its tenor clear: A new industrial revolution must take place not within the ranks of the unions or inside board rooms, but within the self. By 1987, much of the city was already in complete disarray, the closing of Michigan Central Station—and the admission that Detroit was no longer a vital hub of commerce—barely a year away, but its role as poster child for the Downfall of Western Civilization had yet to gain any real traction. Verhoeven screamed this notion alive. He made Detroit’s decay tactile, visceral and immeasurably loud, limning it in ideas about the limits of human identity and the hilarity of consumer culture. As Verhoeven passed a Christ-like cyborg—a true melding of man and savior—through the crumbling post-apocalyptic fringes of a part of the world that once held so much prosperity and hope, he wasn’t pointing to the hellscape of future Detroit as the battlefield over which the working class will fight against the greedy 1%, but instead to the robot cop, to Murphy (Peter Weller), as the battlefield unto himself. How can any of us save a place like Detroit? In Robocop, it’s a deeply personal matter. —Dom Sinacola\n\n", "images": ["https://cdn.pastemagazine.com/images/master-header-logo.png", "https://cdn.pastemagazine.com/www/articles/2019/10/03/out-of-sight-lead.jpg"], "top_img": "https://cdn.pastemagazine.com/www/articles/2019/10/03/out-of-sight-lead.jpg", "keywords": [], "authors": ["Scott Russell", "Lacy Baugher", "Rachel Singh", "Clare Martin", "Paste Staff", "Tv Writers", "Paste Movies", "Paste Movies Staff", "Dom Sinacola", "Garrett Martin"], "canonical_link": "https://www.pastemagazine.com/articles/2019/10/best-movies-on-hbo.html?p=2", "title": "The 50 Best Movies on HBO Right Now", "meta_data": {"title": "The 50 Best Movies on HBO Right Now - Paste Magazine", "description": "Here are the best movies HBO has to offer right now, including 'Widows,' 'Can You Ever Forgive Me?' and 'Robocop'", "keywords": ", The 50 Best Movies on HBO Right Now, Lists, Lists, Articles, Paste", "fb": {"admins": 1185614656, "app_id": 127550380613969, "pages": 18512903240}, "apple-mobile-web-app-title": "Paste Magazine", "og": {"image": {"identifier": "https://cdn.pastemagazine.com/www/articles/2019/10/03/out-of-sight-lead.jpg", "width": 633, "height": 356}, "type": "article", "url": "https://www.pastemagazine.com/articles/2019/10/best-movies-on-hbo.html", "title": "The 50 Best Movies on HBO Right Now", "site_name": "pastemagazine.com", "description": "Here are the best movies HBO has to offer right now, including 'Widows,' 'Can You Ever Forgive Me?' and 'Robocop'"}, "article": {"tag": "widows", "section": "Movies", "published_time": "2019-10-21T10:57:48-07:00", "modified_time": "2019-11-26T09:00:08-08:00", "publisher": "https://www.facebook.com/PasteMagazine"}, "twitter": {"card": "summary_large_image", "site": "@pastemagazine", "title": "The 50 Best Movies on HBO Right Now", "description": "Here are the best movies HBO has to offer right now, including 'Widows,' 'Can You Ever Forgive Me?' and 'Robocop'", "image": "https://cdn.pastemagazine.com/www/articles/2019/10/03/out-of-sight-lead.jpg"}, "p": {"domain_verify": "8f36922bc91ba221f10d82c407d8b6a9"}, "viewport": "viewport-fit=cover, width=device-width, initial-scale=1.0, maximum-scale=1.0"}, "movies": [], "publish_date": 1571680668.0, "source": "https://www.pastemagazine.com", "summary": ""}