{"url": "http://www.newslocker.com/en-us/news/celebrity/chris-pratt-and-bryce-dallas-howard-visit-a-london-childrens-hospital-get-the-exclusive-details/", "text": "Jamie Lynn Spears Celebrates Sister Britney's Birthday with Throwback Pic of Their Matching Perms Jamie Lynn Spears is celebrating sister Britney Spears’ 38th birthday with an epic throwback photo!\n\nThe Zoey 101 star, 28, shared three pictures of the famous sibling duo on Twitter and Instagram today. And in the first snap, teenage Britney can be seen dancing on a front porch with her little sister. Both girls are wearing bikinis and rocking curly hair.\n\n“When Britney got a perm, well I had to have one too (as pictured above) Some things never change. Always looking up to you. Happy Read more\n\nAdam Levine Snuggles with Wife Behati Prinsloo Courtside at Lakers Game Adam Levine and Behati Prinsloo had some fun and games of their own while sitting courtside to support the Los Angeles Lakers on Saturday.\n\nThe Maroon 5 frontman, 40, and the model, 31, were seen getting cozy during the Lakers’ matchup against the Dallas Mavericks at the Staples Center. In one shot, Prinsloo gave her husband a kiss on the cheek, while in another the couple rested their foreheads against each other.\n\nLevine showed off his array of tattoos while wearing a white Rolling Stones Read more\n\nJulia Roberts Will Join Michelle Obama for Girls' Empowerment Trip to Vietnam and Malaysia Talk In the fall, former First Lady Michelle Obama announced she was going to travel to Vietnam in December to spotlight girls’ education. She teased then that she would be joined by a few “special guests,” including Today co-host Jenna Bush Hager.\n\nOn Monday, the Obama Foundation announced a few more details about one of those guests: Julia Roberts.\n\nThe Homecoming star, 52, will first join Obama, 55, on Dec. 9 in Vietnam “to meet with local girls education organizations and be Read more\n\nAlanis Morissette Drops New Single and Announces Jagged Little Pill 25th Anniversary Tour Alanis Morissette is celebrating the 25th anniversary of her signature album, Jagged Little Pill, in a big way.\n\nOn Monday, the Grammy winner, 45, announced that she would be embarking this summer on a 31-stop North American tour honoring the record’s milestone — alongside special guests and fellow ’90s powerhouse alt rockers, Garbage and Liz Phair.\n\nNews of the Jagged Little Pill 25th Anniversary Tour, produced by Live Nation, comes as a new musical based on Morissette&rsqu Read more\n\nTaylor Swift Says She Loved the 'Weirdness' of Making Cats: I Had an 'Amazing Time' Taylor Swift knew Cats would be a once in a lifetime experience.\n\nIn her new cover interview for British Vogue, the 29-year-old pop star spoke about her recent work in the highly anticipated big screen adaptation of the classic musical, sharing that she loved how unique the opportunity was.\n\n“I really had an amazing time with Cats,“ Swift said in her interview. “I think I loved the weirdness of it. I loved how I felt I’d never get another opportunity to be like th Read more\n\nTrue Detective Reunion! Matthew McConaughey Goes for a Swim with Woody Harrelson: 'Brothers' Matthew McConaughey and Woody Harrelson are true bromance goals.\n\nOn Sunday, McConaughey, 50, shared an Instagram photo of himself all smiles deep in a body of water alongside his close pal Harrelson, 58, who wrapped his arm around the star.\n\n“Brothers from nother mothers?” McConaughey captioned the sweet snap.\n\nThe famous actors have been close friends for many years now. They first worked together in the 1999 satire film Edtv, which also starred Ellen DeGeneres, Martin Read more\n\nRob Lowe's Son John Hilariously Trolls Him from Backstage During Ellen DeGeneres Interview There’s nothing like getting roasted by your offspring on television.\n\nIn a sneak peek at his appearance on The Ellen DeGeneres Show on Monday, Rob Lowe sits down to catch up with host Ellen DeGeneres — all while his son John Owen, 24, is backstage, poised to comment on the interview.\n\nLowe, 55, starts by proudly listing his son’s accomplishments. (The recent graduate is currently writing for prolific TV creator Ryan Murphy.)\n\n“He graduated with straight As at Stanford,&rdqu Read more\n\nLizzo Channels Titanic and Poses Nude in Sexy New Snaps Lizzo is showing off her assets.\n\nThe \"Truth Hurts\" singer, 31, bared (nearly) all on Instagram Sunday, posing nude in a series of snapshots and a video taken on an orange velvet couch.\n\nIn the images, Lizzo’s long, dark hair is strategically positioned over her private areas as she is snapped from the front and the side, sporting a full face of makeup and long white nails.\n\n“Paint me like ya French bitch ,” she joked in her photo captions, channeling a version of the line spoken Read more\n\nTaylor Swift Talks the Importance of 'Ownership Over What You Do' as She Covers British Vogue Taylor Swift is involved in every aspect of her music — and she realizes how important that has been to her success.\n\nIn an interview with Andrew Lloyd Webber for British Vogue‘s January issue, the 29-year-old pop powerhouse opens up about how her career to date, spanning over a decade, has been partly shaped by her dedication to her work behind the scenes.\n\n“I thinkis really important — also from the side of ownership over what you do and make,” says Swift who, Read more\n\nLaverne Cox on Her Hair Journey and Feeling Beautiful at Age 47 She’s an acclaimed actress, an LGBTQ+ trailblazer in Hollywood, and now, as the new brand ambassador of leading haircare brand Matrix Total Results, Laverne Cox is ready to take on the beauty industry.\n\nSpeaking with PEOPLE after announcing the partnership, the Emmy Award-winning actress gets candid about everything from maintaining her natural curls and experimenting with wigs, to feeling confident and content at age 47.\n\n“I love Matrix’s ‘Live Your Color’ campa Read more\n\nEva Longoria Shares Adorable New Photo of Her Son Santiago: 'Sunday Mood' Eva Longoria‘s son Santiago “Santi” Enrique Bastón has reached maximum cuteness, with the help of a cuddly stuffed panda bear.\n\nThe actress, 44, shared a snapshot of her 17-month-old, dressed in an all-white onesie, laying on the floor while curled-up with a plush panda.\n\n“Sunday Mood ,” Longoria captioned the sweet post.\n\nInside what appears to be a playroom stocked other fluffy animals and another giant panda, the toddler glances upward past the camera lens fo Read more\n\nWill & Grace Star Shelley Morrison Dies at 83 Shelley Morrison, best known for her longtime role in Will & Grace, has died. She was 83.\n\nMorrison died on Sunday at Cedars-Sinai Medical Center in Los Angeles from heart failure after a brief illness, her publicist Lori DeWaal confirmed to PEOPLE. The Associated Press was the first to report the news of the star’s death.\n\nFor eight seasons, from 1999-2006, Morrison was in 68 episodes, starring opposite Megan Mullally’s Karen Walker as her longtime maid and confidant, Rosario Sala Read more\n\nRHOA's Kenya Moore Says Co-Sleeping with Infant Daughter Led to Intimacy Problems with Husband Kenya Moore is further opening up about the intimacy issues she and her now-estranged husband Marc Daly were going through before their split.\n\nOn Sunday’s Real Housewives of Atlanta, the former Miss USA, 48, confided in friend Porsha Williams about her marital problems, admitting that co-sleeping with their infant daughter Brooklyn Doris, now 1, had put a strain on their sex life.\n\n“The baby has changed so much in our lives,” Moore said. “She’s in the bed all th Read more", "images": ["https://img.newslocker.com/2019/12/02/196257419_725.jpg", "http://www.newslocker.com/images/share-facebook.png", "http://www.newslocker.com/images/flags/gb.png", "https://img.newslocker.com/2019/12/02/196262221_725.jpg", "http://www.newslocker.com/images/flags/es.png", "https://img.newslocker.com/2019/12/02/196260530_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/flags/pt.png", "http://www.newslocker.com/images/rss.png", "https://img.newslocker.com/2019/12/02/196262504_725.jpg", "http://www.newslocker.com/images/flags/fr.png", "http://www.newslocker.com/images/flags/be.png", "https://img.newslocker.com/2019/12/02/196253049_725.jpg", "https://img.newslocker.com/2019/12/02/196256710_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2019/12/02/196234829_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "http://www.newslocker.com/images/flags/mx.png", "https://img.newslocker.com/2019/12/02/196235180_725.jpg", "https://img.newslocker.com/2019/12/02/196252333_725.jpg", "http://www.newslocker.com/images/flags/ng.png", "https://img.newslocker.com/2019/12/02/196234011_725.jpg", "http://www.newslocker.com/images/flags/cl.png", "https://img.newslocker.com/2019/12/02/196258412_350.jpg", "http://www.newslocker.com/images/flags/cr.png", "http://www.newslocker.com/images/flags/ec.png", "https://img.newslocker.com/2019/12/02/196236094_725.jpg", "http://www.newslocker.com/images/flags/in.png", "https://img.newslocker.com/2019/12/02/196254739_725.jpg", "https://img.newslocker.com/2019/12/02/196236093_725.jpg", "https://img.newslocker.com/2019/12/02/196263220_725.jpg", "https://img.newslocker.com/2019/12/02/196262222_725.jpg", "https://img.newslocker.com/2019/12/02/196258411_725.jpg", "https://img.newslocker.com/2019/12/02/196258170_725.jpg", "https://img.newslocker.com/2019/12/02/196264764_725.jpg", "https://img.newslocker.com/2019/12/02/196264311_725.jpg", "http://www.newslocker.com/images/logo.jpg", "http://www.newslocker.com/images/flags/br.png", "http://www.newslocker.com/images/newslocker-cube.png", "http://www.newslocker.com/images/flags/do.png", "https://img.newslocker.com/2019/12/02/196256234_725.jpg", "http://www.newslocker.com/images/flags/co.png", "http://www.newslocker.com/images/flags/ve.png", "http://www.newslocker.com/images/flags/au.png", "https://img.newslocker.com/2019/12/02/196261902_725.jpg", "http://www.newslocker.com/images/flags/de.png", "https://img.newslocker.com/2019/12/02/196254363_725.jpg", "https://img.newslocker.com/2019/12/02/196263760_725.jpg", "https://img.newslocker.com/2019/12/02/196263761_725.jpg", "http://www.newslocker.com/images/flags/nl.png", "https://img.newslocker.com/2019/12/02/196251587_725.jpg", "https://img.newslocker.com/2019/12/02/196259330_725.jpg", "http://www.newslocker.com/images/flags/ar.png", "https://img.newslocker.com/2019/12/02/196251588_725.jpg", "http://www.newslocker.com/images/flags/it.png", "http://www.newslocker.com/images/flags/us.png", "http://www.newslocker.com/images/flags/bo.png", "http://akns-images.eonline.com/eol_images/Entire_Site/201749/rs_600x600-170509104838-600.chris-pratt-bryce-dallas-howard.5917.jpg?downsize=450:*&crop=450:350;left,top", "https://img.newslocker.com/2019/12/02/196263221_725.jpg", "http://www.newslocker.com/images/flags/ca.png", "http://www.newslocker.com/images/flags/pe.png"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/201749/rs_600x600-170509104838-600.chris-pratt-bryce-dallas-howard.5917.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com:443/en-us/news/celebrity/chris-pratt-and-bryce-dallas-howard-visit-a-london-childrens-hospital-get-the-exclusive-details/", "title": "Chris Pratt and Bryce Dallas Howard Visit a London Children's Hospital: Get the Exclusive Details", "meta_data": {"description": "Chris Pratt and Bryce Dallas Howard are never too busy to bring a smile to a child's face.The actors took a break from filming Universal Pictures' upcoming Jurassic World sequel...", "og": {"title": "Chris Pratt and Bryce Dallas Howard Visit a London Children's Hospital: Get the Exclusive Details - Celebrity news - NewsLocker", "description": "Chris Pratt and Bryce Dallas Howard are never too busy to bring a smile to a child's face.The actors took a break from filming Universal Pictures' upcoming Jurassic World sequel...", "type": "website", "url": "https://www.newslocker.com:443/en-us/news/celebrity/chris-pratt-and-bryce-dallas-howard-visit-a-london-childrens-hospital-get-the-exclusive-details/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/201749/rs_600x600-170509104838-600.chris-pratt-bryce-dallas-howard.5917.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": "1335791813,560345808"}, "robots": "index", "tradetracker-site-verification": "5d3490426a1947bbfe3c56de4fa490c0ba416113", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1494352500.0, "source": "http://www.newslocker.com", "summary": ""}