{"url": "https://www.tvguide.com/news/teen-wolf-series-finale-jeff-davis-interview/", "text": "[The following article contains spoilers for Sunday's series finale of Teen Wolf. Read at your own risk!]\n\nIt started with a bite and it ended with a pack.\n\nTeen Wolf concluded a six-year, 100-episode run on Sunday with one of its most enjoyable episodes ever. Scott (Tyler Posey) and his pack faced off against Gerard Argent's (Michael Hogan) full army and their nightmares come to life, as they put the fear-mongering villain the Anuk-Ite in the ground for good.\n\nDefeating the Anuk-Ite was a lot easier said than done, though. Since the two-faced monster was able to reunite with its other half, no one in the pack could look it in the eye. The Anuk-Ite morphed into their worst fears — a clever way to revisit some of Teen Wolf's most classic villains — trying to trick them to look. This included a trip down memory lane with Void Stiles (Dylan O'Brien) and the Nogitsune from Teen Wolf's third and most critically acclaimed season.\n\nRIP Teen Wolf, Our Favorite Show About Werewolves Who Are Also Teenagers\n\nWhereas the first half of Season 6 ended on a more sentimental note, with the characters saying their final goodbyes and seemingly driving off into the sunset on separate paths, the series finale went for a more practical ending. There is no world in which Beacon Hills isn't under supernatural threat, and Scott McCall has never run away from a fight. The last shot of the show was Scott, with his pack, recruiting a young lone wolf to help them fight in a never-ending war whose goal is to wipe out all supernatural creatures, period.\n\nThe adventure continues, according to Teen Wolf creator and executive producer Jeff Davis. In our interview, he also elaborates on those spin-off talks and why one very special cast member wasn't asked back for the final episode.\n\nTyler Posey, Teen Wolf Photo: MTV\n\nYou brought back the Nogitsune! Why is that something you wanted to revisit?\n\nJeff Davis: It was partly a way to pay homage to all of the seasons and our gallery of villains. It was a way to get into Scott's head and his fear. At first I didn't want to do a finale that brings back cameos just for the sake of cameos. When we came up with this creature of fear, the Anuk-Ite, it actually felt like a pretty organic way to bring back these villains to see them one more time. It felt like a nice way to bring certain themes and certain ideas full circle. It was just great to see void Stiles and the Nogitsune again. It was really fun having them back.\n\nWhat was the cast's — especially Dylan's — reaction when they found out you were going to go back there?\n\nDavis: Dylan loved it. He said it was really fun to play again and that he missed it. Of course, when Aaron Hendry shows up, he got right back into character. It's amazing because his voice — we don't [special] effect it in in post-production. That's his voice that he's doing, which is pretty extraordinary.\n\nThe Anuk-Ite mentions Alison a lot when he's tormenting Scott. Is there a version of this script where you actually had him turn into Alison?\n\nDavis: No, actually. That could have been quite expensive.\n\nThe Craziest Moments in Teen Wolf History\n\nSo there was no phone call for Crystal Reed to come back for the final episodes?\n\nDavis: I think [Crystal] did such a great job as the Maid of Gevaudan in that episode, as Marie. That was a great last time to see her. In a certain way, you don't want to have some actors just pop up just to show face. It can almost feel like it almost tarnishes the memory of the character instead. I wanted to be careful of that.\n\nOne of the key moments in this final episode is Malia kissing Scott back into being able to heal. Would you want want to say that Malia is Scott's new anchor?\n\nDavis: In a way, we all need an anchor in the world to keep us steady... In that moment, what's happening is that Lydia is realizing that Scott needs to just be able to focus. She remembers the moment that helped her get Stiles to refocus his mind on not having a panic attack — that moment when she first kissed him. That is basically Malia offering Scott a steady hand. Saying that Malia is an anchor for Scott is very nice as well.\n\nI felt a little shocked at Comic Con when it was announced that Scott and Malia were going to be a thing, but over the season it really seemed to work. Why do they make a good couple?\n\nDavis: I love the idea that they were friends first and that they had a strong bond to begin with. They find each other. They step past friendship into this new place. I give a lot of credit to the writers for doing this very delicately. We worked hard at using moments to build and build — whether its a moment of confusion, \"Did I read that right?,\" a second glance that's interpreted one way. We wanted it to happen naturally. I love them together. Ot made me really happy to see them on screen.\n\nThe Cast of Teen Wolf Thanks Fans Before Final Season\n\nThe finale was a little light on \"Stydia\" moments. Is there a reason you guys didn't want to lean into that?\n\nDavis: One of the reasons was that [Season] 6A was a real Stydia season. We wanted to show their reunion and show them together, but there were many other threads to deal with in this finale that we wanted to make sure that we were giving equal weight to other characters and other storylines.\n\nAt the end of the finale, we get the sense that Scott and his pack are destined to fight forever. Is that true, or is there a time in which they can go on with their lives and be normal people?\n\nDavis: This may be the normal life for them, at the moment. When we sat down to break this finale, the idea that I had had in my mind was \"The Adventure Continues\" ending, which is not a full ending. It's not a finale where we kill off half the cast and then you see them married with children 20 years from now. We wanted to do a, \"There's always a fight. There's always another adventure.\"\n\nThere's been talk that there's going to be a Teen Wolf podcast and a spin-off down the line. How does this finale lead into those plans? How could those things pick up, given how you ended the original show?\n\nDavis: There aren't too many plans yet. Most of it is discussion at the moment. There are definitely threads that can be picked up. I love the idea of Scott and another pack, an entirely different crew of supernatural teenagers that he recruits, like this one kid Alex in this last episode. That could be really fun. I'd love to see a storyline and a podcast that picks up with Jackson and Ethan in London to follow them through that. That'd be really cool, too. We'll see what happens.\n\nThere's Already a Teen Wolf Reboot in the Works\n\nThe intro to Jackson and Ethan [earlier this season] was one of my most favorite Teen Wolf scenes ever.\n\nDavis: We loved doing that. I had a plan a long time ago. There was talk of trying to get Colton back in previous seasons. I'd always said, \"If he's coming back, he's coming back with a boyfriend.\" He's going to have gone through some big changes while he was in London and the idea of this sort of James Bond opening that reintroduces Jackson, now with Ethan, it was so much fun to plot and see filmed.\n\nTeen Wolf has made a big mark on MTV. What is this show's legacy for you?\n\nDavis: There's a certain legacy we leave behind. We've hit 100 episodes. We're the only 1-hour drama to have hit 100 episodes, to have done this many seasons. It's rather special, especially for the fact that the network has always been behind the show and big fans of the show as well. To have that kind of support and have such great collaborators, it makes it so much more worthwhile.\n\nIs there any final message that you have for the fans now the show is over?\n\nDavis: I would say thanks for going on this ride with us. I hope you enjoyed this last episode.", "images": ["https://tvguide1.cbsistatic.com/i/r/2019/10/18/f685e69b-f182-4e21-9d9b-07e1e72c7bcc/crop/1350x1350+525+0/thumbnail/70x70/4cf70c0b2a733223cdb9822614a79780/ghost-adventures-premium.jpg", "https://tvguide1.cbsistatic.com/i/r/2018/11/19/1c760966-e791-4108-b0a1-22c86068035e/crop/450x450+180+0/thumbnail/70x70/aa1505750c2ef29818564fa8799e66cd/a-charlie-brown-christmas-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2016/06/21/5ff5e256-8421-44d0-ae41-ffc5ca90edf8/crop/1573x1573+384+0/thumbnail/64x64/f989ddcb6c72bca5e875a9486d001cef/mean-girls0b8e9f81.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/07/30/7bbb5fb0-a8c0-45c4-bf3f-0be20129af49/crop/450x450+180+0/thumbnail/64x64/54fde10528c6848b3eacc4a699599027/netflix-best-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/10/18/e86fa142-c52e-4841-9173-65c6f38d2aec/crop/1920x1064+0+0/thumbnail/240x133/f9d0dfddf698c73a30b642e5422d821f/botdbckgrdv10final.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/07/09/116f8fd0-12b3-4b5f-9225-907e1920d52c/crop/900x900+350+0/thumbnail/64x64/39d0e09428dea5d637bf69e6b525ca10/cord-cutting-header.png", "https://tvguide1.cbsistatic.com/mediabin/showcards/celebs/s-u/thumbs/tyler-posey_275903_100x133.png", "https://tvguide1.cbsistatic.com/i/r/2019/09/16/96421533-414d-4f1c-b625-0a18e2e064a2/crop/1380x1380+345+0/thumbnail/70x70/db4211fed6f4a1246616b6a95cbf95ed/quiz-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/10/23/ffabe6ff-e7df-4918-881f-794f525fd9e3/crop/1575x1575+383+0/thumbnail/70x70/5c25db0c37fa4f0c536bee9b4a8dd3e2/tvguidexmas-podcastjd2340x1575.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/11/01/0cfd7b6e-081b-4152-af4b-bda2f7fd542a/crop/1575x1575+383+0/thumbnail/70x70/29d97a43594e8de7167c5b875798b2f7/goldenage-2340x1575.png", "https://tvguide1.cbsistatic.com/i/r/2019/11/27/c17e60b0-89eb-4e21-a29d-56905eb1e568/crop/1920x1064+0+0/thumbnail/240x133/630f7732dbc182b29663f58d00dd0b96/witcher2.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/07/25/bbf001eb-849e-470c-978c-057c9034e2f9/crop/810x449+0+0/thumbnail/240x133/5c70d097067cd1b6b0ce92168101573c/heartbreaking-tv-deaths-hpsm.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/10/22/90f27297-c277-47c4-9e2c-6ea99666bc99/crop/1600x887+0+0/thumbnail/240x133/e081e45dd5b37e829f0da76fb2c68129/giftguide.jpg", "https://tvguide1.cbsistatic.com/i/r/2018/11/20/3a734af3-65fe-4d2e-a208-2afb994eaf95/crop/450x450+180+0/thumbnail/70x70/a3a8393eb33904f3a40651f8a8277639/181120-ezekiel-elliot-hpsm.jpg", "https://tvguide1.cbsistatic.com/feed/1/596/thumbs/118295596_100x133.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/09/30/2185819f-27f7-4d86-ac8e-39f764ce1ec8/crop/1050x1050+675+0/thumbnail/70x70/2fc51144bff06957f75fa02beb7243ce/190930-the-grinder-pitch-everything-sucks.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/10/18/13f3374e-121e-4076-a965-25b39d80f359/crop/113x113+44+0/thumbnail/64x64/bf3ac71eb6c1e855f44b57941e2fa3bc/botd-small.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/11/27/49a11a5d-927f-4176-8606-0a1c8238d11a/crop/1380x1380+345+0/thumbnail/70x70/32c0155e7893d90c84efb2658a8d610d/legacies-news.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/10/30/39c21092-bbbb-44e8-82ea-b4284f69fbe0/crop/768x768+316+0/thumbnail/70x70/544ce51171bfb2c69700b34241867498/iseeyouman.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/10/18/55bef8e4-7d74-4d31-8c32-c44ca258139e/crop/1560x1560+390+0/thumbnail/70x70/68a3bbab90cabf9de95529bf6ee44603/191018-enlightened-laura-dern-2.jpg", "https://tvguide1.cbsistatic.com/i/r/2017/08/30/421cf70c-dc6a-4398-80f0-015e0247be5d/thumbnail/1300x867/0bd516e7c3a381635852c8d79cb406ae/170829-news-teen-wolf-tyler-posey.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/06/10/ca6fd6f4-fefd-495c-b293-f7bd409a79e7/crop/900x900+350+0/thumbnail/70x70/f9013b6f7e769e40685cbba72ccb79c6/scorecard-premium.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/06/24/bad78441-79da-42db-a5ce-9c3aabc5fb96/crop/1380x1380+345+0/thumbnail/64x64/08d7744d51313d82d88b031ee0a4d41d/190624-netflix-show-trio-2019-news.jpg", "https://tvguide1.cbsistatic.com/mediabin/showcards/celebs/d-f/thumbs/dylan-obrien_326189_100x133.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://tvguide1.cbsistatic.com/i/r/2019/08/30/8d502122-d410-44e4-b228-a8ea32550096/crop/306x306+122+0/thumbnail/64x64/884c347bf431a3cde5b625f78550b741/11-greys-anatomy.gif", "https://tvguide1.cbsistatic.com/i/r/2019/09/19/d5542c01-52ab-45a8-8e29-56706dca1c56/crop/1380x1380+345+0/thumbnail/70x70/d487f66a37986af5f9ebb025c5b537d3/survivor-brothers-hub.jpg", "https://tvguide1.cbsistatic.com/i/r/2019/05/14/75f68168-5c8d-4fcf-98e8-2cd9f94b619e/crop/1575x1575+383+0/thumbnail/64x64/d95ce2cfe82323e56e807a290d3f2f0d/mixed-ish-abc.jpg"], "top_img": "https://tvguide1.cbsistatic.com/i/r/2017/08/30/421cf70c-dc6a-4398-80f0-015e0247be5d/thumbnail/1300x867/0bd516e7c3a381635852c8d79cb406ae/170829-news-teen-wolf-tyler-posey.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.tvguide.com/news/teen-wolf-series-finale-jeff-davis-interview/", "title": "Teen Wolf Series Finale: Jeff Davis on Potential Spin-Off", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "apple-itunes-app": "app-id=333647776, affiliate-data=at=11l9QE, app-argument=https://www.tvguide.com/news/teen-wolf-series-finale-jeff-davis-interview/", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "description": "Jeff Davis breaks down the open-ended finale of Teen Wolf, the return of classic villains, and why a certain cameo never happened.", "og": {"title": "Teen Wolf Boss Breaks Down \"The Adventure Continues\" Series Finale Ending | TV Guide", "type": "article", "url": "https://www.tvguide.com/news/teen-wolf-series-finale-jeff-davis-interview/", "image": "https://tvguide1.cbsistatic.com/i/r/2017/08/30/421cf70c-dc6a-4398-80f0-015e0247be5d/thumbnail/1300x867/0bd516e7c3a381635852c8d79cb406ae/170829-news-teen-wolf-tyler-posey.jpg", "description": "We're so sad it's over!", "site_name": "TVGuide.com"}, "article": {"published_time": "2017-09-24T21:10:00-04:00", "tag": "MTV"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "title": "Teen Wolf Boss Breaks Down \"The Adventure Continues\" Series Finale Ending | TV Guide", "description": "Jeff Davis opens up about the #TeenWolf finale and where the franchise goes from here", "image": {"src": "https://tvguide1.cbsistatic.com/i/r/2017/08/30/421cf70c-dc6a-4398-80f0-015e0247be5d/thumbnail/1300x867/0bd516e7c3a381635852c8d79cb406ae/170829-news-teen-wolf-tyler-posey.jpg"}}}, "movies": [], "publish_date": 1506301800.0, "source": "https://www.tvguide.com", "summary": ""}