{"url": "https://people.com/style/cma-awards-2017-best-dressed-stars/", "text": "CMA Awards 2017: The Best Dressed Stars of the Night! From sexy sequins to bold ball gowns, see all the head-turning ensembles to hit the red carpet at country music's biggest night By Brittany Talarico ellipsis More Previous Applications View All Start Slideshow Next MIRANDA LAMBERT Image zoom Michael Loccisano/Getty has a Cinderella moment in a ice blue Tony Ward tulle gown with an illusion neckline and crystal-and-pearl embroidered snowflakes teamed with a pale pink lip and soft waves. 1 of 22 Applications View All Advertisement Advertisement CARRIE UNDERWOOD Image zoom John Shearer/WireImage skips all the sparkle for a sleek, structural royal blue Fouad Sarkis Couture gown with ruffle details on the sleeve, plus matching jewelry. 2 of 22 Applications View All KELSEA BALLERINI Image zoom Curtis Hilbun / AFF-USA.com dares to bare her abs in a custom Michael Kors Collection white gown with gold floral appliqués, plus retro side-swept waves 3 of 22 Applications View All Advertisement Advertisement MAREN MORRIS Image zoom John Shearer/WireImage makes her modeling debut with Wilhelmina in an edgy silver dress with a mesh skirt, floral embroidery and high front slit, plus layers of necklaces and glittering sandals. 4 of 22 Applications View All Advertisement FAITH HILL Image zoom Evan Agostini/Invision/AP in a black crystal-embroidered Armani Privé gown with a statement appliqué at the shoulder, plus a chic top knot, red lip and drop earrings. 5 of 22 Applications View All REBA MCENTIRE Image zoom Tammie Arroyo/AFF-USA.com continues to command the country style scene in a bedazzled black gown with velvet paneling plus her signature fiery blowout. 6 of 22 Applications View All Advertisement Advertisement Advertisement PINK Image zoom Evan Agostini/Invision/AP in a ivory tiered tulle Monsoori gown teamed with a black velvet belt, plus the cutest plus one to hit the red carpet, her 6-year-old daughter Willow Sage. 7 of 22 Applications View All Advertisement Advertisement LEA MICHELE Image zoom Evan Agostini/Invision/AP brings a mini moment to the red carpet in a sexy feather embellished Zuhair Murad design paired with strappy black Giuseppe Zanotti sandals and EF Collection and Vardui Kara jewelry. 8 of 22 Applications View All Advertisement KARLIE KLOSS Image zoom Michael Loccisano/Getty goes high-fashion country in a bright tangerine Elie Saab gown with lace paneleing, plus gold Beladora Jewelry bangles and a Edie Parker clutch. 9 of 22 Applications View All Advertisement Advertisement Advertisement RUBY ROSE Image zoom Evan Agostini/Invision/AP wears all the sparkle in her silver sequin halter gown which clearly needed no accessories. 10 of 22 Applications View All Advertisement Advertisement Advertisement DANIELLE BRADBERY Image zoom John Shearer/WireImage wears a vibrant red Leanne Marshall gown with a sexy high slit, plus Amrapali Jewels and satin ankle-wrap heels. 11 of 22 Applications View All Advertisement Advertisement JESSIE JAMES DECKER Image zoom Curtis Hilbun / AFF-USA.com shows off her bump in a elegant off-the-shoudler red gown, plus a black clutch, drop earrings and soft updo. 12 of 22 Applications View All Advertisement Advertisement Advertisement MICHELLE MONAGHAN Image zoom Invision/AP/Shutterstock makes catsuits everywhere look tame in her second-skin sequin cutout Paco Rabanne onesie teamed with matching accessories and Eva Fehren jewelry. 13 of 22 Applications View All Advertisement Advertisement Advertisement HILLARY SCOTT Image zoom Invision/AP/REX/Shutterstock also brings her bump to the CMAs red carpet (she’s expecting twins!) in an ankle-grazing floral velvet gown and emerald velvet platforms teamed with a deep plump pout and straight center-parted hair. 14 of 22 Applications View All Advertisement Advertisement KELLIE PICKLER Image zoom Evan Agostini/Invision/AP wears a feathered Pamella Roland mini, black strappy sandals and a chic updo. 15 of 22 Applications View All Advertisement Advertisement Advertisement BRITTANY SNOW Image zoom John Shearer/WireImage has a matchy-matchy moment in a off-the-shoulder blue cutout KaufmanFranco gown teamed with a coordinating clutch and Alezan and Vardui Kara jewelry. 16 of 22 Applications View All Advertisement Advertisement Advertisement LAUREN ALAINA Image zoom Evan Agostini/Invision/AP in a maroon gown with a sexy keyhole cutout and peplum embellishment at the waist, plus a black clutch and a half-up hairstyle. 17 of 22 Applications View All Advertisement Advertisement KAREN FAIRCHILD Image zoom Invision/AP/Shutterstock wears one of the biggest trends of the night (statement sleeves!) in her animal print gown teamed with a sparkly panther clutch. 18 of 22 Applications View All Advertisement Advertisement Advertisement KIMBERLY SCHLAPMAN Image zoom Evan Agostini/Invision/AP in a navy velvet high-slit IEENA for Mac Duggal gown teamed with a silver belt and strappy metallic sandals. 19 of 22 Applications View All Advertisement Advertisement Advertisement JOANNA GARCIA SWISHER Image zoom Curtis Hilbun / AFF-USA.com wears a romantic white dress with side cutouts and sequin accents plus a matching Kate Spade New York clutch. 20 of 22 Applications View All Advertisement Advertisement CAM Image zoom Evan Agostini/Invision/AP in a black off-the-shoulder Tadashi Shoji velvet midi dress with gold trim and tiered lace panels teamed with gold platform sandals. 21 of 22 Applications View All Advertisement Advertisement Replay gallery Share the Gallery Up Next Cancel Start Slideshow Next Share the Gallery Advertisement Everything in This Slideshow Advertisement EDIT POST\n\nClose View image CMA Awards 2017: The Best Dressed Stars of the Night!\n\nthis link is to an external site that may or may not meet accessibility guidelines.", "images": ["https://peopledotcom.files.wordpress.com/2017/11/michelle.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/fairchild.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/kellie-pickler.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/hillary-scott.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/kelsea.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/lauren.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/07/11375342_417123731803445_2077871559_n-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/11/joanna-swisher.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/karlie.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/brittany-snow.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/cam.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/danielle-bradbury.jpg?w=768", "https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/11/maren.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/ruby-rose.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/faith-hill.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/reba.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/kimberly.jpg?w=768", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/11/pink1.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/miranda-3.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/11/jjd.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/lea.jpg?w=768", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/11/miranda.jpg?w=768", "https://peopledotcom.files.wordpress.com/2017/11/carrie.jpg?w=768"], "top_img": "https://peopledotcom.files.wordpress.com/2017/11/miranda-3.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630", "keywords": [], "authors": ["Brittany Talarico"], "canonical_link": "https://people.com/style/cma-awards-2017-best-dressed-stars/", "title": "CMA Awards 2017: The Best Dressed Stars of the Night!", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "CMA awards, CMA album of the year, maren morris, what channel are the CMA awards on, carrie underwood cma awards, cma awards 2017 best dressed, best dressed stars cma awards 2017, miranda lambert cma awards 2017, miranda lambert cma awards dresses", "news_keywords": "CMA awards, CMA album of the year, maren morris, what channel are the CMA awards on, carrie underwood cma awards, cma awards 2017 best dressed, best dressed stars cma awards 2017, miranda lambert cma awards 2017, miranda lambert cma awards dresses", "og": {"title": "CMA Awards 2017: The Best, Boldest and Most Skin-Baring Looks of the Night!", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/style/cma-awards-2017-best-dressed-stars/", "description": "From sexy sequins to bold ball gowns, see all the head-turning ensembles to hit the red carpet at country music's biggest night", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2017/11/miranda-3.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/style/cma-awards-2017-best-dressed-stars/", "media": "https://peopledotcom.files.wordpress.com/2017/11/miranda-3.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/style/cma-awards-2017-best-dressed-stars/", "title": "CMA Awards 2017: The Best, Boldest and Most Skin-Baring Looks of the Night!", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2017/11/miranda-3.jpg?crop=0px%2C0px%2C1600px%2C840px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}, "url": "https://people.com/style/cma-awards-2017-best-dressed-stars/"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}