{"url": "http://www.newslocker.com/en-us/news/celebrity/does-hollywood-hate-the-easter-bunny/", "text": "Black Ink Crew: Chicago Star Charmaine Walker Reveals She's Married After Announcing Pregnancy Black Ink Crew: Chicago star Charmaine Walker is pregnant — and married!\n\nOne day after announcing that she and fiancé Nick Bey are expecting their first child together, the reality star stopped by PEOPLE TV’s Reality Check on Monday to exclusively reveal that they’d recently tied the knot.\n\n“My fiancé Nick is no longer my fiancé,” she teased. “We didn’t break up, we actually got legally married.”\n\n“We decided that we just w Read more\n\nMohamed Hadid's Ex-Fiancée Shiva Safai Confirms Split as She Posts Photo with New Boyfriend Second Wives Club alumna Shiva Safai has found love again after splitting from ex-fiancé Mohamed Hadid.\n\nFollowing a years-long engagement with Gigi and Bella Hadid‘s father, Safai, 39, confirmed her split from the real estate mogul last week, going Instagram official with her new boyfriend, Niels Houweling.\n\nSharing a photo of herself kissing Houweling’s cheek, Safai simply captioned the post with a black heart emoji.\n\nHer post comes more than five months after Houweling seeming Read more\n\nAmazon’s One-Day Sneaker Sale Features Classic Kicks Starting at Just $22 Thanks to Amazon’s one-day classic shoe and sneaker sale, now is officially the best time to upgrade your sneaker collection.\n\nIn honor of Cyber Monday, Amazon just launched a ton of sneaker deals on comfortable kicks for men and women from New Balance, Reebok, Puma, and more. With discounts up to 50 percent off, you can score iconic designs from the brands — like Reebok’s “Princess” sneaker and Puma’s recognizable formstrip sneaker — starting at just $22 Read more\n\nThe Bachelor's Liz Sandoz Reveals She Suffered a Miscarriage: 'Miserable' Experience Liz Sandoz is sharing her story of pregnancy loss.\n\nThe Bachelor season 21 contestant opens up alongside husband Vito Presta in Monday’s episode of her Miraculous Mamas podcast, where the spouses reveal Sandoz suffered a miscarriage accompanied by “severe cramping.”\n\n“It was something I had never felt in my life and I have very heavy periods and cramping but it was accompanied with vomiting and all sorts of stuff,” recalls Sandoz, 32, admitting she was “ner Read more\n\nRHOC Alumna Alexis Bellino Claps Back After Joke About Her 'Maids': They're 'Well Paid' The Real Housewives of Orange County alumna Alexis Bellino is defending her social media post about the people who clean her home.\n\nLast week, the Bravo personality shared a photo to Instagram of her dirty wooden floor, which was discovered after her green couch had been pushed back. “When your couch accidentally disconnects and you realize your maids aren’t doing deep cleaning. Found 2 socks too… ,” Alexis, 42, captioned the snap.\n\nAfter Alexis posted the image, some of h Read more\n\nRobert De Niro Defends Anna Paquin's Mostly Silent Role in The Irishman: 'She's Terrific' Robert De Niro is defending Oscar winner Anna Paquin‘s largely silent supporting role in the three-and-a-half-hour Netflix film, The Irishman.\n\nThe True Blood star only says seven lines of dialogue in Martin Scorsese’s acclaimed mob epic, causing some moviegoers to criticize her small role in a film full of men, including Al Pacino and Joe Pesci.\n\nIn The Irishman, the actress portrays Peggy Sheeran, the daughter of mafia hitman Frank Sheeran, played by De Niro.\n\n“She was very powe Read more\n\nKelly Clarkson Is Selling Her Massive Lakeside Mansion in Tennessee for $7.5 Million Kelly Clarkson is ready to break away from her lakeside mansion in Henderson, Tennessee.\n\nThe Voice judge, 37, has listed her 20,000-square-foot house for $7.5 million, TopTenRealEstateDeals.com reports. Set on four acres on a quiet cul-de-sac beside Old Hickory Lake, the home is just 25 miles from the city of Nashville. According to the listing, which is held by Jack Miller of Parks Real Estate, the home was built in 2007, and the singer-songwriter purchased it in 2012.\n\nClarkson had Read more\n\nIs Kirby Jenner Real? Everything We Know About the Comedian Parodying the Kardashians If you haven’t heard of Kirby Jenner, prepare to be amused and confused at the same time.\n\nThough his real identity remains a mystery, the man behind the Instagram parody account calls himself Kendall Jenner‘s “fraternal twin brother” and expertly Photoshops himself into her and her famous family’s photos.\n\nHe’s amassed a considerable following — to date, he boasts 1.2 million on Instagram and almost 12,000 on Twitter. And his platform is about to get a wh Read more\n\nBen Affleck and Jennifer Garner Reunite to Buy a Christmas Tree on Daughter Violet's Birthday Ben Affleck and Jennifer Garner are spreading Christmas cheer to their children.\n\nOn Sunday, the two exes were seen with their three children shopping for a Christmas tree. The day was a special one as it marked their daughter Violet’s 14th birthday.\n\n“They spent time as a family, as they have done in the past,” a source tells PEOPLE. “They got a tree, decorated, went to churchsaw a movie.”\n\nAffleck and Garner, both 47, also share daughter Seraphina, 10, and son Samuel Read more\n\nBritney Spears Has ‘Good Contact’ with Her Sons After Family Drama: ‘She Seems Happier’ After a rocky 2019, Britney Spears is feeling positive as she celebrates her 38th birthday.\n\nAmong the things she is grateful for is being on good terms with her sons, 13-year-old Sean Preston and 12-year-old Jayden James (from her previous marriage to Kevin Federline, 41).\n\nJust months ago, her father Jamie was involved in an alleged altercation with her eldest son, prompting Federline to file a police report claiming Sean was physically abused by his grandfather. (Jamie was later cleared of chil Read more\n\nJamie Lynn Spears Celebrates Sister Britney's Birthday with Throwback Pic of Their Matching Perms Jamie Lynn Spears is celebrating sister Britney Spears’ 38th birthday with an epic throwback photo!\n\nThe Zoey 101 star, 28, shared three pictures of the famous sibling duo on Twitter and Instagram today. And in the first snap, teenage Britney can be seen dancing on a front porch with her little sister. Both girls are wearing bikinis and rocking curly hair.\n\n“When Britney got a perm, well I had to have one too (as pictured above) Some things never change. Always looking up to you. Happy Read more", "images": ["http://www.newslocker.com/images/share-facebook.png", "http://www.newslocker.com/images/flags/gb.png", "https://img.newslocker.com/2019/12/02/196262221_725.jpg", "http://www.newslocker.com/images/flags/es.png", "https://img.newslocker.com/2019/12/02/196267965_725.jpg", "https://img.newslocker.com/2019/12/02/196267096_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/flags/pt.png", "http://www.newslocker.com/images/rss.png", "https://img.newslocker.com/2019/12/02/196270147_725.jpg", "https://img.newslocker.com/2019/12/02/196262504_725.jpg", "http://www.newslocker.com/images/flags/fr.png", "http://www.newslocker.com/images/flags/be.png", "https://img.newslocker.com/2019/12/02/196269803_725.jpg", "https://img.newslocker.com/2019/12/02/196265967_725.jpg", "https://img.newslocker.com/2019/12/02/196268880_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2019/12/03/196270873_725.jpg", "http://www.newslocker.com/images/share-linkedin.png", "http://www.newslocker.com/images/flags/mx.png", "http://www.newslocker.com/images/flags/ng.png", "https://img.newslocker.com/2019/12/03/196270874_350.jpg", "http://www.newslocker.com/images/flags/cl.png", "https://img.newslocker.com/2019/12/02/196265540_725.jpg", "http://www.newslocker.com/images/flags/cr.png", "http://www.newslocker.com/images/flags/ec.png", "http://www.newslocker.com/images/flags/in.png", "https://img.newslocker.com/2019/12/02/196269570_725.jpg", "https://img.newslocker.com/2019/12/02/196263220_725.jpg", "https://img.newslocker.com/2019/12/02/196267097_725.jpg", "https://img.newslocker.com/2019/12/02/196264764_725.jpg", "https://img.newslocker.com/2019/12/02/196264311_725.jpg", "http://www.newslocker.com/images/logo.jpg", "http://www.newslocker.com/images/flags/br.png", "http://www.newslocker.com/images/newslocker-cube.png", "http://www.newslocker.com/images/flags/do.png", "https://img.newslocker.com/2019/12/02/196266452_350.jpg", "https://img.newslocker.com/2019/12/02/196267098_725.jpg", "http://www.newslocker.com/images/flags/co.png", "http://www.newslocker.com/images/flags/ve.png", "http://www.newslocker.com/images/flags/au.png", "https://img.newslocker.com/2019/12/02/196268205_725.jpg", "http://www.newslocker.com/images/flags/de.png", "https://img.newslocker.com/2019/12/02/196263760_725.jpg", "https://img.newslocker.com/2019/12/02/196263761_725.jpg", "http://www.newslocker.com/images/flags/nl.png", "https://img.newslocker.com/2019/12/02/196269569_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414105452-600.Easter-Bunnies.ms.041417.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/flags/ar.png", "http://www.newslocker.com/images/flags/it.png", "http://www.newslocker.com/images/flags/us.png", "https://img.newslocker.com/2019/12/02/196269094_725.jpg", "https://img.newslocker.com/2019/12/02/196266244_350.jpg", "http://www.newslocker.com/images/flags/bo.png", "https://img.newslocker.com/2019/12/02/196266451_350.jpg", "https://img.newslocker.com/2019/12/02/196266810_725.jpg", "https://img.newslocker.com/2019/12/02/196267964_725.jpg", "https://img.newslocker.com/2019/12/02/196263221_725.jpg", "https://img.newslocker.com/2019/12/02/196267278_725.jpg", "http://www.newslocker.com/images/flags/ca.png", "http://www.newslocker.com/images/flags/pe.png"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414105452-600.Easter-Bunnies.ms.041417.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com:443/en-us/news/celebrity/does-hollywood-hate-the-easter-bunny/", "title": "Does Hollywood Hate the Easter Bunny?", "meta_data": {"description": "Ask anyone to name his favorite Easter movie, and chances are you'll get a blank stare.A few people might say Here Comes Peter Cottontail (which was actually a 1971 stop motion...", "og": {"title": "Does Hollywood Hate the Easter Bunny? - Celebrity news - NewsLocker", "description": "Ask anyone to name his favorite Easter movie, and chances are you'll get a blank stare.A few people might say Here Comes Peter Cottontail (which was actually a 1971 stop motion...", "type": "website", "url": "https://www.newslocker.com:443/en-us/news/celebrity/does-hollywood-hate-the-easter-bunny/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414105452-600.Easter-Bunnies.ms.041417.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": "1335791813,560345808"}, "robots": "index", "tradetracker-site-verification": "5d3490426a1947bbfe3c56de4fa490c0ba416113", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492264800.0, "source": "http://www.newslocker.com", "summary": ""}