{"url": "http://time.com/4914211/taylor-swift-snakes-timeline/", "text": "Taylor Swift teased her upcoming sixth album, Reputation, with a series of three slinky clips of a slithering snake. It seems the artist is moving into a new era — and will be taking that snake motif along with her.\n\nIn a way, Swift has always been associated with snakes: she was born in 1989, the year of the snake by the Chinese zodiac, and even titled her last album 1989. But previously, the slithery symbol was not an association she claimed or wanted as part of her narrative.\n\nBack in June 2016, Swift and DJ Calvin Harris ended their relationship in what seemed an amicable fashion. Soon after, Swift made it public that she had co-written the chart-topping hit “This Is What You Came For” for Harris under a pseudonym. In response, Harris fans soon took to Twitter to start hitting Swift with snake emojis. Snakes are, in biblical mythology and contemporary shorthand, cunning creatures. Some of Swift’s critics who felt the public reveal undermined Harris’s own success used snakes to share their belief that she had serpentine qualities of her own.\n\nThen in February 2016, Kanye West dropped his now-infamous rap song “Famous” off his album The Life of Pablo. One line, in particular, stood out: “I feel like me and Taylor might still have sex / Why? I made that b—h famous,” he sings. Up to that point, West and Swift had a fraught-turned-friendly history. While West had (notoriously) intercepted her win at the MTV Video Music Awards in 2009, they had afterwards mended fences, even sharing dinner and expressing plans to collaborate.\n\nBut after “Famous” came out, Swift condemned the line as misogynistic and expressed that she was not privy to the use of her name in that context. For West’s part, he said he had an “hour long convo with [Taylor] about the line and she thought it was funny and gave her blessings.”\n\nIn June 2016, Kim Kardashian West further supported her husband’s claim, telling GQ she had footage of a phone conversation in which Swift gave her approval to the lyric. And in July, Kim shared snippets of the taped audio of the phone call in question on her Snapchat story. Swift herself took to Instagram to respond, saying “you cannot ‘approve’ a song you haven’t heard,” and requested. to be “excluded from this narrative.”\n\nThe internet erupted into a frenzy. Coined the #KimExposedTaylorParty, Swift once again was bombarded with snake emojis. Feeding the fray, Kim even tweeted (obliquely) about “National Snake Day” in a seeming reference to Swift.\n\nThe snake emojis disappeared soon enough from Swift’s profiles. (Her Instagram account was the platform’s first test case of a filter to remove select words or emojis on certain feeds.)\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Choose your country United States of America Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo Congo, Democratic Republic of Cook Islands Costa Rica Cote d'Ivoire Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji Finland France French Guiana French Polynesia Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guinea Guinea-Bissau Guyana Haiti Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kiribati Korea Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Monaco Mongolia Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory, Occupied Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Republic of Korea Republic of Moldova Reunion Romania Russian Federation Rwanda Saint Helena Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia and Montenegro Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Islands Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom Virgin Islands (U.S.) Virgin Islands (British) Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Wallis and Futuna Islands Western Sahara Yemen Zambia Zimbabwe Please enter a valid email address. Please select your country. I can confirm I have read and accept the Terms Of Use. Please check to proceed. Sign Up Now You may unsubscribe from email communication at any time. See our Privacy Policy for further details. Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nSwift also began a year-long period of limited public appearances and social media withdrawal, all culminating in the deletion of content off her digital presence last week, the reclamation of the snake imagery (and reinsertion of herself into that narrative) this week and the final announcement of Reputation on Wednesday.\n\nHer first single is expected to drop Thursday at midnight. It’s unclear what role snakes will play in her next steps.\n\nWrite to Raisa Bruner at raisa.bruner@time.com.", "images": ["https://api.time.com/wp-content/uploads/2019/11/chrissy-teigen-john-legend-sexiest-man-alive.jpg?quality=85&w=594", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "http://pixel.watch/f3fo", "http://pixel.carambo.la/Pixel/tmnc11/112753/0/1/0", "http://assets.time.com/images/dianomi-logo.png", "http://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1200&h=628&crop=1", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2019/11/michelle-obama-ellen-degeneres-twitter-duet.jpg?quality=85&w=600"], "top_img": "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Raisa Bruner"], "canonical_link": "https://time.com/4914211/taylor-swift-snakes-timeline/", "title": "Read the Full History of Taylor Swift and Snakes", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "taylor swift, taylor swift snakes, taylor swift instagram, taylor swift snake emoji, taylor kim kanye, taylor swift controversy, snake emojis", "news_keywords": "taylor swift, taylor swift snakes, taylor swift instagram, taylor swift snake emoji, taylor kim kanye, taylor swift controversy, snake emojis", "description": "The '1989' singer has a fraught history with snakes — and snake emojis — thanks to a feud with Kanye West and Kim Kardashian last year.", "og": {"title": "Taylor Swift Has a History With Snakes: Here's the Backstory", "type": "article", "site_name": "Time", "url": "https://time.com/4914211/taylor-swift-snakes-timeline/", "description": "Everything you need to know about Taylor Swift and snakes", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/4914211/taylor-swift-snakes-timeline/", "description": "The '1989' singer has a fraught history with snakes — and snake emojis — thanks to a feud with Kanye West and Kim Kardashian last year.", "media": "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/4914211/taylor-swift-snakes-timeline/", "title": "Taylor Swift Has a History With Snakes: Here's the Backstory", "description": "Everything you need to know about Taylor Swift and snakes", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/01/taylor-swift.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}